["IN GENERAL\n1. Never take a beer to a job interview.\n2. Always identify people in your yard before shooting at them.\n3. It's considered tacky to take a cooler to church.\n4. If you have to vacuum the bed, it is time to change the sheets.\n5. Even if you're certain that you are included in the will, it is still considered tacky to drive a U-Haul to the funeral home. \n\nDINING OUT\n1. When decanting wine, make sure that you tilt the paper cup, and pour slowly so as not to \"bruise\" the fruit of the vine.\n2. If drinking directly from the bottle, always hold it with your fingers covering the label. \n\nENTERTAINING IN YOUR HOME\n1. A centerpiece for the table should never be anything prepared by a \n taxidermist.\n2. Do not allow the dog to eat at the table...no matter how good his \n manners are. \n\nPERSONAL HYGIENE\n1. While ears need to be cleaned regularly, this is a job that should \n be done in private using one's OWN truck keys.\n2. Proper use of toiletries can forestall bathing for several days. \n However, if you live alone, deodorant is a waste of good money.\n3. Dirt and grease under the fingernails is a social no-no, as they\n  tend to detract from a woman's jewelry and alter the taste of her\n finger foods.\n\nDATING (Outside the Family)\n1. Always offer to bait your date's hook, especially on the first date.\n2. Be aggressive. Let her know you're interested: \"I've been wanting to\n go out with you since I read that stuff on the fillin' station bathroom\n wall two years ago.\"\n3. Establish with her parents what time she is expected back. Some will\n say 10:00 PM; Others might say \"Monday.\" If the latter is the answer, \n it is the man's responsibility to get her to school on time. \n\nTHEATER ETIQUETTE\n1. Crying babies should be taken to the lobby and picked up immediately\n after the movie has ended.\n2. Refrain from talking to characters on the screen. Tests have proven \n they can't hear you. \n\nWEDDINGS\n1. Livestock, usually, is a poor choice for a wedding gift.\n2. Unless you are the groom, kissing the bride for more than 5 seconds \n may get you shot.\n3. For the groom, at least, rent a tux. A leisure suit with a\n cummerbund and a clean bowling shirt can create a tacky appearance.\n4. Though uncomfortable, say \"yes\" to socks and shoes for this special \n occasion. \n\nDRIVING ETIQUETTE\n1. Dim your headlights for approaching vehicles; Even if the gun is\n loaded, and the deer is in sight.\n2. When approaching a four-way stop, the vehicle with the largest tires always has the right of way.\n3. Never tow another car using panty hose and duct tape.\n4. When sending your wife down the road with a gas can, it is impolite to ask her to bring back beer.\n5. Do not have sex while traveling in a funeral procession.", "What does the dentist of the year get?...A little plaque.", "1.I'm busy. You're ugly. Have a nice day.\n2.Warning : I have an attitude and I know how to use it. \n3.Remember my name - you'll be screaming it later. \n4.Why do people with closed minds always open their mouths? \n5.I'm a multi-tasker : I can talk and tick you off at the same time. \n6.Do NOT start with me. You will NOT win. \n7.You have the right to remain silent, so please SHUT UP. \n8.Don't tick me off! I'm running out of places to hide the bodies. \n9.Guys have feelings too. But, like . . . who cares? \n10.I don't believe in miracles. I rely on them. \n11.Next mood swing : 6 minutes and counting. \n12.I hate everybody, and you're next. \n13.Please don't make me kill you. \n14.And your point is . . . \n15.I used to be schizophrenic, but we're OK now. \n16.All stressed out and no one to choke. \n17.I'm one of those bad things that happen to good people. \n18.How can I miss you if you won't go away? \n19.They aren't hot flashes, they're power surges! \n20.Of course I don't look busy . . . I did it right the first time.", "I hope you never get a tetanus shot; maybe you'll windup with lockjaw.", "Great to use in chat rooms or on cell phones!", "Great for those Email Signatures", "If the opposite of pro is con, isn't the opposite of progress, congress?", "There was a dyslexic insomniac agnostic.\r\n\r\nHe laid awake all night wondering if there really was a Dog.", "Do infants enjoy infancy as much as adults enjoy adultery?", "If a pig loses its voice, is it disgruntled?", "Before you judge someone, you should walk a mile in their shoes. \r\nThat way, when you judge them, you're a mile away and you have their shoes.", "When cryptography is outlawed, bayl bhgynjf jvyy unir cevinpl", "Two guys walked into a bar... you would have thought the second one would have ducked.", "The darkest hours come just before the dawn.\r\n\r\nSo if you're going to steal your neighbour's milk and newspaper, that's the time to do it.", "Remember, no-one is listening until you fart.", "If at first you don't succeed ... avoid skydiving.", "Give a man a fish and he will eat for a day...\r\n\r\nTeach him how to fish, and he will sit in a boat and drink beer all day.", "Never play leapfrog with a unicorn.", "Politics comes from the root \"poli-\", which means many, and \"-tics\", which means, blood-sucking creatures.", "Why do they have braille on drive-thru ATMs?", "Can women put mascara on with their mouth closed?", "Depression is merely anger without enthusiasm.", "The early bird may get the worm, but the second mouse gets the cheese.", "Eagles may soar, but weasels don't get sucked into jet engines.", "I drive way too fast to worry about my cholesterol.", "Success is relative. The more success, the more relatives!", "When everything is coming your way, you're on the wrong side of the freeway.", "A good way to save face is to keep the lower half shut.", "Silence is golden, because you never have to explain something you didn't say.", "I'm such an insomniac, the sheep fall asleep before I do.", "It is said that \"it is always in the last place you look\"\r\nWell of course!  Are there some people out there who keep looking after they find it?", "Those who live by the sword get shot by those who don't.", "Q: Why do women fart less than men? \r\n\r\nA: Because they won't shut up long enough to\r\nbuild up pressure.", "My wife keeps complaining I never listen to her...or something like that.", "Don't steal. The government hates competition.", "Why is the word abbreviation so long?", "My grandmother started walking five miles a day when she was 60. Now she's 97 years old and we don't know where the hell she is.", "If you are going to try cross-country skiing, start with a small country.", "I don't exercise because it makes the ice jump right out of my glass.", "Lawyers creed: A man is innocent until proven broke.", "The Egyptologist sneezed: Hapshepsut!", "Ever notice that \"fat chance\" and \"slim chance\" mean the same thing?", "Take your income and add 10%", "Every solution breeds new problems.", "Did you hear about the new Polish million dollar lotery?\r\n\r\nYou get a dollar a year for a million years!!!", "Sometimes I get the feeling the whole world is against me, but deep down I know that's not true.  Some of the smaller countries are neutral.\r\n\r\n-- Robert Orben", "Sign seen on a maternity-ward door:\r\n\r\nPush! Push! Push!", "Seen on a bumper sticker:\r\n\r\n\"I don't care who's on board, what you love, who you brake for or what you'd rather be doing.\"", "\"All my life I wanted to be someone; I guess I\r\nshould have been more specific.\"\r\n\r\n-Jane Wagner", "\"Karate is a form of martial arts in which people who have had years and years of training can, using only their hands and feet, make some of the worst movies in the history of the world.\"\r\n\r\n-Dave Barry", "Then there was the model who sat on a broken bottle and cut a good figure.", "Then there was the neat nurse, who made the patient without disturbing the bed.", "Then there were the three bears.  One married a giraffe.  The other two put him up to it.", "\"Madame,\" said the psychiatrist, \"you haven't got a complex; you ARE inferior.\"", "The wife ran into the house, screaming to her actor husband, \"Darling, come quick.  Your kids and my kids are beating up on our kids!\"", "The Romans had to give up their big holidays because of the tremendous overhead.  The lions ate up all of their prophets.", "I wonder who came up with the company People's Gas and where was their Pepto-Bismal?", "I make money the old-fashioned way.  My salary is the same as it was ten years ago.", "Actual Newspaper Headline:\r\n\r\nKids Make Great Snacks For Teachers.", "Overheard in a doctor's waiting room:\r\n\r\n\"My uncle had a cough like yours and he died.  Mind you, he was hiding under his neighbour's bed at the time.\"", "Did you hear about the scientist who crossed a carrier pigeon with a woodpecker?\r\n\r\nHe got a bird that not only delivers messages to their destination but knocks on the door when it gets there.", "What did the Zen Buddhist say to the New York hot-dog vendor?\r\n\r\n\"Make me one with everything.\"", "\"For Gods sakes Bill! Help her find it!.\" ~Hillary after walking in with Monica on her hands and knees in front of Bill", "What's the difference between an enzyme and a hormone?\r\n\r\nYou can't hear an enzyme!", "I recently went to my  30th class reunion from nursery school.  I didn't want to go because I've put on maybe 90 or 100 pounds since then.", "The amount of sleep required by the average person is about five minutes more.", "They say one way to build character is to do things you don't want to do.\r\n\r\nEvery day I do two things I don't want to do: I get out of bed in the morning and go to bed at night!", "Money is not the most important thing in the world.  Love is.\r\n\r\nFortunately, I love money.\r\n\r\n-- Jackie Mason", "The perfect climate is in bed.", "Opera: where somebody gets stabbed in the back and, instead of bleeding, sings.", "Blind Hookers eh? You've got to hand it to them.", "A woman's breasts are like a child's toys. They are meant for the child - but the husband is the one that usually ends up playing with them.", "If you don't like my driving, stay out of the bus shelters!", "Overheard at an exhibit in the science museum:\r\n\r\n\"It says here that oxygen was discovered over two hundred years ago.\"\r\n\r\n\"Wow! What did people breathe before that?\"", "Did you hear about the new dictionary for masochists?\r\n\r\nIt has all the words, but they're not in alphabetical order.", "Never ever take a sleeping pill and a laxative in the same night.", "My sister gave birth in a state-of-the-art delivery room.  It was so high tech that the baby came out cordless!", "Why don't ghosts make good magicians?\r\nYou can see right through them!", "Famous Last Words\r\n\r\n\"Oh come on, nobody's died from this in years.\"\r\n\r\n\"I saw it on Jackass last night.\"\r\n\r\n\"My dad did it when he was a kid.\"\r\n\r\n\"Yes, I'm sure that the power is off.\"\r\n\r\n\"It'll only hurt for a couple of days.\"\r\n\r\n\"See, I'm not afraid of heights.\"", "Famous Last Words:\r\n\r\n\"The gun isn't loaded, ok?\"\r\n\r\n\"Yes, I double checked.\"\r\n\r\n\"This fuse should give us plenty of time.\"\r\n\r\n\"I don't think he has a gun.\"\r\n\r\n\"This is a very safe neighborhood!\"\r\n\r\n\"I am 100% sure of the blast radius.\"", "FAMOUS LAST WORDS \r\n\r\n\"One sec, I've got to go the bathroom!\"\r\n\r\n:)\r\n\r\n\"It doesn't hurt... that... bad...\"\r\n\r\n\"This stuff works just as well!\"\r\n\r\n\"It looks like it's coming right towards us!\"\r\n\r\n\"Here, let me handle this, forget the cops!\"\r\n\r\n\"I read this in a 'how-to' magazine once.\"\r\n\r\n\"No I'm not a skydiver, but I did stay at a Holiday Inn Express Last Night.\"\r\n\r\n\"Proper equipment is for rich people.\"\r\n\r\n\"I don't know. Let's find out!\"\r\n\r\n\"I did it in a video game last night.\"\r\n\r\n\"Did you hear that? Sounded like something big. Where's that flashlight?\"\r\n\r\nAnd finally...\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\"OH SHIT!!!!\"", "What do you call an Irishman sitting in your backyard?\r\n\r\nPaddy O'Furniture", "Q. What's worse than raining cats and dogs?\r\n\r\nA. Hailing taxicabs!", "If two's a company and three's a crowd... what's four and five? \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNINE!!!!", "Ghost Stories by I.C. Spooks\r\n\r\nRocket to the sun by R.U.Nuts\r\n\r\nYour Book of Glamour by Q.T Pie\r\n\r\nThe Camel Ride by Major Bum - issore\r\n\r\nHow to Grow Shorter by Neil Down\r\n\r\nHow to Grow Taller by Stan Dup", "What's another name for a push-up bra? \r\nFalse advertisement", "The Chinese say: Baseball is wrong. Man with four balls cannot walk.", "Men who walk in front of car get tired. Men who walk in back of car get exhausted.", "Q: What's the difference between a girls track team and a tribe of pygmies?\r\n\r\nA: The pygmies are cunning little runts.", "Middle Age: when knees buckle and belts don't.", "Navy dentist's licence plate: TOP GUM", "Poise: the ability to continue speaking fluently while the other fellow is picking up the cheque.", "\"He who laughs last, thinks slowest.\"", "What's the difference between a Ford and a golf ball? \r\nYou can drive a golf ball 200 yards.", "Q: What's the difference between Snowmen and Snowwomen?\r\n\r\nA: Snowballs", "If Barbie is so popular, why do you have to buy all her friends?", "There are three kinds of people in this world, those who can count, and those who can not!", "Vacation begins when dad says. \"I know a shortcut\"!", "Energizer Bunny arrested... charged with battery.", "Lottery, a tax on people who can't do math", "all generalizations are false", "Eat right, stay fit, die anyway!", "IRS... we've got what it takes, to take what you've got", "Laugh alone and the world thinks you're an idiot.", "DNA, national dyslexic association", "Be nice to your kids, they'll choose your nursing home.", "I don't suffer from insanity... I enjoy every minute of it.", "No one is listening to you until you make a mistake.", "Dyslexics of the world, untie!", "DARE, to keep cops off donuts", "On the other hand, you have different fingers.", "Save a tree, eat a beaver!!", "Nothing is fool proof to a sufficiently talented fool.", "Sometimes I wake up grumpy, other times I let her sleep.", "Always remember that you are unique, just like everybody else!", "Always go to other peoples funerals, or they wont come to yours.", "Everywhere is within walking distance if you have the time.", "Bills travel through the mail at twice the speed of checks.", "Nobody's perfect-I'm a nobody.", "Ask me about my vow of silence..", "Courdory pillows--they're making headlines.", "What is another word for Thesaurus?", "The hardness of butter is directly proportional to the softness of bread.", "Her name was Virginia.  They called her Virgin for short, but not for long!", "And out of the night came the terrible scream,\r\n\"Who put the sand in the Vaseline!?\"", "What's the difference between two yards?\r\n\r\n\r\nA. Usually a fence.", "When physics meets Star Wars: \r\n\r\nMay the net force be with you!", "Q. What do you call a guy that sits on your doorstep?\r\n\r\nA. A Matt.", "What disasters would happen if a waiter dropped a plate of turkey?\r\n\r\n\r\nThe  downfall of Greece,  the overthrow of Turkey  and the break up of China", "Borrow money from a pessimist---They don't expect it back.", "A clear conscience is usually the sign of a bad memory.", "A man said his credit card was stolen but he decided not to report it because the thief was spending less than his wife did.", "A three-legged dog walks into a saloon in the Old West. He sidles up to the bar and announces \"I'm looking for the man who shot my paw.\"", "When is it Michael Jackson's bed time? \r\n\r\n\r\n\r\n\r\n\r\nWhen the little hand meets the big hand.", "What do you call happiness? \r\n\r\n\r\n\r\n\r\n\r\n\r\nSeeing your mother-in-law's photo on the back of a milk carton!", "What's the difference between an alchoholic & a drug addict? \r\n\r\n\r\n\r\nThe alchoholic drives over the stop sign, while the drug addict waits for it to turn green.", "Q.   What's the difference between a paycheck and your dick ?    \r\n\r\n\r\n\r\nA.   You don't have to beg a woman to blow your paycheck.", "Q.   What are the small bumps around a woman's' nipples for ?    \r\n\r\n\r\n\r\nA.   They are Braille for \"suck here\".", "Q.   What's the difference between a woman and a coffin ?    \r\n\r\n\r\n\r\n\r\nA.   You come in one and go in the other.", "Q.   Why do women close their eyes during sex ? \r\n\r\n\r\n\r\n   \r\nA.   They can't stand seeing a man have a good time.", "Q.   What's the difference between your wife and your job ?    \r\n\r\n\r\n\r\nA.   After 5 years your job will still suck.", "Q.   What's the best thing about a blow job ?   \r\n\r\n\r\n\r\n \r\nA.  Ten minutes of silence.", "Q.   How is a woman like a laxative ?    \r\n\r\n\r\n\r\n\r\nA.   They both irritate the shit out of you.", "Q.   Why do husbands die before their wives ?    \r\n\r\n\r\n\r\n\r\n\r\n\r\nA.   They want to", "Q.   What's the difference between a woman with PMS and a pitbull ?    \r\n\r\n\r\n\r\n\r\n\r\nA.    Lipstick.", "What is a horse's favourite Shakepearean play?\r\n\r\nRodeo and Juliet", "Q)Where do penguins go to dance?\r\nA)The snowball", "Q)Where do eskimo pigs live?\r\nA)In a pigloo.", "Q)Why does a traffic light turn red?\r\nA)You would to if you had to change in front of all those people.", "Q)what do you call a polar bear in the jungle?\r\nA)lost!", "Q)A hippo is sitting on your chair....what time is it?\r\nA)Time to get a new chair", "Q: What do you get when a rooster crosses a duck?\r\nA: A bird that gets up at the quack of dawn!", "Q.Why shouldn't you wear snow boots?\r\nA.Because they will melt!", "Q. Why would Snow White be a good judge?\r\nA.Because she's the fairest in the land.", "Q.Where do tough chickens come from?\r\nA.Hard boiled eggs!", "Q.Why did the house go to the doctor?\r\nA.To get a cure for his window pane!", "What did the chef name his son?\r\nStu", "How do you fix a broken tomato?\r\nWith tomato paste!", "What did the cat say to the elephant?\r\n\r\n\"......................meOW!\"", "The Lazy Boy, by Yu Doit", "What do soccer players drink?\r\n\r\nPenaltea!", "Why does Santa have 3 gardens? \r\n\r\nSo he can ho ho ho.", "Why do firemen use red suspenders?\r\n\r\nTo hold their pants up!!!", "What do you call a herd of white people?\r\nAvalanche\r\nWhat do you call a herd of black people?\r\nMudslide\r\nWhat do you call a herd of mexicans?\r\nJailbreak!", "Friends are like condoms, they protect you when things get hard.", "Grandchildren are God's reward\r\nfor not killing your children.", "Where should a dressmaker live?\r\n\r\nOn the outskirts of the city.", "Why was the broom tired?\r\n\r\nIt over swept.", "Two white horses fell in the mud and three came out.", "What kind of soup weighs 1000 pounds?\r\n\r\nWon ton soup!", "You know that you're a really boring person when someone steals your identity and then tries to give it back.", "Which came first - the chicken or the egg?\r\n\r\n\r\n\r\nIt depends on who got laid first!", "There was a young hooker named Gail\r\nwhose price was tattooed on her tail.\r\nAnd on her behind,\r\nfor the sake of the blind,\r\nwas the same information in Braille.", "Hygiene Teacher: How can you prevent diseases caused by biting insects? \r\n\r\nJose: Don't bite any.", "First guy (proudly): \"My wife's an angel!\"\r\n\r\nSecond guy: \"You're lucky, mine's still alive.\"", "Do you know the punishment for bigamy? \r\n\r\nTwo mothers-in-law.", "Teacher: Willy, name one important thing we have today that we didn't have ten years ago. \r\n\r\nWilly: Me", "Just think, if it weren't for marriage, \r\nmen would go through life thinking they had no faults at all.", "If the entire world was a stage and God was the director, what we need is a rehearsal.", "Why don't women blink during foreplay?\r\n\r\nThey don't have time.", "What do you call a woman who knows where her husband is every night?\r\n\r\nA widow.", "How are men and parking spots alike?\r\n\r\nGood ones are always taken. Free ones are mostly handicapped or extremely short.", "The zoology teacher asked a small boy to make a sentence using the word \"possum.\"\r\n\r\nHe answered, \"Maw got horny and gave possum.\"", "A guy walks into a bar wearing a pair of jumper cables around his neck. \r\n\r\nThe bartender looks at him and says, \"Hey buddy, don't try to start anything...\"", "The only reason I would take up jogging is so that I could hear heavy breathing again.", "What's the best form of birth control after 50?\r\n \r\n\r\nNudity.", "What's the difference between a girlfriend and a wife?\r\n \r\n\r\n45 lbs.", "What's the difference between a boyfriend and a husband?\r\n \r\n\r\n45 minutes.", "What's the difference between a new husband and a new dog?\r\n  \r\nAfter a year, the dog is still excited to see you.", "What makes men chase women they have no intention of marrying?\r\n  \r\nThe same urge that makes dogs chase cars they have no intention of driving.", "Why does the bride always wear white?\r\n \r\n\r\nBecause it's good for the dishwasher to match the stove and refrigerator.", "Why don't bunnies make noise when they have sex?\r\n \r\n\r\nBecause they have cotton balls.", "What's the difference between Beer Nuts and Deer Nuts?\r\n \r\n\r\nBeer Nuts are $1, and Deer Nuts are always under a buck.", "What's the difference between a toad and a horny toad?\r\n\r\nOne says \"Ribbit ribbit\" and the other says \"Rubbit rubbit\".", "So Many Men, So Few Who Can Afford Me.\r\n\r\nGod Made Us Sisters, Prozac Made Us Friends.\r\n\r\nMy Mother Is A Travel Agent For Guilt Trips.\r\n\r\nPrincess, Having Had Sufficient Experience With Princes, Seeks Frog.\r\n\r\nCoffee, Chocolate, Men ... Some Things Are Just Better Rich.\r\n\r\nDon't Treat Me Any Differently Than You Would The Queen\r\n\r\nWarning: I Have An Attitude And I Know How To Use It.\r\n\r\nOf Course I Don't Look Busy...I Did It Right The First Time.\r\n\r\nDo Not Start With Me.  You Will Not Win.\r\n\r\nSorry If I Looked Interested.  I'm Not.\r\n\r\nIf You Want Breakfast In Bed, Sleep In The Kitchen.", "What did the number 0 say to the number 8?\r\n\r\n\"Hey, nice belt!\"", "Hickory, Dickory Dock\r\nThree mice ran up the clock\r\nThe clock struck one...\r\n\r\nThe rest got away with minor injuries", "Want to hear a clean joke? Bob took a bath with bubbles.\r\n\r\nWant to hear a dirty joke? Bubbles is Bobs neighbor.", "Q: What do you get when you cross the Atlantic Ocean with the Titanic?\r\n\r\nA: Halfway.", "Q. Why don't witches like to ride their brooms when they're angry?\r\n\r\nA. They're afraid of flying off the handle!", "Never accept a drink from a urologist, nor a friendly handshake from a proctologist.", "Never get into fights with ugly people, they have nothing to lose.", "When putting cheese in a mousetrap, always leave room for the mouse.", "Sometimes you are the dog. Sometimes you are the hydrant", "Everyone has a right to be stupid. Some just abuse the privilege.", "Whatever hits the fan will not be evenly distributed.", "Be a good housekeeper. When you leave him ... get a good lawyer ...keep his house", "Gardening Rule: When weeding, the best way to make sure you are removing a weed and not a valuable plant is to pull on it. If it comes out of the ground easily, it is a valuable plant.", "The easiest way to find something lost around the house is to buy a replacement.", "Never take life seriously. Nobody gets out alive anyway.", "There are two kinds of pedestrians -- the quick and the dead.", "Life is sexually transmitted.", "An unbreakable toy is useful for breaking other toys.", "Health is merely the slowest possible rate at which one can die.", "The only difference between a rut and a grave is the depth.", "Health nuts are going to feel stupid someday, lying in hospitals dying of nothing.", "Get the last word in: Apologize.", "Some people are like Slinkies...not really good for anything, but you still can't help but smile when you see one tumble down the stairs.", "Why does a slight tax increase cost you two hundred dollars and a substantial tax cut saves you thirty cents?", "How is it one careless match can start a forest fire, but it takes a whole box to start a campfire?", "Some people say that I'm superficial, but that's just on the surface.", "Now that food has replaced sex in my life, I can't even get into my own pants.", "Marriage changes passion. Suddenly you're in bed with a relative.", "I saw a woman wearing a sweatshirt with \"Guess\" on it. \r\n\r\nSo I said \"Implants?\" \r\n\r\nShe hit me.", "I don't do drugs. \r\n\r\nI get the same effect just standing up fast.", "Sign in a Chinese Pet Store: \"Buy one dog, get one flea...\"", "I live in my own little world. But it's OK. They know me here.", "I got a sweater for Christmas. I really wanted a screamer or a moaner.", "If flying is so safe, why do they call the airport the terminal?", "I don't approve of political jokes. I've seen too many of them get elected.", "There are two sides to every divorce: Yours and shithead's.", "I love being married. It's so great to find that one special person you want to annoy for the rest of your life.", "Every day I beat my own previous record for number of consecutive days I've stayed alive.", "How come we choose from just two people to run for president and 50 for Miss America?", "Isn't having a smoking section in a restaurant like having a peeing section in a swimming pool?", "Why is it that most nudists are people you don't want to see naked?", "Snowmen fall from Heaven unassembled.", "Every time I walk into a singles bar I can hear Mom's wise words: \"Don't pick that up, you don't know where it's been!\"", "Not only am I redundant and superfluous, but I also tend to use more words than necessary.", "Life is full of uncertainties...or could I be wrong about that?", "A good friend will come and bail you out of jail...but, a true friend will be sitting next to you saying, \"Damn...that was fun!\"??", "Energizer Bunny arrested - charged with battery. \r\n\r\nA pessimist's blood type is always b-negative. \r\n\r\nPractice safe eating - always use condiments. \r\n\r\nA Freudian slip is when you say one thing but mean your mother. \r\n\r\nShotgun wedding: A case of wife or death. \r\n\r\nI used to work in a blanket factory, but it folded. \r\n\r\nIf electricity comes from electrons... does that mean that morality comes from morons? \r\n\r\nMarriage is the mourning after the knot before.", "A hangover is the wrath of grapes. \r\n\r\nCorduroy pillows are making headlines. \r\n\r\nIs a book on voyeurism a peeping tome? \r\n\r\nDancing cheek-to-cheek is really a form of floor play. \r\n\r\nBanning the bra was a big flop. \r\n\r\nSea captains don't like crew cuts. \r\n\r\nDoes the name Pavlov ring a bell? \r\n\r\nA successful diet is the triumph of mind over platter.", "Time flies like an arrow. Fruit flies like a banana. \r\n\r\nA gossip is someone with a great sense of rumor. \r\n\r\nWithout geometry, life is pointless. \r\n\r\nWhen you dream in color, it's a pigment of your imagination. \r\n\r\nCondoms should be used on every conceivable occasion. \r\n\r\nReading whilst sunbathing makes you well-red. \r\n\r\nWhen two egotists meet, it's an I for an I. \r\n\r\nAlarms: What an octopus is.", "Crick: The sound that a Japanese camera makes. \r\n\r\nDockyard: A physician's garden. \r\n\r\nIncongruous: Where bills are passed. \r\n\r\nKhakis: What you need to start the car in Boston. \r\n\r\nOboe: An English tramp. \r\n\r\nPasteurize: Too far to see. \r\n\r\nPropaganda: A gentlemanly goose. \r\n\r\nToboggan: Why we go to an auction", "A bicycle can't stand alone because it is two tired.", "She had a boyfriend with a wooden leg, but broke it off.", "A chicken crossing the road is poultry in motion.", "If you don't pay your exorcist you get repossessed.", "When a clock is hungry it goes back four seconds.", "Not to worry: the man who fell into an upholstery machine is fully recovered.", "The difference between the Pope and your boss.... \r\n\r\nThe Pope only expects you to kiss his ring.", "My mind works like lightning. One brilliant flash and it is gone.", "The only time the world beats a path to your door is if you're in the bathroom.", "It used to be only death and taxes were inevitable. Now, of course there's shipping and handling, too.", "A husband is someone who, after taking the trash out, gives the impression that he just cleaned the whole house.", "My next house will have no kitchen -- just vending machines and a large trash can.", "A brunette said, \"I was worried that my mechanic might try to rip me off. I was relieved when he told me all I needed was turn signal fluid.\"", "I'm so depressed. My doctor refused to write me a prescription for Viagra. He said it would be like putting a new flagpole on a condemned building.", "I hate sex in the movies. Tried it once. The seat folded up, the drink spilled and that ice, well, it really chilled the mood.", "Definition of a teenager? \r\n\r\nGod's punishment for enjoying sex.", "As we slide down the banister of life, may the splinters never point the wrong way.", "Progress in airline flying; \r\n\r\nNow a flight attendant can get a pilot pregnant.", "I remember when sex was safe and flying was dangerous.", "Flashlights are tubular metal containers kept in a flight bag for the purpose of storing dead batteries.", "What is the similarity between air traffic controllers and pilots? \r\n\r\nIf a pilot screws up, the pilot dies; if ATC screws up, the pilot dies.", "\"You certainly look cool.\"\r\n\"Thanks, you don't look so hot yourself.\"", "Never hold your farts in. \r\nThey travel up your spine, into your brain, \r\nand that's where you get shitty ideas from.", "A girl's legs are her best friends, but the best of friends must part.\r\n-- Redd Foxx", "\"My karma ran over my dogma.\"\r\n-Anonymous", "What do you get when you cross a donkey with an onion?\r\n\r\nA piece of ass that brings tears to your eyes!", "The journey of a thousand miles ...\r\n\r\n\r\nbegins with a broken fan belt and a leaky tire.", "Sex is like air. \r\nIt's not important... \r\n\r\nunless you aren't getting any.", "Never test the depth of the water with both feet.", "If you lend someone $20 and never see that person again...\r\n\r\nIt was probably worth it.", "Some days you are the bug.\r\n\r\nSome days you are the windshield.", "Don't worry; \r\n\r\nit only seems kinky the first time.", "Good judgment comes from bad experience, \r\n\r\nand a lot of that comes from bad judgment.", "There are two theories to arguing with women.\r\n\r\nNeither one works.", "Generally speaking, you aren't learning much when your lips are moving.", "We are born naked, wet and hungry, and get slapped on our ass...\r\nthen things get worse.", "Everyone seems normal until you get to know them", "There is a fine line between \"hobby\" and \"mental illness.\"", "Waitress: \"Would you like your coffee black?\"\r\nCustomer: \"What other colors do you have?\"", "Sam: \"Where have I seen your face before?\"\r\nPam: \"Right where it is now.\"", "\"I feel so miserable without you, it's almost like having you here.\"\r\n-Stephen Bishop\r\n \r\n\"I've just learned about his illness. Let's hope it's nothing trivial.\"\r\n- Irvin S. Cobb\r\n \r\n\"I have never killed a man, but I have read many obituaries with great pleasure.\"\r\n- Clarence Darrow\r\n \r\n\"He has never been known to use a word that might send a reader to the dictionary.\"\r\n- William Faulkner (about Ernest Hemingway)\r\n \r\n\"He is not only dull himself, he is the cause of dullness in others.\"\r\n-Samuel Johnson\r\n \r\n\"He had delusions of adequacy.\"\r\n- Walter Kerr\r\n \r\n\"I've had a perfectly wonderful evening. But this wasn't it.\" \r\n-Groucho Marx\r\n \r\n\"I didn't attend the funeral, but I sent a nice letter saying I approved of it.\"\r\n- Mark Twain\r\n \r\n\"Some cause happiness wherever they go; others whenever they go.\"\r\n-Oscar Wilde\r\n \r\n\"He has no enemies, but is intensely disliked by his friends.\"\r\n-Oscar Wilde\r\n \r\n\"He has Van Gogh's ear for music.\"\r\n- Billy Wilder", "Reporters interviewing a 104 year-old woman: \"And what do you think is the best thing about being 104?\" the reporter asked.\r\n\r\n\r\nShe simply replied, \"No peer pressure.\"", "The nice thing about being senile is you can hide your own Easter eggs.", "Practice safe eating ...Always use condiments.", "Beauty is only a light switch away", "Fighting for peace is like\r\nscrewing for virginity.", "No matter how good she looks,\r\nsome other guy is sick and tired\r\nof putting up with her shit.", "Make love, not war. \r\n\r\nHell, do both\r\n\r\nGET MARRIED!", "A Woman's Rule of Thumb: \r\nIf it has, tires, or testicles,\r\nyou're going to have trouble with it.", "Q: What do you call a non-churchgoer?\r\n\r\nA: A Seventh-Day Absentist", "Mothers of teens know why animals eat their young.", "Who eats cereal and plays golf?\r\n\r\nTony the Tiger Woods.", "Why is it hard for dalmatians to play hide-and-seek?\r\n\r\nBecause they're always spotted!", "What do you get when you aim a nuclear weapon at a disobedient country?\r\n\r\nSouth Korean Barbecue.", "What do you call a holy man that fries potatoes?\r\n\r\nA chipmonk", "What kind of coffee was served on the Titanic?\r\n\r\nSanka.", "What is the best thing about dating a homeless woman?\r\n\r\nYou can drop her off anywhere.", "What is the difference between in-laws and outlaws?\r\n\r\nOutlaws are wanted.", "What should a woman say to a man she's just had sex with?\r\n\r\nWhatever she wants. He's sleeping.", "After your hands become coated with grease, your nose will begin to itch.", "If it jams, force it. If it breaks, it needed replacing anyway.", "Interchangeable parts aren't.", "The one item you need is always in short supply.", "Never forget that your weapon was made by the lowest bidder!", "\"I Give Evolution Two Opposable Thumbs Up.\"", "Q:  What do you call a sheep that does karate?\r\nA:  A lamb chop", "Q:  Why are there so many Smiths in the phone book?\r\nA:  They all have phones.", "Why are Democrats better than Republicans in bed?\r\nYou've never heard of getting a good piece of elephant, have you?", "\"God give me patience....And make it quick!\"", "Q: What do you get when you cross a Scottish sheep with a Peruvian Mountain Goat? \r\n\r\nA: The Dolly Llama.", "LOVE: A word involving four letters, two vowels, two consonants and two idiots. It refers to a disease that can be cured by marriage.\r\n\r\nARCHITECT: A guy not \"macho\" enough to be an engineer and not queer enough to be an interior designer.\r\n\r\nTO DANCE: It refers to the vertical frustration of a horizontal desire.\r\n\r\nBRAIN: An organ that allows us to think we think.\r\n\r\nBOY SCOUT: A child dressed like an idiot guided by an idiot dressed like a child.\r\n\r\nHEADACHE: A woman's most trustworthy modern contraceptive.\r\n\r\nBUST: Statue of a man without hands or the parts of a woman where a man's hands have been.\r\n\r\nORAL EXAM: A test you must pass to become an intern in the White house.\r\n\r\nA POLITICAL CANDIDATE: A person who gets money form the rich and votes from the poor in order to protect them from each other.\r\n\r\nTONGUE: A sexual organ that some degenerates use in order to speak.\r\n\r\nPRIEST: A person everyone calls \"Father\" except for his own children, who call him \"Uncle\".\r\n\r\nEASY: It is said of a woman who has the sexual morality of a man.\r\n\r\nMAN: A living thing who at the age of nine months emerges from a place to which we will try to return for the rest of this life.\r\n\r\nINTELLECTUAL: A person capable of thinking for more than one hour about anything other than sex.\r\n\r\nMODESTY: Knowing you are perfect without telling anyone.\r\n\r\nNYMPHOMANIA: A term describing any woman who wants to have sex more often than a man.", "What do fish paint with?\r\n\r\nWater colours!", "Where do fish keep their life savings?\r\n\r\nAt the river bank!", "People who live in glass houses should make love in the basement.\r\n \r\nNever read the fine print. There ain't no way you're going to like it.\r\n \r\nIf you let a smile be your umbrella, then most likely your ass will get soaking wet.\r\n \r\nThe only two things we do with greater frequency in middle age are urinate and attend funerals.\r\n \r\nThe trouble with bucket seats is that not everybody has the same size bucket.\r\n \r\nTo err is human, to forgive - highly unlikely\r\n \r\nDo you realize that in about 40 years, we'll have thousands of old ladies running around with tattoos?\r\n \r\nMoney can't buy happiness -- but somehow it's more comfortable to cry in a Porsche than in a Hyundai.\r\n \r\nDrinking makes some husbands see double and feel single..\r\n \r\nLiving in a nudist colony takes all the fun out of Halloween.\r\n \r\nAfter a certain age, if you don't wake up aching in every joint, you are probably dead.", "What's the nicest thing about a nudist wedding?\r\n\r\nYou don't have to ask - you can see who the best man is.", "What has a whole bunch of little balls and screws old ladies?\r\n\r\nA bingo machine", "True bravery is arriving home late after a boy's night out, being assaulted by your wife with a broom, and still having the guts to ask: Are you still cleaning, or are you flying somewhere?", "What is the definition of wicker box?\r\n\r\nIt's what Elmer Fudd wants to do to Madonna.", "What does a Mexican firefighter name his twin sons?\r\n\r\nJose and Josbe", "Proverb : Behind every successful man, there is a woman.\r\n\r\nRefined by me : Behind every successful man, there is a very much surprised woman.", "Q. Why do women prefer old gynecologists?\r\n\r\nA. They have shaky hands!", "Q: What's green, has 3 eyes, sharp teeth, and blood on its face?\r\n\r\nA: I don't know, but it's on your shoulder!", "Why do seagulls fly over the sea? Because if they flew over the bay, they'd be called bagels!", "Why do you need a driver's license to buy liquor when you can't drink and drive?", "What do you call a rabbit who tells jokes?\r\n\r\nA FUNNY BUNNY!", "My survey which I conducted said that 8 out of 4 people don't understand fractions.", "Hey! I recognize you! You're the third one over on the evolutionary scale!", "What do you call a black person that wants to be and acts just like Jackie Chan? Blackie Chan", "Why do psychics ask so many questions when they supposedly already know the answers?", "All believers in telekinesis raise my hand!", "I couldn't fix your brakes, so instead I made your horn louder.", "What starts with the letter F and ends in UCK?\r\n\r\n\r\nFiretrUCK", "Q: What do you call a schizophrenic Buddhist?\r\n\r\nA: Someone who is at two with the universe.", "Q: What did baby corn say to mama corn?\r\n\r\nA: Where's pop corn?", "I went into a restaurant that served 'breakfast at any time'. So, I asked for French Toast in the time of the Renaissance", "Q: How many people does it take to change a lightbulb?\r\nA: Depends on how many lightbulbs need changing.", "Where did they sign the Declaration of Independence?\r\n\r\n\r\nAt the bottom.", "Atlas is the biggest thief in history, because he held up the whole world.", "My uncle is very superstitious.  He won't work any week that has a Friday in it.", "You know your day is bad if your twin sister forgot your birthday.", "What do you get when you mix cigarettes in hot water?\r\n\r\nA soggy butt.", "Did you hear about the tree that made an  Ash of itself?", "At weddings old people poke me and say, \"You're next!\"\r\n\r\nAt funerals, I do the same.", "What's the hardest part of skydiving?\r\n\r\n\r\nThe ground!", "What do you get when you cross a porcupine with a shark?\r\n\r\n\r\nFar far away!", "A Mexican and an Iraqi terrorist are in a car.\r\n\r\nWho's driving?\r\n\r\n\r\n\r\n\r\nAnswer:  The police.", "What's the difference between MJ and Mr. Potato Head?\r\n\r\nMJ has more noses.\r\n\r\n\r\nHow are MJ and a Wal-Mart bag alike?\r\n\r\nThey're both plastic and hazardous to children.", "A wise man once said.\r\n\r\nI Don't know ask A Girl!\r\n\r\nA wise man Once Said.\r\n\r\nLife sucks and then we die.", "I didn't lose my mind! I sold it on Ebay...", "For all of you who say I need anger management...\r\n\r\nJust to let you know, if I could control my anger, I'd destroy you with it!", "Why did the penny become angry with the nickel?\r\n\r\nBecause the nickel was a \"penny pincher\".", "What did one tradesman say to another?\r\n\r\nI hope you have a \"barter\" day tomorrow.", "What's the difference between a Mexican and a Bench?\r\n\r\nA bench can support a whole family.", "Girl, \"Oh, Superman I love you so much!\"\r\n\r\nSuperman,\"I don't blame you.\"", "My family has no traditions. We just do the same thing, over and over again, each year.", "\"So what's your dog's name?\"\r\n\r\n\"I don't know. He won't tell me.\"", "JUDGE:  \"The court can produce a dozen witnesses who saw you rob the bank.\"\r\n\r\nROBBER:  \"Big deal! I can bring in hundreds of people who didn't see it!\"", "DOCTOR: \"Do you smoke or drink?\"\r\n\r\nPATIENT:  \"I didn't know I had a choice.\"", "PIANO PLAYER: \"Do you think I have a gift for playing?\"\r\n\r\nLISTENER:  \"No, but I'll give you one for stopping!\"", "\"What's the difference between ignorance and apathy?\"\r\n\"I don't know; and I couldn't care less.\"", "It's only funny until someone gets hurt... \r\n\r\nThen it's hilarious!", "Don't drink and drive, you'll spill your beer.", "I work at Bed, Bath and Beyond\r\n       in the 'Beyond' dept.", "If to give a man a fish, he eats for a day, but if you teach a man to fish...\r\n\r\nHe has to buy a license, poles, bait, and sit on his behind for four hours.", "There are 10 kinds of people in the world. Those who can do binary and those who can't.", "Do bald men wash their head with soap or shampoo?", "What are Martians favorite sweets?\r\nMars-mallows.", "What's the difference between a man and a condom?\r\n\r\nCondoms have changed. They're no longer thick and insensitive.", "What's a man's ultimate embarrassment?\r\n\r\nHaving an erection, walking into a wall, and hurting his nose.", "What kind of sign does a prostitute hang on her door when she goes on vacation?\r\n\r\n\"GO SCREW YOURSELF!\"", "Q. What's six inches long, two inches wide, and drives women wild?\r\n\r\nA. Money.", "Always be smarter than the inanimate object that you're working with.", "What are the first 4 words in the Mexican National Anthem?\r\n\r\n\"Attention all K-Mart shoppers\"", "Ever wonder why bottled water costs so much when there is so much of it?\r\n\r\n\r\n\r\n\r\nSpell \"evian\" backwards.....", "In any organization there is one person who knows what is going on. That person must be fired.", "The law of drunkenness- You can't fall off the floor.", "Nothing is impossible for the man who doesn't have to do it himself.", "Creativity is great, but plagiarism is faster.", "I didn't lose my mind, I just let it wander and it never came back. I miss it so much.", "\"Live in a way such that you would not be ashamed to sell your parrot to the town gossip.\"\r\n\r\n-- Will Rogers, Humorist", "Remember- There's a light at the end of every tunnel... just hope it's not a train!", "It's impossible to be a participant in the march of time and not get a few blisters.", "What's an innunedo?  An Italian hemorrhoid prepareation.\r\n\r\nWhat do you call a good looking girl on the campus of Clemson University?  A visitor.\r\n\r\nIraq, a good place to take a shiite.\r\n\r\nNew rules for poker in Los Angeles -- four clubs beat a king.\r\n\r\nWhy are all dumb blonde jokes one liners?  So men can understand them.\r\n\r\nWhat's the difference between Gov't bonds and men?  Gov't bond eventually mature.\r\n\r\nWhat did God say after he created man?  \"I can do better than this . . .\"\r\n\r\nWhat's the best thing to come out of a peter?  The wrinkles.\r\n\r\nWhat's the difference between 'light' and 'hard'?  You can sleep with the light on.\r\n\r\nWhat's the difference between 'dark' and 'hard'?  It stays dark all night.\r\n\r\nWhat does a man consider to be a 7-course meal?  A hot dog and a six-pack.\r\n\r\nWhat's the difference between Saddam Hussein and a bucket of shit?  The bucket.\r\n\r\nWhat do Nagasaki, Hiroshima and Baghdad have in common.  Nothing, yet.\r\n\r\nWhat do Saddam Hussein and Little Miss Muffit have in common?  They both have curds in their whey.\r\n\r\nWhat do you call an Iraqi with a goat under one arm and a sheep under the other?  A bisexual.\r\n\r\nWhat's the difference between Hussein and your ex-wife's lawyer?  Hussein's demands are reasonable.\r\n\r\nPres. Bush is replacing all the male troops in Iraq with women diagnosed with PMS -- they're a hell-of-a-lot meaner and they retain water.\r\n\r\nWhy don't men's balls hang down to their knees?  The vacuum in their brain keeps 'em up.\r\n\r\nWhat does a female lawyer use for birth control?  Her personality.\r\n\r\nHow can you reunite the Beatles?  Use two more bullets.\r\n\r\nI've never been drunk -- just over served.\r\n\r\nI was as pure as the driven snow until I drifted.\r\n\r\nWhat's the difference between oral sex and sushi?  The rice.\r\n\r\nWhat's black, 12\" long and hangs in front of an asshole?  A stethoscope.\r\n\r\nMan standing next to a woman in a bar.  He looks at her and says, \"Can I smell your pussy?\"  \"Absolutely not,\" says the woman.  \"Must be your feet.\"\r\n\r\nWhy are the Rams changing their name to the Tampons?  They're only good for one period and they have no second string.", "Why is there an L in NOEL?", "When you put 'THE' and 'IRS' together, it's an anagram of 'THEIRS'. Coincidence? I think not!", "Why is it that when babies are born they only weigh like 7 lbs. yet the mom weighs 30 lbs. more?\r\n\r\nWhy do they call the small candy bars the \"fun sizes\"? Wouldn't be more fun to eat a big one?\r\n\r\nWhy do people say PIN number when that truly means Personal Identification Number Number?\r\n\r\nIf the handicapped bathrooms are for people who can't walk why do they put them at the end of the bathrooms?\r\n\r\nCan someone give up lent for lent?\r\n\r\nWhy do people say, \"You've been working like a dog,\" when dogs just sit around all day?\r\n\r\nIf marriage means you fell in love, does divorce mean you climbed out?\r\n\r\nAnd why isn't the word 'gullible' in the dictionary?", "Did you hear about the inexperienced terrorist who tried to blow up a bus?\r\n\r\nHe burnt his mouth on the exhaust pipe.", "Why is it that people say they \"slept like a baby\" when babies wake up like every two hours?\r\n\r\nIf London Bridge is standing why is there a song about it falling down?\r\n\r\nIf the weather man says \"it's a 50% chance of rain\" does that mean he has no idea if its going to rain or not?\r\n\r\nCan't anybody who has a job go in the \"employees only\" doors at restaurants? Shouldn't they be more specific and say \"employees of THIS place only\"?\r\n\r\nWhy do doctors leave the room while you change? They're going to see you naked anyway, aren't they?\r\n\r\nDid you know there is a page 666 in The Bible?\r\n\r\nIf you could walk through the walls, wouldn't you fall through the floor?\r\n\r\nWhat does the T in T-Shirt really mean?\r\n\r\nDo birds pee?\r\n\r\nWhat does OK actually mean?\r\n\r\nWhy do we say \"bye bye\" but not \"hi hi\"?\r\n\r\nWhy is it called a TV set when there is only one?\r\n\r\nIf Jimmy cracks corn and no one cares, why is there a song about him?\r\n\r\nWhy are they called goose bumps? Do geese get people bumps?\r\n\r\nWhy can magicians make things disappear into thin air, but not thick air?\r\n\r\nAnd why do people point to their wrist when asking for the time, but people don't point to their crotch when they ask where the bathroom is?", "If it weren't for electricity, we'd all be watching television by candlelight. - George Gobel", "Q: What do you have when there are 100 rabbits standing in a row and they all start hopping backwards?  \r\n\r\nA: Receding hare line.", "What did the tornado say to the pecan tree?  \"Hold onto your nuts, this is not your average blow job!\"\r\n\r\nWhat has four hands and eats aunts?  Two uncles.\r\n\r\nWhat do you get when you cross an onion with a donkey?  Usually an onion with long ears, but sometime you get a piece of ass that will make your eyes water.", "You don't have to go faster than the bear, you just have to go faster than the slowest guy running from the bear.", "If Wile Coyote had enough money for all that Acme crap, why didn't he just buy dinner?\r\n\r\nIf there's an exception to every rule, is there an exception to that rule?\r\n\r\nWhy do we leave expensive cars in the driveway, when we keep worthless junk in the garage?\r\n\r\nWhy do they call it taking a dump? Shouldn't it be leaving a dump?\r\n\r\nWhy is it good to be a Daddy's girl, but bad to be a Momma's boy?\r\n\r\nAren't you tired of people asking you rhetorical questions and you don't know if they are rhetorical questions or not?\r\n\r\nIf a cow laughed real hard, would milk come out her nose?\r\n\r\nDid you ever notice when you blow in a dog's face he gets mad at you? But when you take him in a car, he sticks his head out the window!\r\n\r\nIf quitters never win, and winners never quit, who came up with, \"Quit while you're ahead\"?\r\n\r\nIf Fed Ex and UPS were to merge, would they call it Fed UP?", "Save the trees - wipe your arse with an owl.\r\n\r\n\"My point-and-click interface is an Uzi submachine gun.\"\r\n\r\nSaint Michael - patron saint of underpants\r\n\r\nI'm an apathetic sociopath - I'd kill you if I cared.\r\n\r\nI'm completely sane, according to the voices in my head.\r\n\r\nMy wife's an earth sign. I'm a water sign. Together we make mud.\r\n\r\nSkiing is for people who can't just break their legs around the house.\r\n\r\nPenguins mate for life. That doesn't surprise me much cos they all look alike.\r\n\r\nGrammar has gots to be one of the most importantest things ever!\r\n\r\nIf I were a recovering s*x addict, I'd opt for group therapy.\r\n\r\n\"I hope I never do anything to bring shame on myself, my family or my other family.\"\r\n\r\n\"Secret\": Something you tell to one person at a time.\r\n\"Tomorrow\": One of the greatest labour saving devices of today.\r\n\r\nOpera is when a guy gets stabbed in the back and instead of bleeding, he sings.\r\n\r\nMy short-term memory ain't what it something something.\r\n\r\nI am an I/O Error.", "* \"On the advice of our solicitors, this T-shirt bears no message at this time\".\r\n* \"That's it! I'm calling me granny\" (seen on a seven-year-old)\r\n* \"Rehab is for quitters\"\r\n* \"My dog can lick anyone\"\r\n* \"Party - my cot - 2 a.m.\" (on a baby-size T-shirt)\r\n* \"If a woman's place is in the home WHY AM I ALWAYS IN THIS FECKIN' CAR!\"\r\n* \"They call it 'PMT' cos 'Mad Cow Disease' was already taken\"\r\n* \"A picture is worth a thousand words - but it uses up a thousand times the memory.\"\r\n* \"HAM AND EGGS - a day's work for a chicken; a lifetime commitment for a pig.\"\r\n* \"Computer programmers don't byte, they nybble a bit.\"\r\n* \"The trouble with life is there's no background music.\"\r\n* \"The original point and click interface was a Smith & Wesson.\"\r\n* \"Two rights do not make a wrong. They make an airplane.\"\r\n* \"Quoting one is plagiarism. Quoting many is research.\"", "If you want to make someone laugh, use this line:\r\n \r\nSorry. say that again. I couldn't hear you over my fart.", "Q: What does Donald Trump say before he lights off a fire work?\r\n\r\nA:You`re fired!", "You know you're ghetto when you carry food stamps in a money clip!", "Wait a second!!! I am NOT a loser! I have tried. I am a failure.", "What did the porcupine say to the cactus?\r\n\r\n\"Is that you, mommy?\"", "JUST because I have a short attention span doesn't mean I", "When I die I want to go peacefully - like my grandfather did - in his sleep.\r\n\r\nNot screaming like the passengers in his car.", "Don't you have a terribly empty feeling - in your skull?", "What's the difference between a duck and a spider?\r\n\r\nA duck has a web in its feet, a spider has its feet in a web!", "What do you get when you cross a praying mantis with a termite?\r\n\r\nA bug that says grace before eating your house.", "Why do they call it disposable douche? Is there a kind of douche you keep after using?\r\n\r\nWhy do they call them \"apartments\" when they are all stuck together?\r\n\r\nWhy do they put Braille dots on the keypad of the drive-up ATM?\r\n\r\nWhy do they report power outages on TV?\r\n\r\nWhy do they sell a pound cake that only weighs 12 ounces?\r\n\r\nWhy do 'tug'boats push their barges? \r\n\r\nWhy do we drive on parkways and park on driveways?\r\n\r\nWhy do we have hot water heaters?\r\n\r\nWhy do we play in recitals and recite in plays?\r\n\r\nWhy do we put suits in a garment bag and garments in a suitcase?\r\n\r\nWhy do we sing 'Take me out to the ball game', when we are already there? \r\n\r\nWhy do we wash bath towels? Aren't we clean when we use them?\r\n\r\nWhy does \"slow down\" and \"slow up\" mean the same thing? \r\n\r\nWhy does an alarm clock \"go off\" when it begins ringing?\r\n\r\nWhy does flammable and inflammable mean the same thing?\r\n\r\nWhy doesn't \"onomatopoeia\" sound like what it is?\r\n\r\nWhy don't you ever hear about gruntled employees?\r\n\r\nWhy don't you ever see baby pigeons?\r\n\r\nWhy is a person who plays the piano called a pianist, but a person who drives a race car not called a racist?\r\n\r\nWhy is a women's prison called a penal colony?\r\n\r\nWhy is it called a \"building\" when it is already built?\r\n\r\nWhy is it called a bust, when it stops right before the part it is named after?\r\n\r\nWhy is it called a TV \"set\" when you only get one?\r\n\r\nWhy is it called 'after dark', when it is really after light?\r\n\r\nWhy is it so hard to remember how to spell MNEMONIC?\r\n\r\nWhy is it that when you're driving and looking for an address, you turn down the volume on the radio?\r\n \r\nWhy is it when a door is open it's ajar, but when a jar is open it's not adoor?\r\n\r\nWhy is it when two planes almost hit each other it is called a \"near miss\"?\r\n\r\nWhy is it, whether you sit up or sit down, the result is the same?\r\n\r\nWhy is Mickey Mouse bigger than his dog Pluto?\r\n\r\nWhy is the alphabet in that order? Is it because of that song? \r\n\r\nWhy is the word \"abbreviate\" so long?\r\n\r\nDon't you have to get up to get to the tape?\r\n\r\nWhy is there an expiration date on SOUR cream?\r\n\r\nWhy is there only ONE Monopolies Commission?\r\n\r\nWhy isn't \"palindrome\" spelled the same way backwards?\r\n\r\nWhy isn't phonetic spelled the way it sounds? \r\n\r\nWhy isn't there mouse-flavored cat food?\r\n\r\nWould a fly without wings be called a walk?\r\n\r\nYou know how most packages say \"Open here\". What is the protocol if the package says, \"Open somewhere else\"?\r\n\r\nCan fat people go skinny-dipping?\r\n\r\nAfter eating, do amphibians have to wait an hour before getting out of the water?\r\n\r\nYou know that little indestructible black box that is used on planes, why can't they make the whole plane out of the same substance?\r\n\r\nAre there seeing eye humans for blind dogs?\r\n\r\nHave ex-bankers become disinterested?\r\n\r\nHave ex-civil lawyers been distorted?\r\n\r\nHave ex-locomotive engineers been derailed?\r\n\r\nHave ex-mathematicians become dysfunctional?\r\n\r\nHave ex-punsters been expunged?\r\n\r\nHow come toy hippos are always blue, or purple, when real hippos are brown?\r\n\r\nWhy is it that whenever you sing to the radio, your voice is higher? Even when you have a low voice?\r\n\r\nWhy is most lunchmeat bigger than the bread?\r\n\r\nIs there a certain temperature at which it stops being qualified as cold? At what temperature does it qualify as hot?\r\n\r\nIf you were a pastor, and you were getting married, would you hire a pastor, or would you do the wedding yourself?\r\n\r\nWhy is Joey short for Joe, when Joey has more letters?\r\n\r\nCan someone have their head in the clouds and be down-to-earth at the same time?\r\n\r\nIf a person suffered from amnesia and then was cured would they remember\r\nthat they forgot?\r\n\r\nIf you died with braces on would they take them off? \r\n\r\nWhy do mattresses have designs on them when they're always covered with sheets?\r\n\r\nIf a singer sings their own song during a karaoke party, is it considered karaoke?\r\n\r\nIf conjoined twins participate in sports, do they count as one or two players?\r\n\r\nWhy is shampoo clear but conditioner not?\r\n\r\nDo cows have calf muscles?\r\n\r\nHow come French fries are not considered a vegetable, they are just deep fried potatoes?\r\n\r\nDo babies produce more spit than adults?\r\n\r\nWhy do they say \"an alarm going off,\" if it is really going on?", "If someone says, \"A penny for your thoughts,\", and you give them your two cents worth, what happens to the other penny?", "Q. Why are families like chocolate?\r\n\r\n\r\n\r\nA. They are mostly sweet, with a few nuts!", "Q.  What do me and a mirror have in common? \r\nA.  When we see your face we both crack up!", "What is the difference between a lawyer and a wood tick?\r\n\r\nA wood tick falls off when you die.", "How can you spot a happy motorcyclist?\r\n\r\nBy the bugs in his teeth.", "\"Honk if you hate noise pollution!\"", "At the end of a T.V. show, why do they say \"filmed in front of a live audience?\"\r\n\r\n\r\nWell, it wouldn't be a dead audience, would it?", "Joke: Why does Snoop Dogg Carry an umbrella?\r\n\r\n\r\n\r\n\r\nAnswer: For Drizzle my nizzle", "Don't follow in my footsteps, I walk into walls.", "I've often wanted to drown my troubles, \r\nbut i can't get my wife to go swimming!", "Few women admit their age, Few men act theirs.", "Never test the depth of water with both feet.\r\n\r\nDon't take candy from strangers, unless they offer you a ride.\r\n\r\nI'll start exercising as soon as i get into shape.\r\n\r\nIf you have something to say, raise your hand and put it over your mouth.\r\n\r\nMaybe you should go to e-bay and buy a clue.\r\n\r\nEarth is full. go home.\r\n\r\nGee, I'd like to care, but I wasn't given that gene.\r\n\r\nMirrors don't lie, and lucky for you, they can't laugh either. (i like this one)\r\n\r\nIf you can't laugh at yourself, at least let me do it.\r\n\r\nI don't know what makes you so dumb, but it really works.\r\n\r\nMen are from Mars, Women are from Visa. (ok that was kind'a dumb)\r\n\r\nI used to have super powers but my therapist took them away.", "Q. How do lesbians handle their liquor?\r\nA. By the ears. (Lick her)", "Q. What do tight pants and a cheap motel have in common?\r\nA. No ball room", "Why did the squirrel go to the acorn shop?\r\n\r\nHe broke his nuts on something!", "laugh and the whole world laughs with you,\r\ncry and some-one will hear you,\r\nbut fart and you're on your own!!", "The squirrel's eyes widened as he tried to move but froze when he realized........\r\n\r\nHe'd buried the wrong nuts!", "I'm trying computer dating, at least I'm not getting dumped... but I do get deleted.", "if stealing kids is kidnapping,is stealing adults oldnapping?", "Where does a Dog go when he loses his tail?\r\n\r\nAnswer:\r\n\r\nA retailer", "Why do snakes always lose in court? \r\n\r\n\r\n\r\nAnswer:\r\n\r\n\r\nThey don't have a leg to stand on!", "Did you hear the one about the gay midget?\r\n\r\nHe came out of the cupboard.", "Why is it better to be killed by a shark than by a lawyer?\r\n\r\n\r\n\r\nAnswer: \r\n\r\nThe shark would be brief.", "Why did the chicken cross the road?\r\n\r\nWhy do you care?", "What did Spock find in the toilet?\r\n\r\n\r\nThe captain's log.", "Did you hear about the two peanuts who got mugged on their walk down the street?\r\n\r\n\r\nThey were assaulted", "I'm a schizophrenic and so am I.", "What did the ocean say to the beach?\r\n\r\nNothing, it just waved", "How do you tell a boy chromosome from a girl chromosome?\r\n\r\nPull down their genes.", "Did Adam and Eve have belly buttons?\r\n\r\nWhat happens if you pop the popcorn upside down?\r\n\r\nWhy aren't HAMburgers made out of ham? \r\n\r\nAnd my favorite:\r\nDonde estan mis pantalones?", "Why am I stronger than Tarzan?\r\n\r\nBecause I can beat on my chest without screaming.", "1. Well, this day was a total waste of makeup. \r\n\r\n2. Make yourself at home! Clean my kitchen. \r\n\r\n3. Who are these kids and why are they calling me Mom? \r\n\r\n4. Don't bother me. I'm living happily ever after. \r\n\r\n5. Do I look like a people person? \r\n\r\n6. This isn't an office. It's Hell with fluorescent lighting. \r\n\r\n7. I pretend to work. They pretend to pay me. \r\n\r\n8. Therapy is expensive, poppin' bubble wrap is cheap! You choose. \r\n\r\n9. Bottomless pit of needs & wants. \r\n\r\n10. I like cats, too. Let's exchange recipes. \r\n\r\n11. If I want to hear the pitter patter of little feet, I'll put shoes on my cat. \r\n\r\n12. Does your train of thought have a caboose? \r\n\r\n13. Let me show you how the guards used to do it. \r\n\r\n14. And just how may I screw you over today? \r\n\r\n15. I'm not crazy, I've just been in a very bad mood for 30 years. \r\n\r\n16. If only you'd use your powers for good instead of evil... \r\n\r\n17. Allow me to introduce my selves. \r\n\r\n18. Sarcasm is just one more service we offer. \r\n\r\n19. Whisper my favorite words: \"I'll buy it for you.\" \r\n\r\n20. Better living through denial. \r\n\r\n21. Whatever kind of look you were going for, you missed. \r\n\r\n22. Suburbia: where they tear out the trees\r\n& then name streets after them. \r\n\r\n23. Do they ever shut up on your planet? \r\n\r\n24. Are these your eyeballs? I found them in my cleavage. \r\n\r\n25. I'm not your type. I'm not inflatable. \r\n\r\n26. I'm trying to imagine you with a personality. \r\n\r\n27. A cubicle is just a padded cell without a door. \r\n\r\n28. I can't remember if I'm the good twin or the evil one. \r\n\r\n29. Don't worry. I forgot your name, too! \r\n\r\n30. Adults are just kids who owe money. \r\n\r\n31. I just want revenge. Is that so wrong? \r\n\r\n32. I work 40 hours a week to be this poor. \r\n\r\n33. You say I'm a \"b----\" like it's a bad thing. \r\n\r\n34. Can I trade this job for what's behind door #2? \r\n\r\n35. Macho Law forbids me from admitting I'm wrong. \r\n\r\n36. Nice perfume. Must you marinate in it? \r\n\r\n37. Not all men are annoying. Some are dead. \r\n\r\n38. Chaos, panic, & disorder-my work here is done. \r\n\r\n39. You look like crap. Is that the style now? \r\n\r\n40. Everyone thinks I'm psychotic, except for the friends in my head.", "Here's a stupid warning label:\r\n\r\nIf you look at a fire extinguisher, it will say \"Non-flamable\"", "If you fall down a bottomless pit... do you eventually die of starvation?", "Why doesn't the glue inside the bottle dry?", "If you put a slinky on an escalator, would it go forever?", "what happened to the lost boy?\r\nhe came to a house and wrote a joke that was exactly like this except in larger font and with a little more umph ya know what i mean a very humerous joke in fact i do believe he is working on more ya know i lied i ain't lost i just like making very very very long jokes sorta like this one ya know what i wrote is called a run on sentence my papa told me about run ons they are fun i can't imagine not having a papa if you don't have one i feel bad for you starting at 'starting' i wrote 100 words thats a lot but still my favorite number is464,546,879,6 but i won't go till there i can't believe i counted my words how nerdy i'm stopping soon wait......... 127 ha buh bye", "Why should you never play poker in the jungle?\r\n\r\n-because there are too many cheatahs!!", "Why drink and drive when you can smoke and fly?", "May your troubles be as few and far between as your great-grandmother's teeth.", "Found in micellaneous things.\r\n\r\nIf at first you don't succeed, skydiving isn't for you.\r\n\r\nI don't have a short attention span, it's just that I-\r\n\r\nEtc.:a sign to make others believe that you know more than you actually do.\r\n\r\nMy mind not only wanders; sometimes it leaves completely. \r\n\r\nIf your dog is fat, you're not getting enough exercise.\r\n\r\nWithout geography, you're nowhere.\r\n\r\nWhen someone tells you nothing is impossible, tell him to dribble a football.\r\n\r\nMan who scratch ass should not bite fingernail.\r\n\r\nBaseball is wrong; man with four balls cannot walk.\r\n\r\nMan who drives like hell, bound to get there.\r\n\r\nIt takes many nails to build a crib, but one screw to fill it.\r\n\r\nCrowded elevator smells different to midgets.\r\n\r\nMan who stands on toilet is high on pot.\r\n\r\nThat will be all for now. Ciao", "Q. How do you keep a jack ass in suspense?\r\n\r\n\r\n\r\nA. I`ll tell you tomorrow.", "Here's a lighted dynamite stick, please hold it until I get back.", "To all who do NOT believe in evolution, I have proof:\r\nMY spaghetti from two weeks ago has started growing arms and legs and I think it just called me, \"Mommy\". \r\n\r\n\r\n\r\nBy the way, I, myself, do NOT believe in the theory of evolution.", "I used to be schizophrenic, but now we're just fine", "Vini vedi velcro\r\n(I came, I saw, I stuck around)", "Q: What is a cheerleader's favorite drink? \r\n\r\nA: Root Beer!", "What did the Chinese people call their retarded son?\r\n\r\nSum Ting Wong", "What do you call a drummer without a girlfriend?\r\n\r\nHomeless!\r\n\r\n\r\nP.S. This works for just about any instrument player.", "Q) What do you call an ant from overseas?\r\n\r\n\r\nA) Important", "I bought some powdered water but I don't know what to add to it.", "I bought a dog the other day. I named him Stay. It's fun to call him. \"Come here, Stay! Come here, Stay!\" He went insane. Now he just ignores me and keeps typing.", "How do you tell when you're out of invisible ink?", "Change is inevitable... except from vending machines.", "The problem with keeping an open mind is that all my ideas tend to fall out.", "My goal is to find a soulmate.                             \r\n\r\n\r\nIt's not cheating, just multi-tasking.", "When everything's coming up roses, it's time to celebrate.  But, when everything's coming up daisies, it's time to mourn.", "I always follow my first instinct,\r\n\r\nThat is unless I second guess myself.\r\n---------------------------------------------\r\nWhy don't you have a drink,\r\n\r\nyour only driving to a funeral right?\r\n---------------------------------------------\r\nWhy buy a watch from the competitor,\r\n\r\nI thought time was against us?\r\n----------------------------------------------\r\nYou must be smart,\r\n\r\nbecause you just confused us all.\r\n----------------------------------------------", "1) A clear concience is a sign of a bad memory.\r\n\r\n2) For every action,there is an equal and opposite     \r\n    critisism.\r\n\r\n3) He who hesitates is probably right.\r\n\r\n4) Eagles may soar,but weasels don't get sucked\r\n    into jet engines.\r\n\r\n5) I went to find some camouflage clothing,but\r\n    I couldn't find it.\r\n\r\n6) My wife went to a self help group for compulsive\r\n    talkers,it's called On & On Anon.\r\n\r\n7) I'm reading a terrific book about anti-gravity,\r\n    I just can't put it down.\r\n\r\n8) I allways wanted to be somebody,I guess I should\r\n    have been more specific...\r\n\r\n9) If you are what you eat,I'm dead meat.\r\n\r\n10) Middle age is having two temptations and\r\n      choosing the one that will get you home earlier.\r\n\r\n11) Seen it all,done it all,just can't remember most \r\n      of it.\r\n\r\n12) Its a cruel choice,work or daytime tellevision.\r\n\r\n13) I intend to live forever -------- so far,so good.\r\n\r\n14) I have seen the truth and it makes no sence.\r\n\r\n15) The best part about computers is that they make\r\n      very fast mistakes.\r\n------------------------------------------------------------", "The following were some comments made in the year 1957: \r\n\r\n(1) \"I'll tell you one thing, if things keep going the way they are, it's going to be impossible to buy a week's groceries for $20.00.\" \r\n\r\n(2) \"Have you seen the new cars coming out next year? It won't be long when $5,000 will only buy a used one.\" \r\n\r\n(3) \"If cigarettes keep going up in price, I'm going to quit. A quarter a pack is ridiculous.\" \r\n\r\n(4) \"Did you hear the post office is thinking about charging a dime just to mail a letter?\" \r\n\r\n(5) \"If they raise the minimum wage to $1, nobody will be able to hire outside help at the store.\" \r\n\r\n(6) \"When I first started driving, who would have thought gas would someday cost 29 cents a gallon. Guess we'd be better off leaving the car in the garage.\" \r\n\r\n(7) \"Kids today are impossible. Those ducktail hair cuts make it impossible to stay groomed. Next thing you know, boys will be wearing their hair as long as the girls'.\" \r\n\r\n(8) \"I'm afraid to send my kids to the movies any more. Ever since they let Clark Gable get by with saying 'damn' in 'Gone With The Wind', it seems every new movie has either 'hell' or 'damn' in it.\" \r\n\r\n(9) \"I read the other day where some scientist thinks it's possible to put a man on the moon by the end of the century. They even have some fellows they call astronauts preparing for it down in Texas.\" \r\n\r\n(10) \"Did you see where some baseball player just signed a contract for $75,000 a year just to play ball? It wouldn't surprise me if someday that they will be making more than the President.\" \r\n\r\n(11) \"I never thought I'd see the day all our kitchen appliances would be electric. They are even making electric typewriters now.\" \r\n\r\n(12) \"It's too bad things are so tough nowadays. I see where a few married women are having to work to make ends meet.\" \r\n\r\n(13) \"It won't be long before young couples are going to have to hire someone to watch their kids so they can both work.\" \r\n\r\n(14) \"No one can afford to be sick any more, $35.00 a day in the hospital is too rich for my blood.\" \r\n\r\n(15) \"I'm just afraid the Volkswagen car is going to open the door to a whole lot of foreign business.\" \r\n\r\n(16) \"Thank goodness I won't live to see the day when the Government takes half our income in taxes. I sometimes wonder if we are electing the best people to Congress.\" \r\n\r\n(17) \"The drive-in restaurant is convenient in nice weather, but I seriously doubt they will ever catch on.\" \r\n\r\n(18) \"I guess taking a vacation is out of the question now days. It costs nearly $15.00 a night to stay in a hotel.\"", "If the cops arrest a mime, do they tell him he has the right to remain silent?", "Always keep your words soft and sweet,\r\njust in case you have to eat them.", "Famous last words:\r\n\r\n\"Ok, I'm only going to have one...\"\r\n\r\n-- Said the polygamist right after marrying his first wife.", "Why can't a gypsy man walk right?\r\n\r\nBecause he has crystal balls!", "It's better to keep your mouth shut and give the impression that you're stupid than to open it and remove all doubt.", "Accept that some days you are the pigeon, and some days you are the statue.", "It may be that your sole purpose in life is simply to serve as a warning to others.", "\"I love you\" is eight letters, but so is \"bull shit.\"", "I decided to kill the sexiest person alive, but then I realized suicide is illegal.", "I often dream of the day when my car will be able to drive me home after a long hard day of work.  That's about the time the driver next to me abruptly blows his horn telling me to wake up and get back into my own lane.", "Q.  How do you keep an idiot busy?\r\n\r\nA.  Tell him that the ground is going to fall on him if he doesn't get off it.", "Did you hear about the cannibal who was late to dinner? \r\nHe got the cold shoulder.", "Known fact amongst all men: Having sex can help combat asthma and hay fever, now we need to inform all women!", "\"No one dies a virgin, life screws us all!\"", "Q:  What do mice say when they see the moon??\r\n\r\nA:  \"Ooh, Cheese!\"", "I never engage in a battle of wits with an unarmed appoint", "When I worked in the tourist industry in Florida, we got to wear some of the buttons that were for sale.  My favorite read :\r\n\r\nWe love serving tourists; I like mine well done!", "To the optimist, the glass is half full.  To the pessimist, the glass is half empty. \r\n\r\nTo the accountant, the glass is twice as big as it needs to be.", "How do we look at a calendar to find what date it is, when we don't know the date?", "How is it we look in a dictionary to figure out how to spell something if we don't know how to spell it?", "A man who digs?\r\nDoug!\r\n\r\nA man who doesn't dig?\r\nDouglas!\r\n\r\nA woman with a cat on her head?\r\nKitty!", "I signed up for an exercise class and was told to wear loose-fitting clothing. If I HAD any loose-fitting clothing, I wouldn't have signed up in the first place!  \r\n\r\nWhen I was young we used to go \"skinny dipping,\" now I just \"chunky dunk.\"  \r\n\r\nWouldn't it be nice if whenever we messed up our life we could simply press 'Ctrl Alt Delete' and start all over?  \r\n\r\nStress is when you wake up screaming and then you realize you haven't fallen asleep yet.  \r\n\r\nMy husband says I never listen to him. At least I think that's what he said.  \r\n\r\nJust remember...if the world didn't ****, we'd all fall off.  \r\n\r\nIf raising children was going to be easy, it never would have started with something called labor!  \r\n\r\nBrain cells come and brain cells go, but fat cells live forever.  \r\n\r\nBut Most Of All, Remember !\r\n\r\nA Friend Is Like A Good Bra. Hard to Find, Supportive, Comfortable, And Always Close To Your Heart!!!!!!!!!", "1.  I used to eat a lot of natural foods until I learned that most people die from natural causes.\r\n\r\n\r\n2.  Health nuts are going to feel stupid someday, lying in hospitals dying of nothing.", "Why did our founding fathers expressed equality, but the constitution says people born in other countries can't be president?", "In the 60's, people took acid to make the world appear weird.  Now the world is weird and people take Prozac to make it normal.", "What do you get when a dinosuar stubs its toe?\r\n\r\nA: Stubasaurus", "The best things in life are free and the worst things in life cost only $19.95.", "Q.  Who likes to make dinner for Peter Pan?\r\n\r\n\r\nA.  Captain Cook!", "Why couldn't the Human Torch get married?\r\n\r\nHe couldn't find his Match!", "What do you call a stupid garbage can?\r\n\r\nA Dumb-ster!", "No, of course it isn't.", "rudeness - someone who keeps talking while your are trying to interrupt.", "From a brunette's point of view:\r\nBlondes may have more fun but hey, at least we can read!", "This is laziness!", "D.A.R.E. sadly doesn't stand for Drugs Are Really Excellent.", "We rated with RSAC i, TM Safe Surf Rated.", "We have all wished for something, but think about this:  Hold out your hands, wish in one, and crap in the other.  Which hand do you think will get filled up first?", "Have you seen the lottery tickets from India?\r\n\r\nIf the spot on your ticket matches the spot on your forehead, you win a 7-11 store.", "The only thing truly free of charge is a dead battery.", "What can a picnic table do that a musician can't do?\r\n\r\nSupport a family of six!", "The Lazy Bowl Reclining toilet: It's plush while you flush!", "Sometimes, I get so sleepy that I fall asleep at my keyboa-----hogasvfbhjhfaokL;'GRUHIKMUIHGDFJSJIKkljhvLD ;YWEHKJF,HCsssljga lrsaio.ra;ugsrol,.k,ijhekng0ljr", "I saw that my low-fuel light was on, so I stopped and got $10 worth of gas. And when I was done, I saw that my low-fuel light was still on. \r\n\r\nQuitters never win, winners never quit. But those who never win and never quit are idiots. \r\n\r\nThere can't be any life on Mars. They haven't asked the United States for any money. \r\n\r\nWhen thieves get caught stealing money, they go to jail. When politicians get caught, it's an honest mistake. \r\n\r\nWhy do men ask for a woman's hand in marriage? Because they are tired of using their own. \r\n\r\nMy greatest fear is there is no such thing as PMS and this is really my wife's personality. \r\n\r\nFederal Express had a terrific obstacle to overcome: They had to convince people that anything with the word \"Federal\" in it could be speedy. \r\n\r\nDr. Ruth says women should tell our lovers how to make love to us. My boyfriend goes nuts if I tell him how to drive. \r\n\r\nAfter divorce, most men realize that poker isn't the only game that starts with holding hands and ends with an astounding financial loss. \r\n\r\nFor two people in a marriage to live together, day after day, is unquestionably the one miracle the Vatican has overlooked.", "Short naps prevent aging, especially if taken while driving.", "When you marry, your spouse's family become \"in-laws.\"  So, when you divorce, does that make them \"outlaws?\"", "If you love someone, set them free. If they come back, set them on fire.", "The landlady asked me if I minded making my own bed. I said I didn't and she said great there's a hammer and nails in the corner.", "Why did the penny jump off the cliff and not the quarter?\r\n\r\n\r\nBecause the quarter had more cents!", "Is that a mirror in your jeans? Because I can see myself in them.", "Q. What goes clop... clop... clop... BANG! clop clop clop clop clop clop?\r\n\r\n\r\n\r\n\r\nA. An Amish driveby", "This joke's so old, it has mold on it!  HA HA HA!", "War not determine who right, war determine who left.", "Found on Roadside Dead\r\n\r\nFucked Over Re-built Dodge", "Normal people believe that \"If it ain't broke, don't fix it.\" Engineers believe that \"If it ain't broke, it doesn't have enough features yet\"", "Signs in our world...\r\n\r\nPlease be safe.  Do not stand, sit, climb or lean on zoo fences.  If you fall, animals could eat you and that might make them sick.  Thank you.\r\n\r\nOUR AIM IS TO KEEP THIS BATHROOM CLEAN.\r\nGENTLEMEN:  Your aim will help.  Stand closer.  It's shorter than you think.\r\nLADIES:  Please remain seated for the entire performance.\r\n\r\nCAUTION: This machine has no brain.  Use your own.\r\n\r\nSt. Cyril of Alexandria Catholic Church\r\nStaying in bed shouting, Oh, God! does not constitute going to church.  Diocese of Galveston-Houston.\r\n\r\nStiff Nipples Air Conditioning Service. 020 8797 2690\r\n\r\nNote to NiteLink Passengers.  Ladies, the poles are fitted for your safety.  No dancing.\r\n\r\nAttention Dog Guardians:  Pick up after your dogs.  Thank you.\r\nAttention Dogs:  Grrrr, bark, woof.  Good dog.\r\n\r\nMr. Toskana has had an expensive divorce and now needs the money, so SALE NOW ON!!\r\n\r\nPLEASE Don't throw your cigarette butts on the floor.  The cockroaches are getting cancer.", "Old photographers never die, they just go out of focus!", "What's the best way to talk to a shark?\r\n\r\nLong distance!", "Why did the poor dog chase his tail?\r\n\r\nHe was trying to make ends meet!", "A good time to keep your mouth shut is when you're in deep water.\r\n\r\nAnyone who thinks old age is golden must not have had a very exciting youth.\r\n\r\nHow come it takes so little time for a child who is afraid of the dark to become a teenager who wants to stay out all night?\r\n\r\nBusiness conventions are important because they demonstrate how many people a company can operate without.\r\n\r\nWhy is it that at class reunions you feel younger than everyone else looks?\r\n\r\nScratch a dog and you'll find a permanent job.\r\n\r\nNo one has more driving ambition than the boy who wants to buy a car.\r\n\r\nThere are no new sins...the old ones just get more publicity.\r\n\r\nThere are worse things than getting a call for a wrong number at 4 am. It could be a right number.\r\n\r\nThink about this...No one ever says \"It's only a game\" when their team is winning.\r\n\r\nHow come we choose from just two people for president and 50 for Miss America?\r\n\r\nMoney will buy a fine dog, but only kindness will make him wag his tail.\r\n\r\nLearn from the mistakes of others. You won't live long enough to make them all yourself.\r\n\r\nOne of the quickest ways for a young man to fail in life is to work so hard the boss will think he's after his job.\r\n\r\nA backyard barbecue draws two things...flies and relatives.\r\n\r\nThe nicest thing about the future is that it always starts tomorrow.\r\n\r\nIf you don't have a sense of humor, you probably don't have any sense at all.\r\n\r\nSeat belts are not as confining as wheelchairs.\r\n\r\nYou know you're old when you reach down to get the wrinkles out of your panty hose and realize you aren't wearing any.\r\n\r\nI've reached the age where the happy hour is a nap.", "1. You spend the first two years of their life teaching them to walk and talk. Then you spend the next sixteen telling them to sit down and shut up.\r\n\r\n2. Grandchildren are God's reward for not killing your own children.\r\n\r\n3. Mothers of teens now know why some animals eat their young.\r\n\r\n4. Children seldom misquote you. In fact, they usually repeat word for word what you shouldn't have said.\r\n\r\n5. The main purpose of holding children's parties is to remind yourself that there are children more awful than your own.\r\n\r\n6. We childproofed our homes but they are still getting in.\r\n\r\nADVICE FOR THE DAY: Be nice to your kids. They will choose your nursing home one day.\r\n\r\nAND FINALLY:\r\n\r\nIF YOU HAVE A LOT OF TENSION AND YOU GET A HEADACHE, DO WHAT IT SAYS ON THE ASPIRIN BOTTLE:\r\n\r\n\"TAKE TWO ASPIRIN\" AND \"KEEP AWAY FROM CHILDREN\"!!!!!", "\"AIM TOWARDS THE ENEMY.\" -Instruction printed on US Rocket Launcher\r\n\r\n\"WHEN THE PIN IS PULLED, MR. GRENADE IS NOT OUR FRIEND.\" -US Marine Corps\r\n\r\n\"CLUSTER BOMBING FROM B-52s IS VERY, VERY ACCURATE. THE BOMBS ARE GUARANTEED TO ALWAYS HIT THE GROUND.\" \r\n-U.S.A.F. Ammo Troop.\r\n\r\n\"IF THE ENEMY IS IN RANGE, SO ARE YOU.\" -Infantry Journal\r\n\r\n\"A SLIPPING GEAR COULD LET YOUR M203 GRENADE LAUNCHER FIRE WHEN YOU LEAST EXPECT IT. THAT WOULD MAKE YOU QUITE UNPOPULAR IN WHAT'S LEFT OF YOUR UNIT.\" -Army's magazine of preventative maintenance\r\n\r\n\"IT IS GENERALLY INADVISABLE TO EJECT DIRECTLY OVER THE AREA YOU JUST BOMBED.\" -US. Air Force manual\r\n\r\n\"TRY TO LOOK UNIMPORTANT; THE ENEMY MAY BE LOW ON AMMO.\" \r\n-Infantry Journal\r\n\r\n\"TRACERS WORK BOTH WAYS.\" -U.S. Army Ordnance\r\n\r\n\"FIVE-SECOND FUSES ONLY LAST THREE SECONDS ! \"-Infantry Journal \r\n\r\n\"BRAVERY IS BEING THE ONLY ONE WHO KNOWS YOU'RE AFRAID.\" \r\n-David Hackworth\r\n\r\n\"IF YOUR ATTACK IS GOING TOO WELL, YOU'RE WALKING INTO AMBUSH.\" \r\n-Infantry Journal\r\n\r\n\"NO COMBAT-READY UNIT HAS EVER PASSED INSPECTION.\" -Joe Gay\r\n\r\n\"ANY SHIP CAN BE A MINESWEEPER. . .ONCE.\" -Anon \r\n\r\n\"NEVER TELL THE PLATOON SERGEANT YOU HAVE NOTHING TO DO.\" \r\n-Unknown Marine Recruit\r\n\r\n\"DON'T DRAW FIRE; IT IRRITATES THE PEOPLE AROUND YOU.\" -Infantry Journal\r\n\r\n\"IF YOU SEE A BOMB TECHNICIAN RUNNING, TRY TO KEEP UP WITH HIM.\" \r\n-U.S.A.F. Ammo Troop", "Why do people say \"This is the first day of the rest of your life\"? Isn't that true about everyday unless you die that day?", "My Kid Got Your Honor Roll Student Pregnant. \r\n\r\nCleverly Disguised As A Responsible Adult \r\n\r\nThe Face Is Familiar, But I Can't Quite Remember My Name \r\n\r\nI Do Whatever My Rice Krispies Tell Me To \r\n\r\nFight Crime: Shoot Back! \r\n\r\nCaution -- Driver Legally Blonde! \r\n\r\nIf You Drink Don't Park. Accidents Cause People. \r\n\r\nIf You're Not A Hemorrhoid, Get Off My Ass. \r\n\r\nYou're Just Jealous Because The Voices Are Talking To Me", "If we quit voting, will they all go away? \r\n\r\nIt's been lovely but I have to scream now \r\n\r\nI haven't lost my mind -- it's backed up on disk somewhere \r\n\r\nBoldly going nowhere \r\n\r\nDon't be sexist -- broads hate that \r\n\r\nOld lawyers never die, they just lose their appeal. \r\n\r\nHow could two people as beautiful as you have such an ugly baby?", "I've always wanted to have someone to hold, someone to love. After having met you, I've changed my mind. \r\n\r\nI must admit, you brought Religion in my life. I never believed in Hell til I met you. \r\n\r\nLooking back over the years that we've been together, I can't help but wonder: What the hell was I thinking? \r\n\r\nAs the days go by, I think of how lucky I am that you're not here to ruin it for me. \r\n\r\nAs you grow older, Mom, I think of all the gifts you've given me. Like the need for therapy...", "Thanks for being a part of my life!!! I never knew what evil was before this! \r\n\r\nCongratulations on your promotion. Before you go, I would like to take this knife out of my back. You'll probably need it again. \r\n\r\nSomeday I hope to get married, but not to you. \r\n\r\nSorry things didn't work out, but I can't handle guys with boobs that are bigger than mine. \r\n\r\nHappy Birthday! You look great for your age...Almost Lifelike!", "If a turtle loses its shell is it naked or homeless? \r\n\r\nIf fire fighters fight fires and crime fighters fight crime, what do freedom fighters fight???\r\n \r\nIf nothing sticks to teflon, then how do they make teflon stick to the pan?\r\n\r\nWhy do Kamikaze pilots wear seatbelts?\r\n\r\nIf love is blind, then why is lingere so popular? \r\n\r\nWhy is the alphabet in that order? Is it because of that song? \r\n\r\nIf a black box flight recorder is never damaged in a plane crash, why dont they make the whole plane out of that stuff? \r\n\r\nWhy is there an expiration date on sour cream? \r\n\r\nIf most car accidents occur within 5 kilometers of home, then why doesnt every one just move 5 k's away? \r\n\r\nWhy are psychics still working if they all know the winning lottery numbers? \r\n\r\nIf you try to fail, but you succeed, which have you done?", "What you call a man with no arms and no legs at a work-out place?\r\n\r\nJim\r\n\r\nWhat you call a man with no arms and no legs at your door?\r\n\r\nMatt\r\n\r\nWhat you call a man with no arms and no legs in your bathroom?\r\n\r\nJohn\r\n\r\nWhat you call a man with no arms and no legs in a trench?\r\n\r\nPhil\r\n\r\nWhat you call a man with no arms and no legs in a pit?\r\n\r\nDoug\r\n\r\nWhat you call a man with no arms and no legs with a cat?\r\n\r\nTom\r\n\r\nWhat you call a girl with one leg?\r\n\r\nIlene\r\n\r\nWhat you call a Japanese girl with one leg?\r\n\r\nIrene\r\n\r\nWhat do you call a pig with no legs?\r\n\r\nGroundhog", "Something Went Wrong in Jet Crash, Expert Says\r\n\r\nIs There a Ring of Debris around Uranus?\r\n\r\nProstitutes Appeal to Pope\r\n\r\nPanda Mating Fails; Veterinarian Takes Over\r\n\r\nLung Cancer in Women Mushrooms\r\n\r\nEnraged Cow Injures Farmer with Ax\r\n\r\nMiners Refuse to Work after Death\r\n\r\nJuvenile Court to Try Shooting Defendant\r\n\r\nStolen Painting Found by Tree\r\n\r\nTwo Sisters Reunited after 18 Years in Checkout Counter\r\n\r\nKiller Sentenced to Die for Second Time in 10 Years", "Never Withhold Herpes Infection from Loved One\r\n\r\nWar Dims Hope for Peace\r\n\r\nCold Wave Linked to Temperatures\r\n\r\nEnfields Couple Slain; Police Suspect Homicide\r\n\r\nRed Tape Holds Up New Bridge\r\n\r\nDeer Kill 17,000\r\n\r\nTyphoon Rips Through Cemetery; Hundreds Dead\r\n\r\nMan Struck by Lightning Faces Battery Charge\r\n\r\nNew Study of Obesity Looks for Larger Test Group\r\n\r\nAstronaut Takes Blame for Gas in Spacecraft\r\n\r\nKids Make Nutritious Snacks", "British Union Finds Dwarfs in Short Supply\r\n\r\nLansing Residents Can Drop Off Trees\r\n\r\nLocal High School Dropouts Cut in Half\r\n\r\nNew Vaccine May Contain Rabies\r\n\r\nMan Minus Ear Waives Hearing\r\n\r\nDeaf College Opens Doors to Hearing\r\n\r\nAir Head Fired\r\n\r\nOld School Pillars are Replaced by Alumni\r\n\r\nBank Drive-in Window Blocked by Board\r\n\r\nHospitals are Sued by 7 Foot Doctors\r\n\r\nSome Pieces of Rock Hudson Sold at Auction\r\n\r\nSex Education Delayed, Teachers Request Training\r\n\r\nInclude your Children when Baking Cookies", "Why are there flotation devices under plane seats instead of parachutes?\r\n\r\nWhy are cigarettes sold in gas stations when smoking is prohibited there?\r\n\r\nDo you need a silencer if you are going to shoot a mime?\r\n\r\nIf you tied buttered toast to the back of a cat and dropped it from a height, what would happen?\r\n\r\nYou know how most packages say \"Open here\". What is the protocol if the package says, \"Open somewhere else\"?\r\n\r\nWhy do they put Braille dots on the keypad of the drive-up ATM?", "WANTED: Meaningful overnight relationship. \r\n\r\nBEER: It's not just for breakfast anymore. \r\n\r\nSo you're a feminist...Isn't that cute. \r\n\r\nBeauty is in the eye of the beer holder. \r\n\r\nAll men are idiots....I married their king. \r\n\r\nIRS: We've got what it takes to take what you've got. \r\n\r\nHard work has a future payoff. Laziness pays off now. \r\n\r\nReality is a crutch for people who can't handle drugs. \r\n\r\nOut of my mind...Back in five minutes. \r\n\r\nI took an IQ test and the results were negative.", "1. The only things more accurate than enemy fire is friendly fire.\r\n2. Teamwork is essential. It gives them more targets to shoot at.\r\n3. No inspection-ready unit ever passed combat.\r\n4. No combat-ready unit ever passed inspection.\r\n5. Remember: your aircraft was made by the lowest bidder.\r\n6. Never share a cockpit with someone braver than you.\r\n7. You are not Tom Cruise.\r\n8. SAMs and AAA have the right-of-way.\r\n9. If you aren't sure, the SAMs are pointed at you.\r\n10. If hit, landing near the people that just shot you down is not a good idea.\r\n11. Close only counts in horseshoes, nukes and proximity-fused missiles.\r\n12. Smart bombs have bad days too.\r\n13. The best defense is to stay out of range.\r\n14. If you are short on everything but enemy, you are in combat.", "My computer is so old, it has a VHS slot instead of a CD/DVD slot!!!", "How can you tell the difference between a violin and a fiddle?\r\n\r\nLook at the audience!", "I like hippos 'cause they're fat and don't care what other hippos think.", "Did you here about the giant with a nosebleed? It was all over town", "Why does a cock always close his eyes when he's crowing?\r\n\r\n\r\nBecause he already knows the text!!", "Question:\r\n\r\n   How long is a minute?\r\n\r\n\r\n\r\n\r\nAnswer:\r\n\r\n   That depends on which side of the                        bathroom door you are on!!", "Boy: Is your dad a baker?\r\n\r\nGirl: No. Why?\r\n\r\nBoy: Cause you're a cutie pie!!", "Q: Where do nudists go fishing?\r\nA: Moon River.\r\n\r\nQ: What do you call a singing hot dog in New York, New York?\r\nA: Frank Sinatra.\r\n\r\nQ: What do you call a really smart cow?\r\nA: Grade A beef.\r\n\r\nQ: What song do they play at plumbers' funerals?\r\nA: Taps.\r\n\r\nQ: Where do you take a sick potato?\r\nA: To a M.A.S.H. unit.", "Is your dad a baker? Because those buns are lookin' good!\r\n\r\nI lost my phone number, can I have yours?", "Here are two pick up lines:\r\n\r\n\"Are you a Abercrombie model? Your not?!?!? You so should be!!\"\r\n\r\n\r\nor\r\n\r\n\r\n\"My friend (insert friend name here) thinks we should go out. Wanna?\"", "Why do they lock gas station bathrooms? Are they afraid someone will clean them? \r\n\r\nWhy do people who know the least know it the loudest? \r\n\r\nIf the funeral procession is at night, do folks drive with their headlights off? \r\n\r\nIf a stealth bomber crashes in a forest, will it make a sound?  \r\n\r\nWhen it rains, why don't sheep shrink? \r\n\r\nShould vegetarians eat animal crackers? \r\n\r\nWhen companies ship Styrofoam, what do they pack it in? \r\n\r\nIf you're cross-eyed and have dyslexia, can you read all right?", "One time, my teacher said to dump our Math books. Then she said to get your Social Studies book. Then that became history.", "I'm so old, I woke up the other morning and thought I had an erection. I was really happy until I realized it was just a leg cramp!", "Only in America can a poor black boy turn into a rich white woman...   (Michael Jackson)", "Only in America can a President have relations in the oral office", "Q - What do barbed wire and a thong have in common?\r\nA - Both protect the property, but neither obstruct the view.", "Mary had a little lamb!\r\nThe doctor fainted!", "Like I said before, I never repeat myself.", "Why is marriage so much like a tornado?\r\n\r\nAt first there is a lot of huffing and blowing, in the end someone loses their house.", "If a guy is a \"chick magnet\", and opposites attract, doesn't that make him gay?", "10) Hum or sing when ever possible.\r\n\r\n9) Always chew with your mouth open.\r\n\r\n8) Pretend to fly around the room.\r\n\r\n7) Have fights with your imaginary friends.\r\n\r\n6) At school, fall asleep in every class.\r\n\r\n5) When people turn around, make faces.\r\n\r\n4) Scream every 10 minutes.\r\n\r\n3) Tell every one you have a twin and then pretend to be the twin. \r\n\r\n2) Say, 'I don't know.' when you are asked a question, no matter what the question is.\r\n\r\n1) Tap your pencil on every surface.", "What does a horny ghost say to scare people?\r\n\r\n\r\nBOO...BS!", "What's the difference between a wife and a prostitute?\r\n\r\nProstitute is cheaper!", "I am sure everyone has heard the saying \"If it ain't broke, don't fix it.\"\r\n\r\nWell, I have improved on this saying so that it applies to my life, and here it is.\r\n\r\n\"If it ain't broke, it ain't ours!\"", "This was a Typo from Jack-in-the-Box\r\n\r\n1. Come in for our new Chihuahua (Chibatta, Don't ask.)Sandwich.\r\n\r\n2. Newspaper\r\nLook ravished (ravishing) for your big day.\r\n\r\n3. Church Newsletter\r\nCome tonight to see famous missionary Bobby Belch. Come hear Bobby Belch from Africa.\r\n\r\n4. Sunday School Lesson: Jesus Walks on Water\r\nTonight's Lesson: Finding Jesus\r\n\r\n5. Tonight's Sermon: \"What is Hell?\" Come early to listen to our choir perform.", "1. A spoon full of sugar helps the medicine go down, unless you're a diabetic!!!!!\r\n\r\n2. People who live in glass houses should have sex in their basements!!!", "'How long will the next bus be?'\r\n'About eighteen feet.'", "What do you call a a bunch of fish swimming in the sky??\r\n\r\nA High School!!!", "Why should you have only one egg for breakfast? Because un oeuf is enough!", "I don't believe in reincarnation, which is strange, because in a previous existence, I did.", "Man who stands on toilet is high on pot.\r\n\r\nMan with face in toilet is shit faced.\r\n\r\nMan who fools around with neighbour's wife at wrong time of month get caught red handed.\r\n\r\nMan who fart in church sit in own pew.", "How do you kill a circus? Go for the juggler!", "Q: What's a pick up line in a gay bar??\r\n\r\nA: Would you like me to push your stool in?", "My home town is so small, we have part-time village idiot.", "Auntie Em, hate you, hate Kansas, taking the dog. Dorothy.", "In a recent survey, 4% of men preferred fat legs; 6% preferred skinny legs; while 90% preferred something in between.", "How can you tell if a mathematician is an extrovert?\r\n\r\nHe looks at *your* shoes when he talks to you.", "What do you call a one-eyed dinosaur?\r\n\r\nDyouthinkhesaurus", "I lent a friend of mine $5000 for plastic surgery.\r\nI can't get it back, because now I DON'T KNOW WHAT HE LOOKS LIKE!", "Money can't buy everything... but then again, neither can no money.", "Legs is the word - spread the word.", "When does Saddam Hussein have his lunch?\r\n\r\nWhen Tariq Aziz.\r\n\r\n(When Tariq has his)", "Betcha I can give up gambling!", "What's the difference between a leg and an egg?\r\n\r\nYou can beat an egg up, but you can't beat a leg up!", "Two eggs were in a pan of boiling water.\r\n\r\nOne egg says, \"Phew, it's hot in here!\"\r\n\r\nThe other egg replies, \"Wait till we get out of here, they smash your head in!\"", "Two cows eating grass,\r\nOn a warm, sunny hillock.\r\nBy this time tomorrow,\r\nThat grass will be millock.", "Never buy a toothbrush at a yard sale.\r\n\r\nNever buy a parachute that was used once and never opened before.\r\n\r\nNever sell computers for free at your garage sale. Trust me, there are many more ways to demolish your house.\r\n\r\nNever put bathroom humor up on the internet.\r\n\r\nNever watch American Idol auditions with Coke in your mouth.\r\n\r\nNever watch American Idol auditions without a couple of aspirins.\r\n\r\nAnd never, ever catch your grandparents taking a shower.\r\n\r\nAll of these words of advice were found out by first-hand experience.If you want to meet the guy brave enough to try all of these \"stunts\" out, go to the Almont Graveyard in Stamfort, Michigan and visit the grave entitled:\"Dave 'Daredevil' Deatson\". Or visit his grandparents in jail on Alcatraz Prison, California.", "A woman walked into a bar, and asked the barman for a double entendre, so he gave her one.", "\"Doctor, please, I have a problem pronouncing Ts, Fs and Hs!\"\r\n\r\n\"Well then, you can't say fairer than that.\"", "Why do birds fly south for the winter? Because it's too far to walk.\r\n\r\nWhat do you call a bright, sunny day that comes after two cold, cloudy days? Monday.\r\n\r\nA snake slithers into a bar. The barman says, \"I can't serve you, you obviously can't hold your drink.\"\r\n\r\nWhich side of a chicken has the most feathers? The outside.\r\n\r\nTwo parrots on a perch. One says, \"Do you smell fish?\"\r\n\r\nAn eel slithers into a bar. The barman says, \"I can't serve you, you're legless.\"", "A calendar â\u0080\u0093 something that goes in one year and out the other.", "I bought a book called \"How to Hug,\" and when I got it home, found it was volume 7 of an encyclopedia.\r\n\r\nI phoned the gym, and asked if they could teach me to do the splits. The girl asked if I was flexible, and I said I couldn't do Tuesdays.", "1. On a mall child's cart bag\r\n   Do not put child in bag (Who does?)\r\n\r\n2. On food court restaurant counters\r\n   Warning: Touching hot surfaces may burn you (Wanna try?)\r\n\r\n3a. Bush on war in Iraq\r\n    \"We're not going to have any casualties.\" (Where are we now, huh?)\r\n\r\n3b. Bush's description of the White House\r\n    \"It is white.\" (WOW! Who knew???)\r\n\r\n3c. Our future\r\n    \"The future will look better tommorow.\" (That settles it, we're all gonna die.)", "Why do cows wear bells?\r\nBecause their horns don't work.\r\n\r\nWhy is a river rich?\r\nBecause it has two banks.\r\n\r\nWhat is a foreign ant called?\r\nImport-ant.\r\n\r\nWhat do ants take when they are ill?\r\nAnti-biotics.", "What is the fastest way to double your money?\r\n\r\n\r\n\r\nBy folding it in half", "What did one glass say to another glass?\r\nLets have a break.\r\n\r\nWhat did one ghost say to another ghost?\r\nDo you believe in people?\r\n\r\nWhat did one chair say to another chair?\r\nHere comes another bum.", "Confucius say: Sperm sample from Nobel Prize winner is stroke of genius.", "Confucius Say: Crowd in elevator smell different to midget.", "Confucius say: Man who walk through airport turnstile sideways, going to Bangkok", "She used to have a broad mind and a narrow waist; now it's the other way round.\r\n\r\nIt was a very emotional wedding; even the cake was in tiers.\r\n\r\nPsychic wanted â\u0080\u0093 you know why, and where to apply.\r\n\r\nI don't think they really wanted me in the marching band â\u0080\u0093 they gave me a piano.\r\n\r\nThen, when we played hide and seek, no-one came to look for me.", "The gangster's last words â\u0080\u0093 \"Who put that violin in my violin case?\"", "What do you give the person who has everything?\r\n\r\nA box to keep it all in.", "I almost had a psychic girlfriend, but she left me before we met.", "Did you know that 61.8 percent of all statistics are made up on the spot?", "Abortion - Near Life Experience\r\nBald - Follically liberated\r\nBlind - Photonically non-receptive\r\nBum - Displaced homeowner\r\nCannibalism - Intra-Species dining\r\nCensorship - Selective speech\r\nCheating (Marriage) - Post-Marital Affairs\r\nCheating (School) - Academic Dishonesty\r\nClumsy - Uniquely coordinated\r\nCorpse - Permanently static post-human mass\r\nCowboys - Bovine control officers\r\nCrime Rate - Street activity index\r\nDead - Living impaired\r\nDeaf - Visually oriented\r\nDelicatessen - Corpse Farm\r\nDish Washer - Utensil Sanitizer\r\nFat - Person of substance\r\nGas Station Attendant - Petroleum Transfer Technician\r\nHunter - Meat Mercenary\r\nIdiot - Factually Unencumbered\r\nInsane Person - Selectively Perceptive\r\nMidget - Vertically Challenged", "My dad has always told me that putting in a little effort and dedication on the job never hurt anyone. Then again, he never heard of worker's comp.", "Sometimes I think I'm stupid... until I met George W. Bush. Now I feel like the smartest man in the world.", "What's pink and fluffy? Pink fluff!", "You know you're screwed when you fall in love with a woman you see at the mall, then realize that she is your sister.", "INFLATION: Cutting money in half without damaging the paper. \r\n\r\nMYTH: A female moth. \r\n\r\nMOSQUITO: An insect that makes you like flies better. \r\n\r\nRAISIN: Grape with a sunburn. \r\n\r\nSECRET: Something you tell to one person at a time. \r\n\r\nSKELETON: A bunch of bones with the person scraped off. \r\n\r\nTOOTHACHE: The pain that drives you to extraction. \r\n\r\nTOMORROW: One of the greatest labor saving devices of today. \r\n\r\nYAWN: An honest opinion openly expressed. \r\n\r\nWRINKLES: Something other people have. You have character lines.", "- \"I am\" is reportedly the shortest sentence in the English language. Could it be that \"I do\" is the longest sentence? \r\n\r\n- If lawyers are disbarred and clergymen defrocked, doesn't it follow that electricians can be delighted, musicians denoted, cowboys deranged, models deposed, and drycleaners depressed? \r\n\r\n- Do Roman paramedics refer to IV's as \"4's\"? \r\n\r\n- Why is it that if someone tells you that there are one billion stars in the universe you will believe them, but if they tell you a wall has wet paint you will have to touch it to be sure? \r\n\r\n- If you take an Oriental person and spin him around several times, does he become disoriented? \r\n\r\n- If people from Poland are called \"Poles,\" why aren't people from Holland called \"Holes?\" \r\n\r\n- Last night I played a blank tape at full blast. The mime next door went nuts. \r\n\r\n- If a person with multiple personalities threatens suicide, is that considered a hostage situation? \r\n\r\n- Just think how much deeper the ocean would be if sponges didn't live there. \r\n\r\n- If a cow laughed, would milk come out her nose?", "...you prefer cheap rum instead of expensive wine. \r\n\r\n...you think that the proper way to greet kings at events is: \"Arrh, ye peacock, give me yer money or I ll burn yer tent!\" \r\n\r\n...you're planning to purchase a large cannon with the explanation: \"Who knows? Maybe some day we go to camping.\" \r\n\r\n...you get thrown out of meetings cause you know too much about \"slithering throats, ARRH!\". \r\n\r\n...the people at work starts to talk about you as the guy who puts jolly rogers on everything. \r\n\r\n...people stand WAAY back when your household starts to pull out rapiers, sabres, cutlasses and daggers. \r\n\r\n...you get really angry when the person next to you at the bancuette, who claims to be a pirate, doesnt know anything about \"loading guns with rusty nails\" and you challenge him to a cutlass duel, he turns up and then runs away cause you brought your real cutlass. \r\n\r\n...your topic for the evening is smuggling, and your fellows listen politely until you mention \"fast motor boats\" and starts complaining about how the price on silk has gone down.", "Looking for just the right employees? Try this simple personnel test. Take the job applicants and put them in a room with only a table and two chairs. Leave them alone for two hours, without any instruction. At the end of that time, go back and see what they are doing. \r\n\r\n- If they have taken the table apart, put them in engineering. \r\n- If they are counting the cigarette butts in the ashtray, assign them to finance.\r\n- If they are waving their arms and talking aloud, send them to consulting. \r\n- If they are talking to the chairs, personnel is a good spot for them. \r\n- If they are wearing green sunglasses and need a haircut, computer information systems is their niche. \r\n- If the room has a sweaty odor, perhaps they're destined for the help desk. \r\n- If they mention the good price for the table and chairs, put them in purchasing. \r\n- If they mention that hardwood furniture does not come from rain forests, public relations would suit them well. \r\n- If they are sleeping, they are management material. \r\n- If they are writing up the experience, send them to the technical writing team. \r\n- If they don't even look up when you enter the room, assign them to security. \r\n- If they try to tell you it's not as bad as it looks, send them to marketing.", "What is a pirate's favourite branch of the military? \r\n\r\nThe Arrrmy... no, the Navy, he's a pirate!", "\"Waiter, I'd a cup of coffee, please, no cream.\"\r\n\"I'm sorry, sir, we're out of cream. Would you have it with no milk?\"\r\n\r\n\"Waiter, this coffee tastes like mud!\"\r\n\"Well, it was ground this morning!\"\r\n\r\n\"Tea or coffee, gentlemen?\" asked the waiter.\r\n\"I'll have tea,\" replied the first customer.\r\n\"Me too â\u0080\u0093 and be sure the cup is clean!\"\r\nSoon, the waiter returns with two cups of tea.\r\n\"Two teas,\" he says. \"And which of you gentleman asked for a clean cup?\"", "Do Roman paramedics refer to an IV as a four?", "Why has Edward Woodward got 4 d's in his name?\r\n\r\nIf he hadn't he would be Ewar Woowar!", "What's red and invisible?\r\n\r\n\r\nNo tomato.", "Registered users win points for submitting and voting on jokes.", "We are rated with RSAC i, SafeSurf TM Rated.", "Your joke was submitted.", "A friend in need . . .\r\n\r\n. . .is a damn nuisance.", "My teacher always used to tell me that double negatives are a real no-no.", "An active message board with hundreds of topics in which to participate.", "Send private messages to your friends.", "First click the Community button.\r\nThen click the Public Fourum button.\r\nThe first forum is for writing jokes.  \r\nDiscuss how to write funny jokes here.", "Have a funny story? Share it here.", "Play or chat about games in here.", "Talk about anything you want here.\r\n\r\nO.K. I will. You really need to quit submitting jokes like this. Anybody agree with me?", "TV, Movies, Music, Books...", "Please do not submit jokes that are copyrighted by someone else. Or ask for permission from the author before you use copyrighted jokes.", "Why do they call it \"drug abuse\" when the person \"abusing the drugs\" then ends up with half of his brain being rendered useless?", "Right now I'm having amnesia and deja vu at the same time. I think I've forgotten this before.\r\n\r\nI got a new shadow. I had to get rid of the other one . . . It wasn't doing what I was doing.\r\n\r\nI was in the grocery store. I saw a sign that said, \"pet supplies.\" So I did.\r\n\r\nOne time I went to a drive-in in a taxi cab. The movie cost me $95.\r\n\r\nI went to the hardware store and bought some used paint. It was in the shape of a house. I also bought some batteries, but they weren't included, so I had to buy them again.\r\n\r\nI'm writing an unauthorized autobiography.\r\n\r\nI was once arrested for walking in someone else's sleep.\r\n\r\nMy roommate got a pet elephant. Then it got lost. It's in the apartment somewhere.", "Curiosity killed the cat, but for a while I was a suspect.\r\n\r\nIf toast always lands butter-side down, and cats always land on their feet, what happen if you strap toast on the back of a cat and drop it?\r\n\r\nLast year I went fishing with Salvador Dali. He was using a dotted line. He caught every other fish.\r\n\r\nThere's a fine line between fishing and standing on the shore looking like an idiot.\r\n\r\nI didn't get a toy train like the other kids. I got a toy subway instead. You couldn't see anything, but every now and then you'd hear this rumbling noise go by.\r\n\r\nI used to own an ant farm but had to give it up. I couldn't find tractors small enough to fit it.\r\n\r\nI saw a man with a wooden leg, and a real foot.\r\n\r\nI saw a subliminal advertising executive, but only for a second.", "I used to be a bartender at the Betty Ford Clinic.\r\n\r\nI bought a house, on a one-way dead-end road. I don't know how I got there.\r\n\r\nI hooked up my accelerator pedal in my car to my brake lights. I hit the gas, people behind me stop, and I'm gone.\r\n\r\nI replaced the headlights in my car with strobe lights, so it looks like I'm the only one moving.\r\n\r\nI watched the Indy 500, and I was thinking that if they left earlier they wouldn't have to go so fast.\r\n\r\nI had to stop driving my car for a while... The tires got dizzy.\r\n\r\nMy neighbour has a circular driveway... He can't get out.\r\n\r\nI used to work in a fire hydrant factory. You couldn't park anywhere near the place.", "When I fly, I go Air Bizarre. It's a good airline. You buy a one-way round trip ticket. You leave any Monday and they bring you back the previous Friday... That way you still have the weekend.\r\n\r\nIf you saw a heat wave, would you wave back?\r\n\r\nI broke a mirror and got seven years bad luck, but my lawyer thinks he can get me five.\r\n\r\nIf the pen is mightier than the sword, in a duel I'll let you have the pen!\r\n\r\nI was cleaning out my closet and I found a swim suit that I had made out of sponges. I remember one time when I wore it. When I got out of the swimming pool nobody could go swimming until I came back.\r\n\r\nThe other day, when I was walking through the woods, I saw a rabbit standing in front of a candle making shadows of people on a tree.\r\n\r\nIt doesn't matter what temperature the room is; it's always room temperature.\r\n\r\nI have a very rare photograph. It shows Houdini locking his keys in his car.", "I went to the eye doctor and found out I needed glasses for reading. So, I got some flip-up contact lenses.\r\n\r\nWinny would spend all of his time practicing limbo. He got pretty good. He could go under a rug.\r\n\r\nI was walking down the street and saw a sign on a post. It said: \"Lost - $50. If found, just keep it.\"\r\n\r\nI bought a cheap piece of land... It was on someone else's property.\r\n\r\nThe brain is a wonderful organ; it starts working the moment you get up in the morning and doesn't stop until you get to work.\r\n\r\nThe sun got confused about daylight savings time. It rose twice. Everything had two shadows.\r\n\r\nSome people think George is weird, because he has sideburns behind his ears. I think George is weird, because he has false teeth. With braces on them. George is a radio announcer, and when he walks under a bridge... You can't hear him talk.\r\n\r\nI was watching the Superbowl with my 92 year old grandfather. The team scored a touchdown. They showed the instant replay. He thought they scored another one. I was gonna tell him, but I figured the game *he* was watching was better.", "I had some eyeglasses. I was walking down the street when suddenly the prescription ran out.\r\n\r\nI installed a skylight in my apartment.... The people who live above me are furious!\r\n\r\nAll of the people in my building are insane. The guy above me designs synthetic hairballs for ceramic cats. The lady across the hall tried to rob a department store... With a pricing gun... She said, \"Give me all of the money in the vault, or I'm marking down everything in the store.\"\r\n\r\nIn my house there's this light switch that doesn't do anything. Every so often I would flick it on and off just to check. Yesterday, I got a call from a woman in Germany. She said, \"Cut it out.\"\r\n\r\nAll the plants in my house are dead - I shot them last night. I was torturing them by watering them with ice cubes.\r\n\r\nI put my air conditioner in backwards. It got cold outside. The weatherman on TV was confused. \"It was supposed to be hot today.\"\r\n\r\nI was in the first submarine. Instead of a periscope, they had a kaleidoscope. \"We're surrounded.\"\r\n\r\nI put tape on the mirrors in my house so I don't accidentally walk through into another dimension.", "Have you ever heard of the Gay Mafia? No?\r\n\r\nIf you don't pay up, they come round your house, and criticize your curtains!", "Have you noticed since most people have a camcorder these days there are not as many people talking about seeing UFOs as there use to be?", "For a REAL sponge cake, BORROW all the ingredients.\r\n\r\nDiplomacy - the art of letting someone have your way.\r\n\r\nA seminar on time travel will be held two weeks ago.\r\n\r\nGive and you might receive; take and be sure.\r\n\r\nI can't remember the last time I forgot something.\r\n\r\nI'm not schizophrenic, and neither am I.\r\n\r\nIn an atomic attack, all men will be cremated equal.\r\n\r\nIt's bad luck to be superstitious.\r\n\r\nI've been meaning to start procrastinating for some time now.\r\n\r\nLogic â\u0080\u0093 the art of being wrong, with confidence.\r\n\r\nOld age isn't so bad, when you consider the alternative.\r\n\r\nShin â\u0080\u0093 a device for finding furniture in the dark.\r\n\r\n\"Very funny, Scotty, now beam down my clothes.\"\r\n\r\nNo matter where you go, there you are.\r\n\r\nWhat are occasional tables the rest of the time?", "These are my summer clothes. Summer paid for, summer not. \r\n\r\nHow do you get down from an elephant? You don't, you get down from a duck.\r\n\r\nWhy couldn't anyone play cards on the ark? Because Noah sat on the deck.\r\n\r\nTwo fish are in a tank. One says to the other \"You drive, I'll man the guns.\"\r\n\r\nThe Russians are very jealous of the American's Stealth Bombers, so they've decided to build their own. It'll be called the Optical Illyushin.\r\n\r\nOne good turn... gets all the blankets.", "I took lessons in bicycle riding, but I could only afford half of them.\r\n\r\nNow I can ride a unicycle.", "Mosquitos consider most people as food, but grandma's an open bar.", "I'll tell ya later.", "My mate's a maniakleptic â\u0080\u0093 he walks into shops backwards and leaves things.\r\n\r\nOther than that, Mrs. Lincoln, how did you enjoy the play?\r\n\r\n\"It is better to have loved a short man, than never to have loved a tall.\"\r\n\r\nIf tin whistles are made out of tin, what do they make fog horns out of?\r\n\r\nIf you jog backwards, will you gain weight? \r\n\r\nIf you try to fail, and succeed, which have you done?\r\n\r\nWe painted our floor with luminous paint. So now the florescent what it used to be.", "Do doughnut shops need security systems?", "If at first you don't suceed...lower your standards!", "She left him because he had a will of his own. And it wasn't made out to her!", "One chicken says to the other,\r\n\r\n\"For heaven's sake, don't cross the road! We'll never hear the end of it!\"", "Did you hear about the blind man who went bungee jumping??\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nV\r\nHe loved it, but it scared the heck out of his dog.", "Virginity is like a balloon. One prick and it's gone!", "Did you ever notice that a lot of people will do just about anything to get attention?\r\n\r\nLike putting jokes up on a website! \r\n\r\nP.S I love Wocka.", "Did you hear about the morning after pill for guys?\r\n\r\nIt changes his blood type.", "What do a walrus & tupperware have in common?\r\n\r\nThey both like a \"tight\" SEAL!", "Junk- something you keep for years and throw away three weeks before you need it.", "1. Who's idea was it to put \"s\" in the word \"Lisp\"?\r\n\r\n2. Trust in God, but keep your car locked.\r\n\r\n3. They say that swimming is good for your figure. If so, what happened to whales?", "\"Please Don't Hurt Me\"             by I. Bruce Easily\r\n\r\n\"Life Through the Eyes of a Drunk\" by Al Coholic\r\n\r\n\"Thirty yards to the outhouse\"     by Will E. Makeit\r\n(illustrated by Betty Wont)\r\n\r\n\"The Proper Use of Sunscreens\"     by Justin Casey Burns\r\n\r\n\"How To Cure Scratching\"           by Ivan Awfulich\r\n\r\n\"Discount Alternatives\"            by Robin Stuff", "Save the whales, harpoon a fat chick!", "If you tell the truth, you don't have to remember everything.", "You're like school on Saturday... NO CLASS!", "Beer... it's the cause and solution to all men's problems!", "How come you never hear anything about the 10th reindeer, Olive?\r\nYeah, you know, \"Olive the other reindeer, used to laugh and call him names.\"\r\n\r\nWhat's the most popular wine at Christmas?\r\n\"I don't like sprouts\"!", "Professionals built the Titanic. An amateur built the ark.", "I wish there was a knob on the TV to turn up the intelligence. There's a knob called 'brightness' but it doesn't work.", "For people who like peace and quiet: a phoneless cord.", "Hey, did you hear about the...\r\n\r\nPaper company that folded?\r\n\r\nBrake company on the skids?\r\n\r\nBra manufacturers that went bust?\r\n\r\nSurgeon who was forced to take a cut in his salary?\r\n\r\nCigarette company that went up in smoke?\r\n\r\nBaker who was short of dough?\r\n\r\nRefrigerator manufacturer that had its assets frozen?\r\n\r\nCorset firm that felt the squeeze?\r\n\r\nUpholsterers that couldn't cover their costs?\r\n\r\nAdhesive tape company that got into a sticky situation?\r\n\r\nTennis ball manufacturer that ended up in court?\r\n\r\nDownfall of the bungee suppliers?\r\n\r\nThe train company that went off the rails?\r\n\r\nThe ship building company that sunk?\r\n\r\nThe dental practice that was rotten to its roots?", "What do you do when you're lonely on an Alaskan cruise?\r\n\r\nAnswer: Go to the window and yell \"whale\"", "1. Always remember you're unique. Just like everyone else.\r\n\r\n2. Good judgement comes from bad experience, and a lot of that comes from bad judgement.\r\n\r\n3. The quickest way to double your money is to fold it in half and put it back in your pocket.\r\n\r\n4. Never miss a good chance to shut up.", "I almost had a psychic girlfriend but she left me before we met.\r\n\r\nI love defenseless animals, especially in a good gravy.\r\n\r\nMental backup in progress - Do not disturb!\r\n\r\nThe only substitute for good manners is fast reflexes.\r\n\r\nAmbition is a poor excuse for not having enough sense to be lazy.\r\n\r\nBoycott shampoo! Demand the REAL poo!\r\n\r\nBlack holes are where God divided by zero.\r\n\r\nIf you can't read this, you're illiterate.\r\n\r\nIt's a small world, but I wouldn't want to paint it.", "The bumper sticker of a proud parent read:\r\n\r\n            MY SON WAS \r\n        INMATE OF THE MONTH", "I went to a bookstore and asked the saleswoman, \"Where's the self-help section?\"\r\n\r\nShe said if she told me, it would defeat the purpose.", "I use to feel like I was a man trapped in a woman's body, but then I was born.", "Living on Earth is expensive, but it does include a free trip around the sun.\r\n\r\nLead me not into temptation...I can find the way myself.\r\n\r\nThe mind is like a parachute; it works much better when it's open.\r\nJury: Twelve people who determine which client has the better attorney.\r\n\r\nMiracles are performed every day, the impossible takes longer.\r\n\r\nNever knock on Death's door: ring the doorbell and run (he hates that).", "I went to get some paper from the stationery store, but it had moved.", "Room service? Send up a larger room.\r\n\r\nWho are you going to believe; me, or your own eyes?\r\n\r\nA child of five could understand this. Fetch me a child of five.\r\n\r\nI never forget a face, but in your case I'll be glad to make an exception.\r\n\r\nOne morning I shot an elephant in my pajamas. How he got into my pajamas I'll never know.\r\n\r\nI must say that I find television very educational. The minute somebody turns it on, I go to the library and read a book.\r\n\r\nI don't care to belong to a club that accepts people like me as members.", "My bedroom is so small...\r\nThe mice are hunchbacked.\r\nI shut the door and and the doorknob was in bed with me.\r\nI have to go outside to change my mind.\r\nIf I stand up, I'm on the second floor.", "42.7 percent of all statistics are made up on the spot. \r\n99 percent of lawyers give the rest a bad name. \r\nA bartender is just a pharmacist with a limited inventory. \r\nA clean desk is a sign of a cluttered desk drawer. \r\nA clear conscience is usually the sign of a bad memory. \r\nA closed mouth gathers no foot. \r\nA conclusion is the place where you got tired of thinking. \r\nA day without sunshine is like, night. \r\nA diplomat is someone who can tell you to go to hell in such a way that you will look forward to the trip. \r\nA flashlight is a case for holding dead batteries. \r\nAll generalizations are false, including this one. \r\nAll men are idiots, and I married their King. \r\nAlways remember you're unique, just like everyone else. \r\nAlways try to be modest and be proud of it! \r\nAnything worth taking seriously is worth making fun of. \r\nArtificial Intelligence usually beats real stupidity. \r\nAssassins do it from behind. \r\nAtheism is a non-prophet organization. \r\nAuntie Em, Hate you, hate Kansas, taking the dog. Dorothy. \r\nBe nice to your kids. They'll choose your nursing home. \r\nBeauty is in the eye of the beer holder. \r\nBeer: It's not just for breakfast anymore. \r\nBefore you criticize someone, you should walk a mile in their shoes. That way, when you criticize them, you're a mile away and you have their shoes. \r\nBetter to understand a little than to misunderstand a lot. \r\nBills travel through the mail at twice the speed of checks \r\nBorrow money from a pessimist, they don't expect it back. \r\nBoycott shampoo! Demand the REAL poo! \r\nC program run. C program crash. C programmer quit. \r\nChange is inevitable, except from a vending machine. \r\nChocolate: the OTHER major food group. \r\nConsciousness: That annoying time between naps. \r\nCorduroy pillows: They're making headlines! \r\nCould you drive any better if I shoved that cell phone up your ass? \r\nCriminal Lawyer is a redundancy. \r\nDaddy, why doesn't this magnet pick up this floppy disk? \r\nDeath is hereditary. \r\nDespite the cost of living, have you noticed how popular it remains? \r\nDid anyone see my lost carrier? \r\nDiplomacy is the art of saying good doggie while looking for a bigger stick. \r\nDo not walk behind me, for I may not lead. Do not walk ahead of me, for I may not follow. Do not walk beside me, either. Just leave me alone. \r\nDon't be irreplaceable; if you can't be replaced, you can't be promoted. \r\nDon't drink and drive. You might hit a bump and spill your drink. \r\nDon't piss me off! I'm running out of places to hide the bodies. \r\nDon't take life too seriously, you won't get out alive. \r\nDouble your drive space. Delete Windows! \r\nDuct tape is like the force, it has a light side and a dark side and it holds the universe together. \r\nEagles may soar, but weasels don't get sucked into jet engines. \r\nEnergizer Bunny arrested and charged with battery. \r\nError, no keyboard. Press F1 to continue. \r\nEver notice how fast Windows runs? Neither did I. \r\nEver stop to think, and forget to start again? \r\nEveryone has a photographic memory. Some don't have film. \r\nExperience is something you don't get until just after you need it. \r\nExperience is what you get when you didn't get what you wanted. \r\nFew women admit their age. Few men act theirs. \r\nFor every action there is an equal and opposite criticism. \r\nFor Sale: Parachute. Only used once, never opened, small stain. \r\nForget world peace. Visualize using your turn signal. \r\nFriends help you move. Real friends help you move bodies. \r\nFriends may come and go, but enemies tend to accumulate. \r\nGenerally speaking, you aren't learning much when your mouth is moving. \r\nGenius does what it must, talent does what it can, and you had best do what you're told. \r\nGet a new car for your spouse; it'll be a great trade! \r\nGive a man a fish and he will eat for a day. Teach him how to fish, and he will sit in a boat and drink beer all day. \r\nGive me ambiguity or give me something else. \r\nGood judgment comes from bad experience and a lot of that comes from bad judgment. \r\nHard work has a future payoff. Laziness pays off now. \r\nHe who laughs last thinks slowest. \r\nHonk if you love peace and quiet. \r\nHonk if you want to see my finger. \r\nHow do you tell when you run out of invisible ink? \r\nHow does Teflon stick to the pan? \r\nHow many of you believe in telekinesis? Raise my hand. \r\nI am not a vegetarian because I love animals. I am a vegetarian because I hate plants. \r\nI couldn't repair your brakes, so I made your horn louder. \r\nI didn't say it was your fault. I said I was going to blame you. \r\nI don't suffer from insanity. I enjoy every minute of it. \r\nI feel like I'm diagonally parked in a parallel universe. \r\nI get enough exercise just pushing my luck. \r\nI just got lost in thought. It was unfamiliar territory. \r\nI need someone really bad. Are you really bad? \r\nI poured Spot remover on my dog. Now he's gone. \r\nI took an IQ test and the results were negative. \r\nI tried sniffing Coke once, but the ice cubes got stuck in my nose. \r\nI used to be indecisive. Now I'm not sure. \r\nI used to have a handle on life, and then it broke. \r\nI used to have an open mind but my brains kept falling out. \r\nI won't rise to the occasion, but I'll slide over to it. \r\nI wouldn't be caught dead with a necrophiliac. \r\nI'm as confused as a baby in a topless bar. \r\nI'm not a complete idiot, some parts are missing! \r\nI'm writing a book. I've got the page numbers done. \r\nIf at first you don't succeed, destroy all evidence that you tried. \r\nIf at first you don't succeed, skydiving is not for you. \r\nIf Barbie is so popular, why do you have to buy her friends? \r\nIf ignorance is bliss, you must be orgasmic. \r\nIf you can read this, I can slam on my brakes and sue you! \r\nIf you can't convince them, confuse them. \r\nIf you choke a smurf, what color does it turn? \r\nIf you get to it and you can't do it, well there you jolly well are, aren't you. \r\nIf you haven't much education you must use your brain. \r\nIf you lend someone $20, and never see that person again; it was probably worth it. \r\nIf you tell the truth you don't have to remember anything. \r\nIf you think nobody cares if you're alive, try missing a couple of car payments. \r\nIRS: We've got what it takes to take what you've got. \r\nIt IS as bad as you think, and they ARE out to get you. \r\nIt is far more impressive when others discover your good qualities without your help. \r\nIt may be that your sole purpose in life is simply to serve as a warning to others. \r\nIt's always darkest before dawn. So if you're going to steal the neighbor's newspaper, that's the time to do it. \r\nIt's lonely at the top, but you eat better. \r\nJack Kevorkian for White House Physician. \r\nJesus loves you, but everyone else thinks you're an asshole. \r\nJoin the Army, meet interesting people, and kill them. \r\nKeep honking. I'm reloading. \r\nLaughing stock: cattle with a sense of humor. \r\nLearn from your parents' mistakes: use birth control. \r\nLottery: A tax on people who are bad at math. \r\nLove may be blind but marriage is a real eye-opener. \r\nMake it idiot proof and someone will make a better idiot. \r\nMonday is an awful way to spend 1/7th of your life. \r\nMontana: At least our cows are sane! \r\nMore hay, Trigger? No thanks, Roy, I'm stuffed! \r\nMultitasking means screwing up several things at once. \r\nMy hockey mom can beat up your soccer mom. \r\nMy mind is like a steel trap, rusty and illegal in 37 states. \r\nNever ask a barber if he thinks you need a haircut. \r\nNever do card tricks for the group you play poker with. \r\nNever mess up an apology with an excuse. \r\nNever miss a good chance to shut up. \r\nNever test the depth of the water with both feet. \r\nNever underestimate the power of stupid people in large groups. \r\nNo one is listening until you make a mistake. \r\nOh Lord, give me patience, and GIVE IT TO ME NOW! \r\nOkay, who put a stop payment on my reality check? \r\nOn the other hand, you have different fingers. \r\nOops. My brain just hit a bad sector. \r\nOut of my mind. Back in five minutes. \r\nPentiums melt in your PC, not in your hand. \r\nPlan to be spontaneous, tomorrow. \r\nPride is what we have. Vanity is what others have. \r\nPuritanism: The haunting fear that someone, somewhere may be happy. \r\nQuantum mechanics: The dreams stuff is made of. \r\nQuickly, I must hurry, for there go my people and I am their leader. \r\nReality is a crutch for people who can't handle drugs. \r\nRemember half the people you know are below average. \r\nSave the whales. Collect the whole set \r\nSave your breath. You'll need it to blow up your date!  \r\nShin: a device for finding furniture in the dark. \r\nSmile, it's the second best thing you can do with your lips. \r\nSmith & Wesson: The original point and click interface. \r\nSome days you are the bug, some days you are the windshield. \r\nSome drink at the fountain of knowledge. Others just gargle. \r\nSome people are only alive because it is illegal to shoot them. \r\nSuccess always occurs in private and failure in full view. \r\nSuicidal twin kills sister by mistake! \r\nSupport bacteria, they're the only culture some people have. \r\nThe Bermuda Triangle got tired of warm weather. It moved to Finland. Now Santa Claus is missing. \r\nThe colder the x-ray table, the more of your body is required on it. \r\nThe early bird may get the worm, but the second mouse gets the cheese. \r\nThe hardness of butter is directly proportional to the softness of the bread. \r\nThe journey of a thousand miles begins with a broken fan belt and a flat tire. \r\nThe more you complain, the longer God makes you live. \r\nThe only substitute for good manners is fast reflexes. \r\nThe problem with the gene pool is that there is no lifeguard. \r\nThe quickest way to double your money is to fold it in half and put it back in your pocket. \r\nThe secret of the universe is @*&^^^ NO CARRIER \r\nThe severity of the itch is inversely proportional to the ability to reach it. \r\nThe shortest distance between two points is under construction. \r\nThe sooner you fall behind the more time you'll have to catch up. \r\nThe universe is a figment of its own imagination. There's no future in time travel. \r\nThere are 3 kinds of people: those who can count & those who can't. \r\nThere are two theories to arguing with women. Neither one works. \r\nThere's too much blood in my caffeine system. \r\nThings are more like they are now than they ever were before. \r\nTime is the best teacher; unfortunately it kills all of its students. \r\nTime is what keeps everything from happening at once. \r\nTiming has an awful lot to do with the outcome of a rain dance. \r\nTo steal ideas from one person is plagiarism; to steal from many is research. \r\nTo succeed in politics, it is often necessary to rise above your principles. \r\nVery funny Scotty, now beam down my clothes. \r\nWanted: Meaningful overnight relationship. \r\nWarning: Dates in calendar are closer than they appear. \r\nWe have enough youth, how about a fountain of smart? \r\nWe were born naked, wet and hungry. Then things got worse. \r\nWear short sleeves! Support your right to bare arms! \r\nWhat happens if you get scared half to death twice? \r\nWhat is a free gift? Aren't all gifts free? \r\nWhat's the speed of dark? \r\nWhen everything's coming your way, you're in the wrong lane and going the wrong way. \r\nWhen there's a will, I want to be in it. \r\nWhen you don't know what you are doing, do it neatly. \r\nWho is General Failure and why is he reading my hard disk? \r\nWho stopped payment on my reality check? \r\nWhy do psychics have to ask you for your name? \r\nWhy is abbreviation such a long word? \r\nWhy isn't phonetic spelled the way it sounds? \r\nWomen who seek to be equal to men lack ambition. \r\nYou are depriving some poor village of its idiot. \r\nYou can do more with a kind word and a gun than with just a kind word. \r\nYou have the right to remain silent. Anything you say will be misquoted then used against you. \r\nYou're just jealous because the voices are talking to me and not you! \r\nYour gene pool could use a little chlorine. \r\nYour kid may be an honors student, but you're still an idiot.", "Who is the ugliest member of wocka?\r\n\r\n\r\n[Name Removed - This joke offends some users - Joke awaiting deletion]", "Veni, Vedi, Visa: I came, I saw, I did a little shopping.\r\n\r\nGravity...it's not just a good Idea, it's the Law.\r\n\r\nFirst things first, but not necessarily in that order.\r\n\r\nMy mother is a travel agent for guilt trips.\r\n\r\nMeasure wealth not by the things you have, but by the things you have for which you would not take money.\r\n\r\nLook out for #1. Don't step in #2 either.\r\n\r\nAAAAA - American Association Against Acronym Abuse.\r\n\r\nAm I ignorant or apathetic? I don't know and don't care!\r\n\r\nCan you repeat the part after, \"Listen very carefully\"?\r\n\r\nDespite the high cost of living, it remains popular.", "Dyslexia: it can warn without striking!\r\n\r\nGive and you might receive. Take and be sure of it.\r\n\r\nI used to think I was indecisive, but now I'm not so sure.\r\n\r\nI'm in a phone booth at the corner of Walk and Don't Walk.\r\n\r\nJealousy is all the fun you think they have.\r\n\r\nOriginality is the art of concealing your source.\r\n\r\nSynonym: word used when you can't spell the one you wanted.\r\n\r\nThe Apathy Anonymous meeting was canceled due to lack of interest.\r\n\r\nYou can tell a real programmer by the keyboard-shaped dents in his forehead.\r\n\r\nYou have mistaken me for someone who gives a damn.", "Why do Gynecologists retire at a younger age that other doctors?\r\n\r\nThey get tunnel vision!", "Real friends are those who, when you think you've made a fool of yourself, don't feel you've done a permanent job.", "If you help a friend in need, he is sure to remember you -the next time he's in need.", "JCPenny blowdryer: do not use while sleeping\r\n**********\r\ncaution: hot chocolate may be hot\r\n**********", "The things that come to those who wait will be the things left by those who got there first.", "Throwing acid is wrong - in some people's eyes", "What's a specimen? \r\n\r\nAn Italian astronaut!", "What's a bigamist? \r\n\r\nA heavy fog in Naples!", "What's bigotry? \r\n\r\nWhat you find in an Italian forest!", "I have a large seashell collection which I keep scattered all over the world.", "I failed my driver's test. The guy asked me \"What do you do at a red light?\" I said, \"I don't know... look around, listen to the radio...", "China has a population of a billion people. One billion. That means even if you're a one in a million kind of guy, there are still a thousand others exactly like you.", "As I was coming back from Canada, I stopped at the border and the guy asked, \"Do you have any firearms with you?\" I answered, \"What do you need?\"", "Here is some random advice to make you smile...\r\n\r\nMEN have 2 heads and WOMEN have 4 lips.\r\n\r\nThe American Dental Association says semen cuts plaque and tartar by 77%. Suck a dick and save a smile...\r\n\r\nIf you have sex 365 times a year, and if you melted down all of the condoms to make a tire, what would you call it? A fuckin Goodyear!\r\n\r\nSex is like playing spades. If you don't have a good partner, you'd better have a good hand.\r\n\r\nBig Bad Wolf told Little Red Riding Hood to lift her top so he could suck her tits. \"No,\" she said while lifting her skirt, \"Eat me like the fuckin book says!\"\r\n\r\nA rooster and a cat were playing by the pool. The cat fell in and the rooster laughed. The rooster exclaimed, \"A wet pussy always makes a cock happy!\"\r\n\r\nGirls have unique magic tricks, they get wet without water, bleed without injury, and make boneless things hard.", "Why was the little pointy-eared boy down in the dumps?\r\n\r\nHe had low elf-esteem.\r\n\r\n\r\nWhy does Santa Claus come down the chimney on Christmas Eve?\r\n\r\nBecause it soots him.", "I use to eat natural foods, but then I found out that 65% of all people die of natural causes.", "Sadly I will never be able to join a nudist colony..=[\r\n\r\nMy mother always told me not to point!! =]", "Speak your mind out when you're angry. You'll make the best speech you'll ever live to regret.", "A fool and his money are soon partying.", "Conserve water. Shower with a friend.", "\"I'm a little teapot, short and stout.\"\r\n\r\n\"I have whooping cough!\"\r\n\r\n\"Where did my bandage go?\"\r\n\r\n\"I think I'm going to puke.\"\r\n\r\n\"I can compare myself to Rachel Ray! NOT!\"\r\n\r\n\"If I mess up one more time, I'm turning this blade on you.\"\r\n\r\n\"I summon up my Eighth Amendment Right!\"\r\n\r\n\"I wanted to be an executioner!\"\r\n\r\n\"Burp!\"\r\n\r\n\"I just live here.\"\r\n\r\n\"What color the meat is, I don't care! I'm not even wearing any underwear!\"\r\n\r\n\"Man, this place just stunk up bad.\"\r\n\r\n\"You want fries with that?\"\r\n\r\n\"Johnny, my meat is on fire!\"\r\n\r\n\"Surreal.\"", "What if there were no hypothetical situations?", "What goes oh oh oh?\r\n\r\nSanta walking backwards", "How do you make the number 1 disappear?\r\n\r\nAdd a \"g\" to it and it's \"gone\"", "Q: What is the President Bush's new fitness program to get people walking again?\r\nA: GAS at $3/gallon\r\n\r\nQ: When visiting India what did George W think upon seeing a woman with a red dot on her forehead?\r\nA: Holy Shit!!!! She must've been hunting with Cheney\r\n\r\nQ: Whats the best birthday gift you can give to George W?\r\nA: An Exit Strategy from Iraq\r\n\r\nQ: Why is George Bush giving tax cuts like Jim Jones giving Kool-Aid? \r\nA: It tastes good but it'll kill you. \r\n\r\nQ: What would happen if George W Bush had selected the court in 1954?\r\nA: Clarence Thomas would have never got to law school.\"\r\n\r\nQ: Why did the Iraqi women shave there fannies?\r\nA: To send a message out \"No more Bush\"\r\n\r\n\r\n\r\n\r\nQ: George W. Bush is now under treatment for what two problems?\r\nA: Electile dysfunction and premature congratulation\r\n\r\nQ: Why can George W Bush run for a third term as president?\r\nA: Because the Supreme Court said if you count his vacation time, he's barely served one.\" \r\n\r\nQ: Why did George Bush and Andy Card agree that Andy could no longer have a cabinent position? (Andy Card is the Chief Of Staff, who originally told George W Bush the country was under attack on 9/11)\r\nA1: Because he doesn't promote inhumane torture (Attorney General: Alberto Gonzales)\r\nA2: Because he didn't originally provide body armor to our troops in Iraq (Secretary of Defense: Donald Rumsfield)\r\nA3: Because he didn't fuck up the government handling of Katrina (Homeland Security Chief: Michael Chertoff)\r\nA4: He didn't expose any CIA Agents (Carl Rove)\r\nA5: He didn't shoot old men in the face (Vice President Dick Cheney)\r\n\r\nQ: What did George Bush do when he heard about the devastation of Katrina?\r\nA: Out of force of habit he got out a copy of 'My Pet Goat' and started reading it\r\n\r\nQ: What happened when George Bush said Global Warming is happening at a faster pace then he expected?\r\nA: A cabinent member pulled him aside and told him not to worry it's spring time.\r\n\r\nQ: Why did George Bush free us from the green jackboot of the Kyoto Protocol.\r\nA: Global warming means better tans.\r\n\r\nQ: What did George Bush say when asked about giving Amnesty to illegals?\r\nA: Its absolutely terrible when one loses their memory illegal or legal.\r\n\r\nQ: Why did Dubya finally tell Karl Rove \"Enough is Enough?\r\nA: He ruined the United 93 movie for him by leaking the ending .\r\n\r\nQ: Why is George W Bush only speaking to the Amish?\r\nA: Because they are the only group not upset about the high gas prices!\r\n\r\nQ: How do you know George W Bush is not planning on invading Iran?\r\nA: Hmm....he might very well invade Iran, but there won't be any planning involved.\r\n\r\nQ: How does the Bush administration plan to fix social security?\r\nA: By taking the word SECURITY out of it.\r\n\r\nQ: When meeting Chinese President Hu, how did George W say the two countries are growing closer?\r\nA1: Chinese are slowing being given the civil liberties, Americans take for granted\r\nA2: Americans are moving towards the Chinese system of spying on its people without warrants\r\nA3: Americans are utilizing the Chinese policy of putting people in jail without a fair trial\r\nA4: The Americans are talking about building a Great Wall (Mexico/America)\r\n\r\nQ: Why did President Bush's second inaugural celebration cost $40 million?\r\nA: Because his twin daughters insisted on an open bar.\r\n\r\nQ: Why is it alright for George W to start drinking again?\r\nA: 'Well, why not? He's got everybody else drinking.'\" \r\n\r\nQ: What is George W Bush's new motto?\r\nA: Give me liberty or give me death.\" and if all else fails we'll send FEMA\r\n\r\nQ: What's the sad truth about George W Bush's poll numbers?\r\nA: More people believe Elvis is alive then in George W\r\n\r\nQ: Whats the difference between George W Bush and the Titanic?\r\nA: No matter how bad things get, nobody can sink George W's ship!\r\n\r\nQ:Why did Bin Ladin stop having sex with his wife?\r\nA:Because everytime he would spread her legs he saw Bush!\r\n\r\n\r\n\r\n\r\nQ: Why does Laura Bush (Presidents Wife) always get on top? \r\nA: ...Because George Bush can only fuck up.\r\n\r\nQ: Why is George W a big fan of Palestinian president Abbas?\r\nA: He absolutely loves his hit song, Dancing Queen.\" \r\n\r\nQ: What is the difference between the George W and Clinton's administration?\r\nA: George W has a trouble controlling his generals and Clinton had trouble controlling his privates \r\n\r\nQ: Why is Karl Rove was under fire again today?\r\nA: For leaking the plot of the new Harry Potter book to U.S. President Bush?\r\n\r\nQ: Why is the Bush administration so bad at creating jobs?\r\nA: Because they can barely hold onto the ones that they have!\r\n\r\nQ: What's the difference between George W Bush and an average student?\r\nA: An Average student can't find Iraq on a Map, George W can get out of Iraq\r\n\r\nQ: What happens if Bush's popularity falls any further\r\nA: He'll become a Democrat\r\n\r\nQ: What did President Bush do when Ryan Secrest said 62 million people voted in the American Idol finale?\r\nA: He went out and bought a karaoke machine\r\n\r\nQ: Why is Hurricane Rita Bush's worst nightmare?\r\nA: An electric chair with no power!\r\n\r\nQ: How is George W similar to the Peanuts character Pigpen?\r\nA: Wherever he goes, he stirs up such a humongous mess, it can only be cleaned up by Halliburton.\r\n\r\nQ: What did George W ask the Louisiana National Guard when visiting the destruction from Katrina?\r\nA: Does this visit count toward the service time I still owe the National Guard.\r\n\r\nQ: What can't George W do while in the White House?\r\nA1: Imprision US Citizens without a trial (...in the name of national security) \r\nA2: Wiretap citizens of the country even though other laws state that you can't\r\nA3: Go to war without a declaration from congress", "What's the difference between a hooker and a drug dealer?\r\nA hooker can wash her crack and sell it again.\r\n\r\nWhat is Moby Dick's dad's name?\r\nPapa Boner.\r\n\r\nWhat do the Mafia and a pussy have in common?\r\nOne slip of the tongue, and you're in deep shit.\r\n\r\nA daughter asked her mother how to spell penis, her mom said, \"You should have asked me last night, it was at the tip of my tongue.\"\r\n\r\nWhat has got two legs and bleeds?\r\nHalf a dog!\r\n\r\nWhat kind of bees produce milk?\r\nBoobies.\r\n\r\nWhat do you call an Afghan virgin?\r\nMever bin laid on.\r\n\r\nWhat do you call a lesbian dinosaur?\r\nA lickalotopuss.\r\n\r\nWhen do you kick a dwarf in the balls?\r\nWhen he is standing next to your miss telling her her hair smells nice.\r\n\r\nWhy did Tigger lok in the toilet?\r\nBecause he was looking for Pooh.\r\n\r\nIf a firefighters business can go up in smoke, and a plumbers business can go down the drain, can a hooker get layed off?\r\n\r\nDo you know what the square root of 69 is?\r\nAte something.\r\n\r\nHow does a woman scare a gynecologist?\r\nBy becoming a ventriloquist!\r\n\r\nIf you had a donkey and I had a chicken and if your donkey ate my chicken what will you have?\r\nThree feet of my cock up your ass.\r\n\r\nWhat should you do if your girlfriend starts smoking?\r\nSlow down - and possibly use a lubricant.\r\n\r\nWhy do women rub their eyes when they get up in the morning?\r\nThey don't have balls to scratch.\r\n\r\nWhat did the banana say to the vibrator?\r\nWhy are YOU shaking? She's going to eat me!\r\n\r\nOne day, a little boy wrote to Santa Clause, \"Please send me a sister.\"\r\nSanta Clause wrote him back, \"Ok, send me your mother.\"\r\n\r\nWhat's the difference between the Florida State football team and a Florida State cheerleader?\r\nThey both suck for four quarters.\r\n\r\nWhat's the difference between a rabbi and a priest? \r\nA rabbi cuts them off; A priest sucks them off.\r\n\r\nWhy do dwarfs laugh when they play soccer?\r\nThe grass tickles their balls.\r\n\r\nWhat do priests and Mcdonalds have in common? \r\nThey both stick their meat in 10 year old buns.\r\n\r\nHow do you circumcise a hillbilly?\r\nKick his sister in the jaw.\r\n\r\nWhat does a 75 year old woman have between her breasts that \r\n 25 year old doesn't?\r\nHer navel.\r\n\r\nWhat does a good bar and a good woman have in common?\r\nLiquor in the front and poker in the back!\r\n\r\nWhy does the Easter Bunny hide Easter eggs?\r\nHe doesn't want anyone knowing he's been fucking the chickens!\r\n\r\nWhat is the difference between erotic and kinky?\r\nErotic is using a feather....kinky is using the whole chicken.\r\n\r\nWhen does a cub become a boy scout?\r\nWhen he eats his first Brownie.\r\n\r\nWhat did the cannibal do after he dumped his girlfriend?\r\nWiped his ass.\r\n\r\nHow do you tell if a chick is to fat to fuck?\r\nWhen you pull her pants down her ass is still in them.\r\n\r\nWhat does a woman and Kentucky Fried Chicken have in common?\r\nBy the time you're finished with the breast and thighs, all you have left is the greasy box to put your bone in.\r\n\r\nWhy doesn't Mexico have an Olympic team?\r\nBecause everybody who can run, jump and swim are already in the U.S.\r\n\r\nHow do you embarrass an archaeologist?\r\nGive him a used tampon and ask him which period it came from.\r\n\r\nWhat do u call a bunny with a bent dick?\r\nFUCKS FUNNY.\r\n\r\nWhat is the difference between snowmen and snowwomen?\r\nSnowballs.\r\n\r\nWhat's the difference between a Southern zoo and a Northern zoo?\r\nA Southern zoo has a description of the animal on the front of the cage, along with a recipe.\r\n\r\nWhat's 6 inches long and starts with a p?\r\n........... a shit (think about it).\r\n\r\nWhy is being in the military like a blow-job?\r\nThe closer you get to discharge, the better you feel.\r\n\r\nWhat do you call a ninety year old man who can still masturbate?\r\nMiracle Whip.\r\n\r\nWhat do hockey players and Surrey girls have in common?\r\nThey both only change their pads after every third period!\r\n\r\nWhat is the difference between oral and anal sex?\r\nOral sex makes your day and anal sex makes your whole weak.\r\n\r\nWhats the best thing about a 18 year old girl in the shower?\r\nSlick her hair back she looks 15..\r\n\r\nAfter a quarrel, a husband said to his wife, \"You know, I was a fool when I married you.\"\r\nShe replied, \"Yes, dear, but I was in love and didn't notice.\"\r\n\r\nWhat's black, white, and red all over and doesn't fit through a revolving door?\r\nA nun with a spear through her head.\r\n\r\nWhy are pubic Hairs so curly?\r\nSo they don't poke her eye out.\r\n\r\nWhat's the difference between a bandleader and a gynecologist?\r\nA bandleader fucks his singers and a gynecologist sucks his fingers.\r\n\r\nWhat has a whole bunch of little balls and screws old ladies?\r\nA bingo machine.\r\n\r\nWhy do men like big tits and a tight ass?\r\nBecause they've got big mouths and little dicks.\r\n\r\nWhat's long hard and full of seamen?\r\nA submarine.\r\n\r\nWhat's long, hard and erects stuff?\r\nA crane!\r\n\r\nDid you hear about the Chinese couple that had a retarded baby?\r\nThey named him Sum Ting Wong.\r\n\r\nName the five great kings that have brought happiness in to peoples lives.\r\nDrinking licking sucking fucking and wanking.\r\n\r\nWhat's the difference between a Catholic priest and a zit?\r\nAt least a zit waits until you're a teenager before it cums on your face!\r\n\r\nHow does a Scotsman find a sheep in tall grass?\r\nVery satisfying.\r\n\r\nWhat's thirty feet long and smells like urine?\r\nLine dancing at a nursing home.\r\n\r\nWhat is the square root of 69?\r\nAte something.\r\n\r\nBut do you know what 6.9 is?\r\nA good thing screwed up by a period.\r\n\r\nWhat do cow pies and cowgirls have in common?\r\nThe older they get the easier they are to pick up.\r\n\r\nWhat does a Rubick's cube and a penis have in common?\r\nThe more you play with it the harder it gets.\r\n\r\nWhat do you called an anorexic bitch with yeast infection?\r\nA quarter-pounder with cheese.\r\n\r\nA recent survey shows that sperm banks beat blood banks in contributions...HANDS DOWN!\r\n\r\nYour mom's like a old cooker; any old nob can turn her on.\r\n\r\nIf you force sex on a prostitute, is it rape or shoplifting? You choose.\r\n\r\nWhat did the hard boiled egg say to the boiling water?\r\nI can't get a hard-on because I was just laid.", "Women like silent men - they think they're listening.", "And then there was the glass-blower who got hiccups and made 764 marbles.", "Are you an aspirin? Because I'd like to take you every 4 to 6 hours.\r\n\r\nThere are a lot of fish in the sea, but you're the only one I'd like to mount and take back to my place.\r\n\r\nExcuse me, are you hiring? I heard you have an opening you need filled.\r\n\r\nWhat has 148 teeth and holds back the incredible hulk? My zipper.\r\n\r\nDo you like parties? Because you can climb up my pants and have a ball!\r\n\r\nIf you were vanilla ice cream and I was hot caramel, I'd pour myself all over you.\r\n\r\nHere is $30. Drink until I am really good looking, then come to talk to me.\r\n\r\nGirl......you are like a tall glass of water, and I'm telling you str8 up I'm thirsty.\r\n\r\nIf you were a word on a piece of paper you would read (fine print).\r\n\r\nLife without you would be like a broken pencil...pointless.\r\n\r\nKissing is a language of love....... so how about a conversation?\r\n\r\nIf you were a laser you'd be set to stunning.\r\n\r\nBaby, your lips are like candy and I'm the fat kid.\r\n\r\nBaby, I want to wear you like a pair of sun glasses, one leg over each ear.\r\n\r\nYou're in a relationship, I'm in a relationship but that doesn't mean we can't have relations.\r\n\r\nYou must be a ship; you've always been on my radar.\r\n\r\nIf a blade of grass was sexy, then baby, you'd be a field.\r\n\r\nIf fine was a felony you'd be on death row.\r\n\r\nMotion your finger to a girl to get her to come your way.\r\nWhen she arrives say, \"I knew if I fingered you long enough you would cum.\"\r\n\r\nYou owe me money! (Why?) Because you've been living in my heart and not payin rent.\r\n\r\nIs there an airport nearby, or is that just my heart taking off?\r\n\r\nYou know how some men buy really expensive cars to make up for certain, well, shortages? Well, I don't even own a car. \r\n\r\n(for an overweight person); \"Hey baby, do you want to put the love in these handles?\"\r\n\r\nAm I in the woods? Cos you're a fox.\r\n\r\nThe only thing I want between our relationship is latex.\r\n\r\nIf you were a car, I'd wax and ride you all over town.\r\n\r\nExcuse me for interupting, and I'm not trying to make a pass, but you must be leaving the country if youre packing that much ass.\r\n\r\nHey, I lost my gun holster, can I use yours?\r\n\r\nHey I am like a Rubik's cube; the more you play with me, the harder I get!\r\n\r\nCute smile...Is that the only thing you can do with those lips?\r\n\r\nGod almost didn't make you. He was afraid the angels would get jealous.\r\n\r\nStarlight, starbright why don't you come home with me tonight?\r\n\r\nHi, I'm an fine art appraiser and your ass is priceless!\r\n\r\nYou must be a parking ticket because you got fine written all over you.\r\n\r\nIf Santa Claus comes down your chimney, and puts you in his sack, don't worry, because I wanted you for Christmas.\r\n\r\nI've just received government funding for a four-hour expedition to find your G-spot. \r\n\r\nIf your left leg was Thanksgiving, and your right leg was Christmas, can I come see you between the holidays?\r\n\r\nYou're so hot you would make the devil sweat.\r\n\r\nAwww.. BABY GIRL YOU AIN'T NO DIME BECAUSE DIMES GET SPENT, BUT IN OTHER WORDS YOU A DIAMOND BECAUSE DIAMONDS LAST FOREVER.\r\n\r\nSee that girl over there (if yes) she's likes nails. I sure hope you prefer screws cuz I can give you a lot!\r\n\r\nIs your body a map? Cause I love to travel!\r\n\r\nLet's go behind a rock and get a little boulder!!/p>\r\n\r\nAll those curves, and me with no brakes.\r\n\r\nSmile if you want to sleep with me; then watch the victim try to hold back her smile...\r\n\r\nIf I flip a coin what are my chances of getting head?\r\n\r\nAm I pleased to see you or did I just put a canoe in my pocket?\r\n\r\nHey, they call me coffee cause I grind so fine\r\n\r\nWhat's wrong? You're looking a little sad and gloomy. What you need is some Vitamin me.\r\n\r\nHaven't we met before?... I'm not too good with names but I'm awesome with numbers.\r\n\r\nIf a kiss was a snow flake I would send you a snow storm.\r\n\r\nYour name must be mickey, cause you so fine. (In reference to One Hit Wonder Song by Toni Basil) \r\n\r\nNice pants...can I test the zipper?\r\n\r\nI know hello in 6 different languages, which one do you want me to use in the morning?\r\n\r\nCan I get your football jersey (what?) you know, your name and number.\r\n\r\nIf I put my key in your ignition will it turn you on?\r\n\r\nI need to make a citizens arrest against you, cause it's a crime to be that fine!\r\n\r\nYou're like cigarettes, addictive as hell.\r\n\r\nDid you brush your teeth this morning or do I need to taste them to find out?\r\n\r\nDid you just take a shower or is it me that's making you wet?\r\n\r\nI feel like Richard Gere, I'm standing next to you, the PRETTY WOMAN.\r\n\r\nDo you have a boyfriend? Well, when you want a MANfriend, give me a call.\r\n\r\nWow, I must be good at darts, because I hit a bullseye with you.\r\n\r\nDamn, girl, you're about to make the rocket in my pants blast off!\r\n\r\nHave you ever slid down a rail; She says \"no\"; would you like to slide down mine?\r\n\r\nGirl, you're so hot, I need oven mitts!\r\n\r\nHi, my name is Doug. Backwards, it's god with a little bit of U wrapped around it.\r\n\r\nWe're both fine specimens, let's say we go make some more.\r\n\r\nCould you step away from the bar? You're making all the ice melt.\r\n\r\nDo you have an extending ladder? Because the first wall you put between us was too high for my regular ladder. \r\n\r\nHey, baby, my underwear is completly stretched out. You know what that means.\r\n\r\nDrop a packet of sugar on the floor next to the girl you are after. Pick it up and say \"I'm sorry, but I think you dropped your nametag!\"\r\n\r\nWanna try and Australian kiss? (what's that?) It's like a French kiss...only down under!\r\n\r\nHey you free for dinner? Because I have a private chef who makes a mean breakfast in bed.....You see where I'm going with this? (Works better if you actually do have a private chef)\r\n\r\nAre you a drummer? Because you seem to know the beat of my heart.\r\n\r\nHey, you owe me a drink. I dropped mine when you walked past.\r\n\r\nAre you a boxer? (No) Well, how about you get on your knees and give me two blows to the head?\r\n\r\nDid you ever realize screw rhymes with me and you?\r\n\r\nAre you an alien, cause you have just abducted my heart?\r\n\r\nI'd buy you a drink but I would be jealous of the straw.\r\n\r\nDid you wash your clothes in windex? Cause I can see myself in your pants.\r\n\r\nExcuse me, do you have a quarter? (No, why?) Well, cause I told my girlfriend I'd call her when I found someone better.\r\n\r\nLet's play circus; first sit on my face, I'll guess your weight and I'll eat the difference.\r\n\r\nDo you have a cellphone in your back pocket? (why?) Cause yo booty been callin me alllll dayyyy.\r\n\r\nExcuse me, I think you dropped something (when she asks what?) \"My Jaw\"\r\n\r\nSince beauty is only skin deep, your body has no insides...\r\n\r\nThey say apples don't fall far from the tree, so that must mean your mom's hot too.\r\n\r\nGirl do you have a fever cause you sure look hot!\r\n\r\nI think I saw a picture of you once; I saw it in the dictionary, it was right next to the word \"KABLAAM\"\r\n\r\nDo you like punani? .. Because I would like 2 eat some!\r\n\r\nI like my coffee just like I like my women; (with extra sugar, black, etc.)\r\n\r\nYou wanna play pool? I'll shoot my balls in your holes.\r\n\r\nHey, baby, is your name Daisy? Because I have the urge to plant you right here.\r\n\r\nIt may be a needle, but it works like a sewing machine.\r\n\r\nWas that an earthquake, or did I just rock your world?\r\n\r\nIs that shirt (those pants) made of camel skin? (no, why?) cuz I noticed the humps.\r\n\r\nTickle your pussy with a feather? (What?) I said, \"Particularly nice weather.\"\r\n\r\nIs there a magnet in here? Cuz baby I'm attracted to you.\r\n\r\nI saw you from across the room, and I fainted, and hit my head, so I am going to need your name and number for insurance reasons.\r\n\r\nHey, do you want to play Pearl Harbor? if yes, It is where I sit back and you blow the hell out of me.\r\n\r\nHey (say her name), I know this is not a chat room but my lips want to chat with yours.\r\n\r\nYou know what would look good on you? Me.\r\n\r\nWere you standing by the fire? (why) Cause your hair is on fire.\r\n\r\nYou so fine I'd bite yo toe nails and drink yo bath water.\r\n\r\nDo you like milk? Cause you have it around your lips.\r\n\r\n(two girls are talking to each other) interrupt them saying, \"Hello, ladies, I don't mean to come between you... or do I?\"\r\n\r\nAre your parents terrorists? Cause you're the bomb.\r\n\r\nExcuse me...Hi, I'm writing an essay on the finer things in life, and I was wondering if I could interview you.\r\n\r\nAre you a high jumper? Because you make my bar go up.\r\n\r\nAre you going to the BBQ? (What BBQ?) My meat in your grill.\r\n\r\nThe only vowels I need are U and I\r\n\r\nDo you need a napkin? Because you look DIRTY!\r\n\r\nAre you a pirate? {she replies no, why?} Cause I am diggin your booty.. (or chest)... \r\n\r\nBaby, you give the sun a reason to SHINE.\r\n\r\nDo you have 10 cents? Cause from here you look like a dime.\r\n\r\nYou have monkey wrench eyes; Every time I look into them my nuts tighten.\r\n\r\n\"If I was naked, holding some pie and ice cream, would that still be dessert? or would I?\"\r\n\r\nI've got the ship, you've got the harbor ... what say we tie up for the night?\r\n\r\nDo you have a Bandaid? Cos I just scraped my knee falling for you. \r\n\r\nYOU HAVE SOMETHING ON YOUR ASS. [WHAT?] MY EYES.\r\n\r\nAre you GREEK [IF NO] Are you SURE? CAUSE you LOOK LIKE A GODDESS TO ME.\r\n\r\nDo you know where the nearest insane asylum is? Because baby, without you I'm going crazy.\r\n\r\nI will be a Dixie Chick and you be my cowboy... now take me away!\r\n\r\nGirl, do you take karate? Because your body is kicking.\r\n\r\nHey babe, can I have your number? I think it'll look better in my pocket than in your head.\r\n\r\n\"That shirt is becoming on you. If I were on you, I'd be coming too.\"\r\n\r\nIs your last name Pepper? Cause you're SMOKIN! \r\n\r\nHey,  baby, wanna see the pot of gold at the end of my rainbow?\r\n\r\nCan I use your phone to call God & I need to tell him 1 of his angels is missing!\r\n\r\nWas your father a thief? 'Cause someone stole the stars from the sky and put them in your eyes.\r\n\r\nDo you know, your hair and my pillow are perfectly colour coordinated.\r\n\r\nI can't play the guitar but I'll sure pluck your G String.\r\n\r\nMan.... Christmas must have come early this year because you were first on my Christmas list.\r\n\r\n(boy) Wanna play Titanic? (girl) Yeah (boy) When I say iceberg you go down.\r\n\r\nAre you THE MATRIX? Cause I'M THE ONE.\r\n\r\nHey, you know what? (What) You remind me of homework. (Why?) Because you're always ready to be done.\r\n\r\nDo you have a paper towel? Cuz I get dirty lookin at you!\r\n\r\nIf you were my deck, I would take out the nails and screw you.\r\n\r\nBefore you put that outfit on they were just clothes, but with you in it, it is a fashion statment.\r\n\r\nWas your father a mechanic? Then how did you get such a finely tuned body?\r\n\r\nSave a horse, ride a cowboy.\r\n\r\nYou're like milk, I just wanna make you part of my complete breakfast.", "I invented a cure for amnesia - but I've forgotten what it is!", "One employee asked another, \"How long have you been working here?\"\r\n\r\nThe second said, \"Ever since the boss threatened to fire me!\"", "What do you get when you cross a dinosaur with a pig?\r\n\r\nJurassic pork!", "Beer is proof that God loves us and wants us to be happy!", "\"This storm is bad,\" Bob thundered.", "A teacher is telling her class she has two words that will not be allowed to use.\r\n\r\nTeacher: There are two words which I will never let you use. One is gross and the other is cool.\r\n\r\nStudent: So what are the words?", "Why was Johnny's math book sad?\r\nIt had too many problems!", "jkfsh", "Bob: How do you keep a turkey in suspense?\r\n\r\nWillie: I dunno.\r\n\r\nBob: I'll tell you later...", "There is no job so simple that it cannot be done wrnog.", "I knocked several times, but you weren't in.\r\n\r\n - Opportunity", "If an item is advertised as \"under $50\", you can bet it's not $19.95.", "If flattery gets you nowhere, try bribery.", "If people listened to themselves more often, they would talk less.", "If we learn by our mistakes, some of us are getting one great education!", "Never insult an alligator until after you have crossed the river.", "- The principal singer of nineteenth century opera was called pre-Madonna. \r\n\r\n- Gregorian chant has no music, just singers singing the same lines. \r\n\r\n- Sherbet composed the Unfinished Symphony. \r\n\r\n- All female parts were sung by castrati. We don't know exactly what they sounded like because there are no known descendants. \r\n\r\n- Young scholars have expressed their rapture for the Bronze Lullaby, the Taco Bell Cannon, Beethoven's Erotica, Tchaikovsky Cracknutter Suite, and Gershwin's Rap City in Blue. \r\n\r\n- Music sung by two people at the same time is called a duel; if they sing without music it is called Acapulco. \r\n\r\n- A virtuoso is a musician with real high morals. \r\n\r\n- Contralto is a low sort of music that only ladies sing. \r\n\r\n- Probably the most marvelous fugue was the one between the Hatfields and the McCoys. \r\n\r\n- A harp is a nude piano. \r\n\r\n- Refrain means don't do it. A refrain in music is the part you'd better not try to sing. \r\n\r\n- I know what a sextet is but I'd rather not say. \r\n\r\n- My favorite composer was Opus. Agnus Dei was a woman composer famous for her church music. \r\n\r\n- Johann Sebastian Bach wrote a great many musical compositions and had a large number of children. In between he practiced on an old spinster which he kept up in his attic. \r\n\r\n- Rock Monanoff was a famous post-romantic composer of piano concerti.", "After all is said and done, usually more is said than done.", "A clean tie attracts the soup of the day.", "Don't lend people money...it gives them amnesia.", "All inanimate objects can move just enough to get in your way.", "Any wire cut to length will be too short.", "Blessed is he who expects no gratitude, for he shall not be disappointed.", "Confidence is the feeling you have before you understand the situation.", "Be content with what you've got, but be sure you've got plenty of it.", "The chance of forgetting something is directly proportional to...to...uhh...", "The dictionary is the only place where success comes before work.", "One of the greatest labor-saving inventions today is tomorrow.", "There are two kinds of people who don't say much: those who are quiet and those who talk a lot.", "No matter what happens, there is always somebody who knew that it would.", "There are two rules for success in life:\r\n\r\nRule 1 - Don't tell people everything you know.", "Why is it that there are so many more horses' asses than there are horses? \r\n\r\n- G. Gordon Liddy", "You can fool all of the people some of the time, some of the people all of the time, and that should be sufficient for most purposes.", "You can fool all of the people some of the time, and some of the people all of the time, but you can make a fool of yourself any time.", "If you think it's hard to meet new people, try picking up the wrong golf ball.", "Overweight is something that just sort of snacks up on you.", "I think that's how Chicago got started. A bunch of people in New York said, \"Gee, I'm enjoying the crime and the poverty, but it just isn't cold enough. Let's go west.\"", "Could it be that all those trick-or-treaters wearing sheets aren't going as ghosts but as mattresses?\r\n\r\nIf a man is standing in the middle of the forest speaking and there is no woman around to hear him...is he still wrong?\r\n\r\nIs there another word for synonym?\r\n\r\nWhere do forest rangers go to \"get away from it all?\"\r\n\r\nIf a parsley farmer is sued, can they garnish his wages?\r\n\r\nHow do they get the deer to cross at that yellow road sign?\r\n\r\nThe older you get, the better you realize you were.\r\n\r\nAge is a very high price to pay for maturity.\r\n\r\nProcrastination is the art of keeping up with yesterday.\r\n\r\nDo pediatricians play miniature golf on Wednesdays?\r\n\r\nBefore they invented drawing boards, what did they go back to?\r\n\r\nIf one synchronized swimmer drowns, do the rest have to drown too?\r\n\r\nWhy are there interstate highways in Hawaii?\r\n\r\nIf Denny's is open 24 hours a day, 365 days a year, why are there locks  on the doors?\r\n\r\nIf you're in a vehicle going the speed of light, what happens when you turn on the headlights?", "The trouble with doing nothing is that you never know when you are finished.", "Never smack a man who's chewin' tobacco.", "It might look like I'm doing nothing, but at the cellular level I'm really quite busy.", "Someday, we'll look back on this, laugh nervously, and change the subject.", "How many cops does it take to throw a man down the stairs?\r\n\r\nNone. He fell.", "The American tourist in Dublin had been complaining a great deal about the food.\r\n\r\n\"Here,\" he said to the waitress, holding out a piece of meat for inspection, \"do you call that pig?\"\r\n\r\n\"Which end of the fork, sir?\" the waitress asked.", "When you have a fat friend, there are no seesaws, just catapults.", "What's the hardest thing about rollerblading?\r\n\r\nTelling your parents that you are gay.", "\"While getting dressed one morning, I decided I have been spending waaaaay too much time on the computer, when I caught myself checking the lower right corner of my make-up mirror to see what time it was.\" - Unknown", "I inherited a painting and a violin which turned out to be a Rembrandt and a Stradivarius.\r\n\r\nUnfortunately, Rembrandt made lousy violins and Stradivarius was a terrible painter. - Tommy Cooper", "It takes fewer muscles to smile than to frown - and fewer still to ignore someone completely.", "I believe no problem is so large or so difficult that it can't be blamed on someone else.", "How can you be sad when you are at the Sunshine Happiness Parade of Friendly Friends?", "People always say that hard work never killed anybody. Oh yeah?\r\n\r\nWhen's the last time ya ever heard of anyone who \"rested to death?\"", "Happiness doesn't bring money.\r\n\r\nI want to be what I was when I wanted to be what I'm now.\r\n\r\nThe government has at least one problem for every solution.\r\n\r\nOnly the conservatives can make the country like it used to be - a huge swamp full of dinosaurs.\r\n\r\nDemocracy is having freedom of speech, freedom of thought, and the thoughtfulness to use neither one.\r\n\r\nIf you don't go to other people's funerals, they won't come to yours.", "What do you call a group of Jew baritones and sopranos singing?\r\n\r\nSoap opera.", "You can fool some of the people all of the time and all of the people some of the time, but you can never fool a Mom.", "I think - therefore I'm single. (Lizz Winstead)\r\n\r\nIn politics, if you want anything said, ask a man; if you want anything done, ask a woman. (Margaret Thatcher)\r\n\r\nWhen women are depressed they either eat or go shopping. Men invade another country. (Elayne Boosler)\r\n\r\nI'm not offended by all the dumb blonde jokes because I know I'm not dumb... and I also know that I'm not blonde. (Dolly Parton)\r\n\r\nI'm not going to vacuum 'till Sears makes one you can ride on. (Roseanne Barr)\r\n\r\nIf men can run the world, why can't they stop wearing neckties? How intelligent is it to start the day by tying a little noose around your neck? (Linda Ellerbee)", "What's the difference between a bird and a fly?\r\n\r\nWell, a bird can fly . . .", "I don't want any yes-men around me. I want everybody to tell me the truth even if it costs them their jobs.\r\n\r\nSam Goldwyn.", "Psychiatrist to his nurse: \"Just say we're very busy.\r\n\r\nDon't keep saying 'It's a madhouse.'\"", "I passed my ethics exam.\r\n\r\nNaturally, I cheated.", "The person who spends all of today bragging about what he is going to accomplish tomorrow probably did the very same thing yesterday.", "Any time four New Yorkers get into a cab together without arguing, a bank robbery has just taken place.", "Don't argue with an idiot.\r\n\r\nHe may be doing the same thing.", "Do not try to guess your wife's size.\r\n\r\nJust buy her anything marked \"petite\" and hold on to the receipt.", "Knowledge cannot enter the head via an open mouth.", "Rap is to music as Etch-A-Sketch is to fine art.", "Join the fight against brutality.", "Why isn't there a tax on stuff I DON'T like?", "As a computer, I find your faith in technology amusing.", "When a man wants to believe something, it doesn't take much to convince him.", "Grocery List; (noun)\r\n\r\nA piece of paper you spend half an hour writing, and then forget to take with you to the store.", "Lipstick; (noun)\r\n\r\nOn your lips, coloring to enhance the beauty of your mouth.\r\nOn his collar, coloring only a tramp would wear!", "Foreign Film\r\n\r\nAny movie shown in a Texas theater that isn't a western.", "Battle\r\n\r\nWhere a whole lot of white men kill a few Indians.\r\n\r\n\r\n\r\nMassacre\r\n\r\nWhere a whole lot of Indians kill a few white men.", "Magazine\r\n\r\nBunch of printed pages that tell you what's coming in the next issue.", "Murphy's Law of Cable TV\r\n\r\nIf you have watched a TV series only once, and you watch it again, it will be a rerun of the same episode.", "Remember the Golden Rule\r\n\r\nHe who has the gold makes the rules.", "Just when you get really good at something, you don't need to do it any more.", "Just when you find something you really like, they stop making it.", "Prudhomme's Law of Window Washing\r\n\r\nIt's on the OTHER side.", "Anybody can win.\r\n\r\nUnless, of course, there happens to be a second entry.", "Let not the sands of time get in your lunch.", "A person soon learns how little he knows when a child begins to ask questions.", "The one who says it cannot be done should never interrupt the one who is doing it.", "All things are possible - except skiing through a revolving door.", "The laziest man I ever met put popcorn in his pancakes so they would turn over by themselves.\r\n\r\n- W. C. Fields.", "My grandson is four and can recite the whole Gettysburg Address. Abraham Lincoln couldn't do it until he was fifty-four.\r\n\r\n- Sam Levenson.", "Quick - Cheap - Good\r\n\r\nPick 2.\r\n\r\n- Dennis Robertus.", "It is better to remain silent and be thought a fool than to speak and remove all doubt.\r\n\r\n- Abraham Lincoln.", "Opportunity is missed by most people because it is dressed in overalls and looks like work. \r\n\r\n- Thomas Alva Edison.", "A lot of people ask me if I were shipwrecked, and could only have one book, what would it be?\r\n\r\nI always say, \"How to Build a Boat\".\r\n\r\n- Steven Wright.", "Why shouldn't you tell a secret around a clock? \r\n\r\nBecause time will tell.", "You might be a teacher if you have an overwhelming urge to nod and say, \"Now I understand why your kid is the way he/she is,\" after meeting the parents.", "Q: Why are cannibals such great improvs?\r\n\r\nA: They keep feeding off each other.", "Police Begin Campaign to Run Down Jaywalkers \r\n\r\nSurvivor of Siamese Twins Joins Parents \r\n\r\nBan On Soliciting Dead in Trotwood \r\n\r\nSome Pieces of Rock Hudson Sold at Auction \r\n\r\nNew Vaccine May Contain Rabies\r\n\r\nTwo Soviet Ships Collide, One Dies \r\n\r\nTeacher Strikes Idle Kids \r\n\r\nSoviet Virgin Lands Short of Goal Again \r\n\r\nIraqi Head Seeks Arms \r\n\r\nFarmer Bill Dies in House \r\n\r\nBank Drive-in Window Blocked by Board", "If you are in darkness, then pray to God.\r\nIf you are still in darkness, then go and pay your electricity bill......", "Just when you are finally happy with your life and eveything going on in your life....\r\n\r\nYou get married and ruin it!", "You never know someone until you walk a mile in their shoes.\r\n\r\nBut if you walked a mile in their shoes wouldn't their feet get cold?", "Post rejected Braingle brain teasers here.", "I found this attached to a halloween scythe:\r\nBE SURE HEAD IS ATTACHED BEFORE USE.", "What's green and runs round the garden?\r\n\r\nThe hedge!", "What is a musician with real high morals? \r\n\r\nVirtuoso.", "Can you decipher this phrase?\r\n\r\nA R M S \r\n\r\nOpen arms!", "Les chÃ¨res lÃ©chÃ¨rent les chairs.", "Why do we press harder on a remote control when we know the batteries are getting weak?", "Why does someone believe you when you say there are four billion stars, but check when you say the paint is wet?", "Why doesn't glue stick to the bottle?", "Why do they use sterilized needles for death by lethal injection?", "Does a clean house indicate that there is a broken computer in it?", "Why do people keep running over a string a dozen times with their vacuum cleaner, then reach down, pick it up, examine it, then put it down to give the vacuum one more chance?", "Why is it that whenever you attempt to catch something that's falling off the table you always manage to knock something else over?", "In winter, why do we try to keep the house as warm as it was in summer when we complained about the heat?", "Why do you never hear father-in-law jokes?", "If at first you don't succeed, shouldn't you try doing it like your wife/girlfriend told you to do it?", "And my FAVORITE......\r\n\r\nThe statistics on sanity are that one out of every four persons is suffering from some sort of mental illness. Think of your three best friends, if they're okay, then it's you.", "This is a very long line that goes on and on and just when you think it is over it starts again going on and on but you know it cannot keep on forever until it starts repeating itself about being a very long line that goes on\r\nand on and just when you think it is over it starts repeating itself about not keeping going on and on forever but you know it was a very long line.", "Can you decipher this phrase?\r\n\r\nTTTTTTTTTT \r\n\r\nTent.", "Can you decipher this phrase?\r\n\r\nLINE\r\n   = \r\n\r\nEnd of the Line!", "Dogs crawl under fences...Software crawls under Windows95.", "Scanning for viruses...Windows95 found...Please delete.", "Double your drive space...Delete Windows95.", "Friends don't let friends use Windows95.", "If at first you don't succeed...work for Microsoft.", "Turn your Pentium into a gameboy...Type \"WIN\" at the prompt.", "Windows95...the best $159 Solitaire game you can buy.", "Activate your own virus... type \"WIN\" at the prompt.", "What did the chicken say to the bully?\r\n\r\n\r\nWhy don't you peck on someone your own size?", "According to the Institute of Incomplete Research, 7 out of 10 people are", "When you're right, no one remembers. When you're wrong, no one forgets.", "Many of you may be too young to remember U.S. comedian Sam Levenson; he was popular from the 1940s through the mid-1960s. Levenson said things that made sense and it would be a shame if they faded into oblivion, so here are a few of his \"nuggets\" worth assaying.\r\n\r\n1. The first screw to get loose in your head is the one that holds your tongue in place.\r\n\r\n2. You're only young once. After that it takes some other excuse for behaving like an idiot.\r\n\r\n3. Even if the majority agrees on an idiotic idea, it is still an idiotic idea.\r\n\r\n4. There are more important things in life than money. The trouble is they all cost money.\r\n\r\n5. On sex education in schools: Let them teach it! If the schools teach sex the way they teach everything else, the kids will lose interest anyhow.", "The government has recently issued a statement saying that 18.9 percent of all statistics are false.", "Cinfuscious says : It is nice to meet a woman in the park but is better to park meat in a woman.", "Any horizontal surface is soon piled up.", "The best way to end a war is to surrender.", "YOU'RE READING IT, YOU DOPE!", "MADE YOU LOOK!", "Homework... something you go to school hours for and not do.", "The computer, the greatest invention in life even though it's bad for you.", "Things to do at a McDonalds drive thru!\r\n\r\n1. Stand close to the speaker and yell your order, using colorful expletives in ways which would embarrass the patrons inside.\r\n\r\n2. Drive through backwards.\r\n\r\n3. Belch your order.\r\n\r\n4. After ordering, cover the speaker and mic with transparent tape. Watch as customers and order-takers are unable to hear each other and, thus, each raises his/her volume.\r\n\r\n5. Barter. Offer a Whopper for a Big Mac.\r\n\r\n6. Walk through.\r\n\r\n7. Speak a foreign language (make one up if you have to). When the manager comes to the mic, speak English and inquire as to why the order taker had such difficulty understanding you.\r\n\r\n8. Repeat everything the order-taker says.\r\n\r\n9. Attempt to take the order-takers order (\"Hi, may I take your order?\") before they get a chance to take yours.\r\n\r\n10. Order confusing items, i.e., \"Hi, I'll have a large orange Coke and a small medium fries, please\".\r\n\r\n11. In a crowded drive-thru line, place a HUGE order, then slip out of line and watch the fun as the person behind you is handed 40 bags of food.\r\n\r\n12. When you arrive at the window to pick up your food, hand them several bags of garbage & ask if they'll dispose of it for you. Make sure it smells.\r\n\r\n13. Drive through with a carload of naked people.\r\n\r\n14. Speak in such a garbled fashion that the order-taker will think there is a problem with the speaker and ask you to order at the window. When you arrive at the window, speak in the same garbled, incomprehensible fashion.\r\n\r\n15. Drive through with someone on the hood to accept the food.\r\n\r\n16. Bring along a Mr. Microphone. When the order-taker speaks, aim the mic at their speaker but do so while aiming the Mr. Microphone speaker at the mic to produce excruciating feedback of their own voice.\r\n\r\n17. One word: Flatulence!\r\n\r\n18. Have a friend hide in the trunk. When you approach the window to pickup your order, have him start yelling and banging his fists on the trunk.\r\n\r\n19. If you are a male, have a female friend place the order by speaking VERY seductively and suggestively into the speaker. When she finishes, have her hide and pull up to accept your order. See how many of the order-takers fellow employees have been called over to the window to \"check out the babe\".\r\n\r\n20. Change a flat tire in the drive-thru lane", "Getting married is very much like going to a restaurant with friends. \r\nYou order what you want, then when you see what the other person has, you wish you had ordered that.\r\n\r\nAfter a quarrel, a husband said to his wife, \"You know, I was a fool when I married you.\" \r\nShe replied, \"Yes, dear, but I was in love and didn't notice.\" \r\n\r\nMan is incomplete until he is married. \r\nThen he is finished.\r\n\r\nJust think, if it weren't for marriage, men would go through life thinking they had no faults at all.\r\n\r\nYou know the honeymoon is pretty much over when you start to go out with the boys on Wednesday nights, and so does she. \r\n\r\nI've got trouble with the wife again - she came into the bar looking for me and I asked for her number.\r\n\r\nThe theory used to be you marry an older man because they are more mature.\r\nThe new theory is that men don't mature. \r\nSo you might as well marry a younger one.\r\n\r\nThe difference between marriage and death? \r\nDead people are free.\r\n\r\nThe days just before marriage are like a snappy introduction to a tedious book\r\n\r\nLove is one long sweet dream, and marriage is the alarm clock.\r\n\r\nWhen a newly married man looks happy, we know why. \r\nBut when a ten-year married man looks happy, we wonder why.\r\n\r\nThere was this lover who said that he would go through hell for her. \r\nThey got married, and now he is going through hell.\r\n\r\nThere was a man who said, \"I never knew what happiness was until I got married...and then it was too late!\"\r\n\r\nMarried life is full of excitement and frustration:\r\n* In the first year of marriage, the man speaks and the woman listens.\r\n* In the second year, the woman speaks and the man listens.\r\n* In the third year, they both speak and the neighbors listen.\r\n\r\nIt is true that love is blind but marriage is definitely an eye-opener.\r\n\r\nA happy marriage is a matter of giving and taking; the husband gives and the wife takes.\r\n\r\nSon: How much does it cost to get married, Dad?\r\nFather: I don't know son, I'm still paying for it.\r\n\r\nSon: Is it true? Dad, I heard that in ancient China, a man doesn't know his wife until he marries.\r\nFather: That happens everywhere, son, everywhere!\r\n\r\nA husband is living proof that a wife can take a joke.\r\n\r\nMarriage is very much like a violin; after the sweet music is over, the strings are attached.\r\n\r\nMarriage is love. Love is blind. Therefore, marriage is an institution for the blind.\r\n\r\nMarriage is an institution in which a man loses his Bachelor's Degree and the woman gets her Masters.", "Team has no \"I\" in it, but it does have a \"M\" and \"E\" in it, making \"me\".", "Politically correct word for dead: Living Impaired", "Conserve water and electricity, shower with a steamy hot friend.", "I'm a nobody and nobody is perfect - therefore, I am perfect.", "Definition of alien-people from another country.", "I was reading an article yesterday that was talking about the University of Michigan. They referred to it as MU.\r\n\r\nThis got me to thinking....\r\n\r\nWhat do they call the University of Florida?", "If ham is Canadian bacon, then what the heck do you Canadians call bacon?", "BLAH!BLAH!BLAH!BLAH!BLAH!BLAH!BLAH!BLAH!BLAH!BLAH!BLAH!BLAH!", "Liners", "Why can't you go to the bathroom at a Beatles concert?\r\n\r\nThere's no John.", "If you are inventing something, the best way for it to work is to give it a job.", "The similarity of all the people that live is that they are alive and they are living.", "The thing you need to focus on in your 20's is not getting a bad tattoo. You don't want to be 40 and going, \"No, dude, it was different back then - everybody loved SpongeBob.\"", "The reason grandparents and children get along so well is really quite simple: They have a common enemy.", "What do Michael Jackson and Speed Racer have in common?\r\n\r\n\r\n\r\n\r\n\r\n\r\nThey both have a monkey and a small boy in their trunk.", "Jersey girls aren't trash; trash gets picked up.", "An elderly couple was attending Mass.\r\nAbout halfway through, the wife leans over and says to her husband, 'I just let out a silent fart; what do you think I should do?\r\nHe replies, 'Put a new battery in your hearing aid.'", "Do you think god gets stoned? I do. Look at the platypus!\r\n\r\n-Robin Williams", "What do you call a black priest?\r\nHoly Crap!", "Good morning is a contradiction in terms.", "What do you call an intelligent man in America?\r\n\r\nA tourist.", "You know you're addicted to wocka when your friends say something funny, and you cry out ''LOL, LOL'' instead of actually laughing out loud.", "What a bullfighter tries to do. (avoid-a-bull)", "too much to pay for corn ([a] buck an ear)", "A fashionably dressed big cat (dandy lion)", "Possessing only ten teeth. (deca-dent)", "Where people wait for buses. (the-bus-station)", "live long (die late)", "Consumption of an expensive meal. (fortune-ate)", "A flaming elf. (imp-alight)", "where one places dirty dishes (in the sink)", "Italian suppositories. (in-you-end-os)", "Me not on time. (I-(am)-so-late)", "An English tramp. (hobo)", "In favour of youth. (pro-teen)", "What trees do in Spring. (re-leaf)", "how geese fly (in formation)", "Is that a gun in your pocket or are you just happy to see me?", "Wenn ist das Nunstruck git und Slotermeyer? Ja! Beiherhund das Oder die Flipperwaldt gersput!", "Humor can be dissected, as a frog can, but the thing dies in the process and the innards are discouraging to any but the pure scientific mind.", "\"Big foot is blurry... that's the problem!\"", "\"It would be funny if, while performing an abortion, someone yelled 'abort! abort!'\"", "I have nothing to declare except my genius.", "Race is just a pigment of the imagination.", "If all those sweet young things were laid end to end â\u0080\u0093 I wouldn't be a bit surprised.", "Take my wife â\u0080\u0093 please!", "If it wasn't for pickpockets, I'd have no sex life at all.", "Overall, I'd say my career as a photographer has been a bit of a blur.", "I have a map of the world... its actual size.", "What you humans call 'THE APOCALYPSE', I used to call Sunday Dinner! \r\n \r\n- Archangel, Gabriel", "If your father is a poor man, it's your fate. But, if your father-in-law is a poor man, it's your stupidity.", "You've probably heard: If at first you don't succeed, lower your standards. \r\n\r\n\r\nNew Version: If at first you get hit below the belt, lower your belt!", "Rabinovich notes: \"I would prefer it the other way round.\"", "What's the Swedish word for divorce and swearing?\r\n\r\nIkea.", "Yo momma's like Geico: so easy a caveman could do it.", "The only person in our town who can afford to go on a jaguar is a zoo-keeper.", "Dreams are like underpants. You've got 'em, but you can't prove you do by showing it to everyone.", "Whoever said nothing is impossible has never tried slamming a revolving door.", "Ever since Rhianna got dumped by her boyfriend, she put all the stuff that was his or made her remember him she put : \" to the left to the left... in the box on the left...\"", "Trousers: Hot off the press .\r\n\r\n. . . / - - -\r\nI regret writing that.\r\nRemorse Code\r\n\r\nDoes anyone here have a giant catapult?\r\nNo? It was a long shot.. \r\n\r\nSaw two space hoppers outside a nightclub.\r\nI said: 'Who are you?'\r\nThey said: 'We're the bouncers'\r\n\r\nI had a TV Show about trees.\r\nBut it got axed.\r\n\r\nWhat do you get if you cross a human with a dog?\r\nArrested.\r\n\r\nI can speak to kettles.\r\nBecause I'm boilingual.\r\n\r\nSaw an artist dressed all in black.\r\nIt was Vincent Van Goth. \r\n\r\nHotel receptionists are bit inappropriate, aren't they?\r\nThey all just sit there, checking people out.\r\n\r\nMy girlfriend said: \"Why do you always lie?\"\r\nI said: \"Because it's easier than standing up\" \r\n\r\nI think I got a phone-call about the world's worst queue.\r\nIt was a very bad line", "A gay pornstar doesn't take as many balls to the face as my 4 year old son playing soccer.", "One day I was standing in the park wondering how frisbees get bigger when they get closer. Then it hit me.", "Mary had a little lamb, fries and a coke.", "I don't know much about prison, but it sounds like a pain in the ass.", "\"Mom! Deaf kids at school are making fun of me.\"\r\n\r\n\"What did they say?\"", "The word 'function' should never function as a verb.", "I bet you I could stop gambling.", "Hey! Football team! Get off the band field!", "", "What does a Polack use a \"rubber\" for?  Seal-a-meal", "What do you get when you cross a Polack and a Mongoloid with one leg?  a\r\n  Polaroid 1 Step", "What is better than 4 roses on a piano?  Two lips on an organ", "What do you call a truck load of vibrators?  Toys for twats", "What do you call a herd of masturbating cattle?  Beef Strokenoff", "Why does an elephant have 4 feet?  Because 8 inches isn't enough", "What do you call 2 gay guys named Bob?  Oral Roberts", "What can you use used tampons for?  Tea bags for vampires", "How can you tell a Polish woman is on her period?  She's only wearing 1 sock", "What's the leading killer among Polish women?  Toxic sock syndrome", "How do you get a polish woman pregnant?  Cum in her shoes and the flies do\r\n  the rest.", "How do you get 3 Polacks off a couch?  Jerk 1 off and the other 2 cum", "What's red and has 7 dents?  Snow White's cherry", "What do you get when you cross a Mexican with an octopus?  I don't know, but\r\n  it can sure pick lettuce", "What do soy beans and dildos have in common?Both are meat subsitutes", "What's the difference between chicken and meat?  If you beat your chicken it\r\n  would die", "Why are chickens so ugly?  They have a pecker on their face", "What do you call a cow with and abortion?  Decalfinated", "What do you call a pimple on a Polacks ass?  A brain tumor", "Have you heard of a new Tox Shock Rock group?  They only play ragtime", "What do eating pussy and the Mafia have in common?  One slip of the tongue\r\n  and you're in deep shit", "How do you make paper dolls?Screw an old bag", "How can you tell a Head nurse?  The one with dirty knees", "Have you heard about the new Vietnamese cookbook?  It's called 101 ways to\r\n  wok your dog", "What do you get when you cross a Mexican with an Oriental?  A car thief who\r\n  can't drive", "What did the Polack do with his first 50-cent piece?He married her", "What do the Post Office & Kinney's have in common?  Both have 30,000 black\r\n  loafers", "How do you cure a Jewish woman of nymphomania?  Marry her", "What's Billy Jean King's latest advertising sponsor?  Strap on Tools of\r\n  America", "What's worse than getting raped by Jack the Ripper?  Getting fingered by\r\n  Captain Hook", "Why did the Italian staple his nuts together?  Since he couldn't lick 'em, he\r\n  felt he should join them", "Three Polacks on a couch - which one's the cock sucker?  The one who's\r\n  spitting feathers", "What do you get when you cross a black guy with Bo Derek?  A \"Ten of Spades\"", "What do you do when your kotex catches fire?Throw it on the floor and\r\n  tampon it", "What's invisible and smells like carrots?  Bunny farts", "How can you tell Dolly Parton's kids in a group?  They're the ones with\r\n  stretch marks on their lips", "What's old, wrinkled and smells like Ginger?  Fred Astair's face", "What's green, and smells like Miss Piggy?  Kermit's finger", "Which of the following doesn't belong?  a wife, meat, eggs, or a blowjob?  A\r\n  blowjob.  You can beat your wife, eggs or meat; but you can't beat a blowjob", "Why do black guys wear high-heeled shoes?  To keep from scraping their\r\n  knuckles when they walk", "How can you tell a black person has been shot in the head?  By the hole in\r\n  his radio", "What will they call teh first black test tube baby?  Janitor in a drum", "Why can't little black kids play in sandboxes?  Cats keep trying to cover\r\n  them up", "What's the definition of a virgin?  An ugly third grader", "What's the definition of a Happy Roman?  Gladiator", "What do elephants use for a tampon?  Sheep", "What do you call this?  (Puff out cheeks) Polish sperm bank", "What do you call this?  (Stick out tongue) Lesbian with a hard-on", "Why don't Mexicans barbeque?  Because the beans slip through the grill", "What do you call a Mexican Baptism?  Bean Dip", "Have you heard about the new black disaster movie?  It's called\r\n  A-pack-of-lips Now", "What did the hurricane say to the coconut tree?  Hold onto your nuts!.  This\r\n  ain't gonna be no ordinary blowjob.", "What do you call a female clone?  A clunt.", "What do you call a Polock with an I.Q.  of 176?  A village.", "What's the definition of the perfect woman?  1) She's three feet tall, has a\r\n  round hole for a mouth and her head is flat so you can rest coctails on it.\r\n  2) The sports model has pull back ears and her teeth fold in.  3) The economy\r\n  model; she fucks all night and at midnight she turns into a roastbeef\r\n  sandwich and a six pack.", "Why is Ray Charles smiling all the time?  Because he doesn't know he is\r\n  black.", "Why do they call camels the ships of the desert?  Because they're full of\r\n  Iranian seamen.", "Why did God give blacks rhythm?  Because he fucked up their hair.", "What do you call a black test tube baby?  Janitor in a drum.", "What do elephants use for tampons?  Sheep.", "What do you get when you cross a donkey with an onion?  A piece of ass that\r\n  makes your eyes water.", "How do you say \"fuck you\" in Jewish?  Trust me.", "Why do dogs lick their balls?  Because they can.", "Why don't Puerto Ricans have checking accounts?  Because it's hard to sign\r\n  checks with a spray can.", "What are the two greatest lies?  The check is in the mail, and I won't come\r\n  in your mouth.", "How do you brainwash an Italian?  Give him an enema.", "Why wasn't Christ born in Italy?  Because they couldn't find three wise men\r\n  and a virgin.", "Did you hear about the Polock who studied five days for a urine test?", "Did you hear about the Polock who thought asphalt was a rectal problem?", "What do you say to a one legged hitch-hiker?Hop in.", "Why do Jews havev such big noses?  Because air is free.", "Why was one of Helen Keller's legs yellow?  Because her dog was blind, too.", "Why did the gut trade in his wife for an outhouse?  Because the hole was\r\n  smaller and the smell was better.", "Did you hear that the NFL is going to use green footballs next year?Did you\r\n  ever hear of a black dropping a watermelon?", "Where do you get virgin wool?  From ugly sheep.", "What did Adam say to Eve?  Stand back, I don't know how big this thing gets.", "What's green and smells like pigs?  Kermit's finger.", "How do you break a Polock's finger?  Punch him in the nose.", "Why are chickens so ugly?  You'd be ugly, too, if you had a pecker hanging\r\n  out of your forehead.", "Where is an elephant's sex organ?  In his feet; if he steps on you you're\r\n  fucked.", "What do you call a gay Indian?  A brave fucker.", "Why does Nancy Reagan always climb on top?  Because Ronnie can only fuck-up.", "What do you call an Italian with an I.Q.  of 180?  Sicily.", "What's another reason God created the orgasm?  Because he couldn't wait for\r\n  the second coming.", "Why is being a dick not all it's cracked up to be?  First of all you have a\r\n  head but no brains; there's a couple of nuts following you around all the\r\n  time; your next door neighbor is an asshole and you best friend is a cunt.", "What do you call a beautiful girl in Poland?A tourist.", "Did you hear about the new Vietnamese cookbook?  100 ways to WOK your dog.", "What does a guy with a 12 inch cock have for breakfast?  I usually have bacon\r\n  and eggs.", "You know it's going to be a bad day when you get to your office and there's a\r\n  60 Minutes News Team waiting for you.", "Why do Mexicans have re-fried beans?Have you ever heard of a Mexican doing\r\n  anything right the first time?", "What's the definition of mass confusion?  Father's day in Oakland.", "What's the ultimate rejection?  When you're masturbating and your hand falls\r\n  asleep.", "What happens to a Jewish man when he walks into a wall with a full erection?\r\n  He breaks his nose.", "How come the Mexican Army only used 600 Mexicans at the Alamo?  Because they\r\n  only had 2 cars.", "If God hadn't meant pussy to be eaten, he wouldn't have made it look like a\r\n  taco.", "You know the bartender's pissed-off when you find a string hanging out of\r\n  your bloody mary.", "Why is Italy shaped like a boot?  Do you think they could fit all that shit\r\n  in a tennis shoe?", "What's the hardest thing about a sex change from a man to a woman?  Inserting\r\n  the anchovies.", "Did you hear about Ku Klux Knievel?  He tried to jump 18 blacks with a steam\r\n  roller.", "What do you call a Greek girl who keeps running away from home?  A virgin.", "What's a Polish shishkabob?  A flaming arrow through a garbage can.", "What do you do in case of fallout?  Put it back in and take shorter strokes.", "Why don't Italians eat fleas?  Because they can't get their little legs\r\n  apart.", "What do you do with a dog that doesn't have any legs?  Take him for a drag.", "What's the brown stuff between elephant's toes?  Slow natives.", "How do you know when an elephant's been fucking in your garage?  Your Hefty\r\n  bags are missing.", "Why are Dolly Parton's feet so small?  Nothing grows in the shade\r\nCall The Works BBS - 1600+ Textfiles! - [914]/238-8195 - 300/1200 - Always Open"]