[["0thefool.jpeg", "0\n-  The Fool\n Moment to moment, and with every step, the\nFool\nleaves the past behind. He carries nothing more than his purity,\ninnocence and trust, symbolized by the white rose in his hand. The\npattern on his waistcoat contains the colors of all four elements of\nthe tarot, indicating that he is in harmony with all that surrounds\nhim. His intuition is functioning at its peak. At this moment the Fool\nhas the support of the universe to make this jump into the unknown.\nAdventures await him in the river of life.\n\n\nThe card indicates that if you trust your intuition right now, your\nfeeling of the 'rightness' of things, you cannot go wrong. Your actions\nmay appear 'foolish' to others, or even to yourself, if you try to\nanalyze them with the rational mind. But the 'zero' place occupied by\nthe Fool is the numberless number where trust and innocence are the\nguides, not skepticism and past experience."], ["01existance.jpeg", "1\n-\nExistence\nThis naked figure sits on the lotus leaf of\nperfection, gazing at the beauty of the night sky. She knows that\n\"home\" is not a physical place in the outside world, but an inner\nquality of relaxation and acceptance. The stars, the rocks, the trees,\nthe flowers, fish and birds--all are our brothers and sisters in this\ndance of life. We human beings tend to forget this, as we pursue our\nown private agendas and believe we must fight to get what we need. But\nultimately, our sense of separateness is just an illusion, manufactured\nby the narrow preoccupations of the mind.\n\n\nNow is the time to look at whether you are allowing yourself to receive\nthe extraordinary gift of feeling \"at \"home\" wherever you are. If you\nare, be sure to take time to savor it so it can deepen and remain with\nyou. If on the other hand you've been feeling like the world is out to\nget you, it's time to take a break. Go outside tonight and look at the\nstars."], ["02innervoice.jpeg", "2-\nInner Voice\nThe Inner Voice\nspeaks not in words but in the wordless language of the heart. It is\nlike an oracle who only speaks the truth. If it had a face, it would be\nlike the face at the center of this card--alert, watchful, and able to\naccept both the dark and the light, symbolized by the two hands holding\nthe crystal. The crystal itself represents the clarity that comes from\ntranscending all dualities.\n \nThe Inner Voice can also be playful, as it dives\ndeep into the emotions and emerges again to soar towards the sky, like\ntwo dolphins dancing in the waters of life. It is connected with the\ncosmos, through the crescent-moon crown, and the earth, as represented\nby the green leaves on the figure's kimono. \n\n\nThere are times in our lives when too many voices seem to be pulling us\nthis way and that. Our very confusion in such situations is a reminder\nto seek silence and centering within. Only then are we able to hear our\ntruth."], ["03creativity.jpeg", "3\n- Creativity\nFrom the alchemy of fire and water below to the\ndivine light entering from above, the figure in this card is literally\n'possessed by' the creative force. Really, the experience of creativity\nis an entry into the mysterious. Technique, expertise and knowledge are\njust tools; the key is to abandon oneself to the energy that fuels the\nbirth of all things.\n\nThis energy has no form or structure, yet all the forms and structures\ncome out of it. It makes no difference what particular form your\ncreativity takes--it can be painting or singing, planting a garden or\nmaking a meal. The important thing is to be open to what wants to be\nexpressed through you.\n\nRemember that we don't possess our creations; they do\nnot belong to us.\nTrue creativity arises from a union with the divine, with the mystical\nand the unknowable. Then it is both a joy for the creator and a\nblessing to others."], ["04rebel.jpeg", "4\n- The Rebel\n \nThe powerful and authoritative figure in this\ncard\nis clearly the master of his own destiny. On his shoulder is an emblem\nof the sun, and the torch he holds in his right hand symbolizes the\nlight of his own hard-won truth. Whether he is wealthy or poor, the\nRebel is really an emperor because he has broken the chains of\nsociety's repressive conditioning and opinions. He has formed himself\nby embracing all the colors of the rainbow, emerging from the dark and\nformless roots of his unconscious past and growing wings to fly into\nthe sky. His very way of being is rebellious--not because he is\nfighting against anybody or anything, but because he has discovered his\nown true nature and is determined to live in accordance with it. The\neagle is his spirit animal, a messenger between earth and sky. The\nRebel challenges us to be courageous enough to take responsibility for\nwho we are and to live our truth."], ["05nothingness.jpeg", "5\n- No-Thingness\n Being \"in the gap\" can be disorienting and\neven\nscary. Nothing to hold on to, no sense of direction, not even a hint of\nwhat choices and possibilities might lie ahead. But it was just this\nstate of pure potential that existed before the universe was created.\nAll you can do now is to relax into this no-thingness...fall into this\nsilence between the words...watch this gap between the outgoing and\nincoming breath. And treasure each empty moment of the experience.\nSomething sacred is about to be born."], ["06lovers.jpeg", "6\n- The Lovers\nWhat we call love is really a whole spectrum of\nrelating, reaching from the earth to the sky. At the most earthy level,\nlove is sexual attraction. Many of us remain stuck there, because our\nconditioning has burdened our sexuality with all kinds of expectations\nand repressions. Actually the biggest \"problem\" with sexual love is\nthat it never lasts. Only if we accept this fact can we then really\ncelebrate it for what it is--welcome its happening, and say good-bye\nwith gratitude when it's not.\n\nThen as we mature, we can begin to experience the love that exists\nbeyond sexuality and honors the unique individuality of the other. We\nbegin to understand that our partner often functions as a mirror,\nreflecting unseen aspects of our deeper self and supporting us to\nbecome whole. This love is based in freedom, not expectation or need.\nIts wings take us higher and higher towards the universal love that\nexperiences all as one."], ["07awareness.jpeg", "7\n- Awareness\nThe veil of illusion, or maya, that has been\nkeeping you from\nperceiving reality as it is, is starting to burn away. The fire is not\nthe heated fire of passion, but the cool flame of awareness. As it\nburns the veil, the face of a very delicate and childlike buddha\nbecomes visible.\n\nThe awareness that is growing in you now is not the result of any\nconscious \"doing\", nor do you need to struggle to make something\nhappen. Any sense you might have had that you've been groping in the\ndark is dissolving now, or will be dissolving soon. \n\n\nLet yourself\nsettle, and remember that deep inside you are just a witness, eternally\nsilent, aware and unchanged. A channel is now opening from the\ncircumference of activity to that center of witnessing. It will help\nyou to become detached, and a new awareness will lift the veil from\nyour eyes."], ["08courage.jpeg", "8\n- Courage\nThis card shows a small wildflower that has met\nthe\nchallenge of the rocks and stones in its path to emerge into the light\nof day. Surrounded by an aura of bright golden light, it exposes the\nmajesty of its tiny self. Unashamed, it is equal to the brightest sun.\n\n\nWhen we are faced with a very difficult situation we have a choice: we\ncan either be resentful, and try to find somebody or something to blame\nfor the hardships, or we can face the challenge and grow.\n\nThe flower shows us the way, as its passion for life leads it out of\nthe darkness and into the light. There is no point fighting against the\nchallenges of life, or trying to avoid or deny them. They are there,\nand if the seed is to become the flower we must go through them. Be\ncourageous enough to grow into the flower you are meant to be."], ["09aloneness.jpeg", "9\n- Aloneness\nWhen there is no \"significant other\" in our lives\nwe can either be\nlonely, or enjoy the freedom that solitude brings. When we find no\nsupport among others for our deeply felt truths, we can either feel\nisolated and bitter, or celebrate the fact that our vision is strong\nenough even to survive the powerful human need for the approval of\nfamily, friends or colleagues. \n\n\nIf you are facing such a situation now, be aware of how you are\nchoosing to view your \"aloneness\" and take responsibility for the\nchoice you have made.\n\nThe humble figure in this card glows with a light that emanates from\nwithin. One of Gautam Buddha's most significant contributions to the\nspiritual life of humankind was to insist to his disciples, \"Be a light\nunto yourself.\" Ultimately, each of us must develop within ourselves\nthe capacity to make our way through the darkness without any\ncompanions, maps or guide."], ["10change.jpeg", "10\n- Change\nThe symbol in this card is an enormous wheel\nrepresenting time, fate,\nkarma. Galaxies spin around this constantly moving circle, and the\ntwelve signs of the zodiac appear on its circumference. Just inside the\ncircumference are the eight trigrams of the I Ching, and even closer to\nthe center are the four directions, each illuminated by the energy of\nlightning. The spinning triangle is at this moment pointed upward,\ntoward the divine, and the Chinese symbol of yin and yang, male and\nfemale, creative and receptive, lies at the center.\n\nIt has often been said that the only unchanging thing in the world is\nchange itself. Life is continuously changing, evolving, dying and being\nreborn. All opposites play a part in this vast circular pattern. \n\n\nIf you cling to the edge of the wheel you can get dizzy! Move toward\nthe center of the cyclone and relax, knowing that this too will pass."], ["11breakthrough.jpeg", "11\n- Breakthrough\nThe predominance of red in this card indicates at\na glance that its\nsubject is energy, power and strength. The brilliant glow emanates from\nthe solar plexus, or center of power on the figure, and the posture is\none of exuberance and determination. All of us occasionally reach a\npoint when \"enough is enough.\"\n\nAt such times it seems we must do something, anything, even if it later\nturns out to be a mistake, to throw off the burdens and restrictions\nthat are limiting us. If we don't, they threaten to suffocate and\ncripple our very life energy itself. \n\n\nIf you are now feeling that\n\"enough is enough,\" allow yourself to take the risk of shattering the\nold patterns and limitations that have kept your energy from flowing.\nIn doing so you will be amazed at the vitality and empowerment this\nBreakthrough can bring to your life."], ["12newvision.jpeg", "12\n- New Vision\nThe figure on this card is being born anew,\nemerging from his\nearthbound roots and growing wings to fly into the unbounded. The\ngeometric shapes around the body of the figure show the many dimensions\nof life simultaneously available to him. The square represents the\nphysical, the manifest, the known. The circle represents the\nunmanifest, the spirit, pure space. And the triangle symbolizes the\nthreefold nature of the universe: manifest, unmanifest, and the human\nbeing who contains both.\n\n\nNow you are presented with an opportunity to see life in all its\ndimensions, from the depths to the heights. They exist together, and\nwhen we come to know from experience that the dark and the difficult\nare needed as much as the light and easy, then we begin to have a very\ndifferent perspective on the world. By allowing all of life's colors to\npenetrate us, we become more integrated."], ["13transformation.jpeg", "13\n- Transformation\nThe central figure in this card sits atop the\nvast flower of the void,\nand holds the symbols of transformation--the sword that cuts through\nillusion, the snake that rejuvenates itself by shedding its skin, the\nbroken chain of limitations, and the yin/yang symbol of transcending\nduality. One of its hands rests on its lap, open and receptive. The\nother reaches down to touch the mouth of a sleeping face, symbolizing\nthe silence that comes when we are at rest.\n\n\nThis is a time for a deep let-go. Allow any pain, sorrow, or difficulty\njust to be there, accepting its \"facticity\". It is very much like the\nexperience of Gautam Buddha when, after years of seeking, he finally\ngave up knowing there was nothing more that he could do. That very\nnight, he became enlightened. Transformation comes, like death, in its\nown time. And, like death, it takes you from one dimension into another."], ["14integration.jpeg", "14 - Integration\nThe image of integration is the union mystica,\nthe fusion of opposites.\nThis is a time of communication between the previously experienced\ndualities of life. Rather than night opposing day, dark suppressing\nlight, they work together to create a unified whole, turning endlessly\none into the other, each containing in its deepest core the seed of the\nopposite.\n\nThe eagle and the swan are both beings of flight and majesty. The eagle\nis the embodiment of power and aloneness. The swan is the embodiment of\nspace and purity, gently floating and diving upon and within the\nelement of the emotions, entirely content and complete within her\nperfection and beauty. We are the union of eagle and swan: male and\nfemale, fire and water, life and death. \n\n\nThe card of integration is the symbol of self-creation, new life, and\nmystical union; otherwise known as alchemy."], ["15conditioning.jpeg", "15 - Conditioning\n\n\nThis card recalls an old Zen story, about a lion who was brought up by\nsheep and who thought he was a sheep until an old lion captured him and\ntook him to a pond, where he showed him his own reflection. Many of us\nare like this lion--the image we have of ourselves comes not from our\nown direct experience but from the opinions of others. A \"personality\"\nimposed from the outside replaces the individuality that could have\ngrown from within. We become just another sheep in the herd, unable to\nmove freely, and unconscious of our own true identity.\n\n\nIt's time to take a look at your own reflection in the pond, and make a\nmove to break out of whatever you have been conditioned by others to\nbelieve about yourself. Dance, run, jog, do gibberish--whatever is\nneeded to wake up the sleeping lion within."], ["16thunderbolt.jpeg", "16\n- Thunderbolt\nThe card shows a tower being burned, destroyed,\nblown apart. A man and\na woman are leaping from it not because they want to, but because they\nhave no choice. In the background is a transparent, meditating figure\nrepresenting the witnessing consciousness. You might be feeling pretty\nshaky right now, as if the earth is rocking beneath your feet. Your\nsense of security is being challenged, and the natural tendency is to\ntry to hold on to whatever you can.\n\n\nBut this inner earthquake is both necessary and tremendously\nimportant--if you allow it, you will emerge from the wreckage stronger\nand more available for new experiences. After the fire, the earth is\nreplenished; after the storm the air is clear. Try to watch the\ndestruction with detachment, almost as if it were happening to somebody\nelse. Say yes to the process by meeting it halfway."], ["17silence.jpeg", "17\n- Silence\nThe silent mirrorlike receptiveness of a\nstar-filled night with a full\nmoon is reflected in the misty lake below. The face in the sky is deep\nin meditation, a goddess of the night who brings depth, peace and\nunderstanding. Now is a very precious time. It will be easy for you to\nrest inside, to plumb the depths of your own inner silence to the point\nwhere it meets the silence of the universe.\n\nThere's nothing to do, nowhere to go, and the quality of your inner\nsilence permeates everything you do. It might make some people\nuncomfortable, accustomed as they are to all the noise and activity of\nthe world. Never mind; seek out those who can resonate with your\nsilence, or enjoy your aloneness. \n\n\nNow is the time to come home to\nyourself. The understanding and insights that come to you in these\nmoments will be manifested later on, in a more outgoing phase of your\nlife."], ["18pastlives.jpeg", "18\n- Past Lives\nThe hands of existence form the shape of the\nfemale genitals, the\nopening of the cosmic mother. Revealed within are many images, faces\nfrom other times. While it might be entertaining to fantasize about\nfamous past lives, it is just a distraction. The real point is to see\nand understand the karmic patterns of our lives, and their roots in an\nendless repetitive cycle that traps us in unconscious behavior. The two\nrainbow lizards on either side represent knowing and not-knowing. They\nare the guardians of the unconscious, making sure that we are prepared\nfor a vision that might otherwise be shattering.\n\nA glimpse into the eternity of our existence is a gift, and\nunderstanding the function of karma in our lives is not something that\ncan be grasped at will. \n\n\nThis is a wake-up call; the events in your life\nare trying to show you a pattern as ancient as the journey of your own\nsoul."], ["19innocence.jpeg", "19\n- Innocence\nThe old man in this card radiates a childlike\ndelight in the world.\nThere is a sense of grace surrounding him, as if he is at home with\nhimself and with what life has brought. He seems to be having a playful\ncommunication with the praying mantis on his finger, as if the two of\nthem are the greatest friends. The pink flowers cascading around him\nrepresent a time of letting go, relaxation and sweetness. They are a\nresponse to his presence, a reflection of his own qualities.\n\nThe innocence that comes from a deep experience of life is childlike,\nbut not childish. The innocence of children is beautiful, but ignorant.\nIt will be replaced by mistrust and doubt as the child grows and learns\nthat the world can be a dangerous and threatening place. But the\ninnocence of a life lived fully has a quality of wisdom and acceptance\nof the ever-changing wonder of life."], ["20beyondillusion.jpeg", "20 - Beyond Illusion\nThe butterfly in this card represents the outer,\nthat which is\nconstantly moving and that which is not real but an illusion. Behind\nthe butterfly is the face of consciousness, looking inward to that\nwhich is eternal. The space between the two eyes has opened, revealing\nthe lotus of spiritual unfoldment and the rising sun of awareness.\nThrough the rising of the inner sun, meditation is born.\n\n\nThe card reminds us not to look outside for what is real, but to look\nwithin. When we focus on externals, we too often get caught up in\njudgments--this is good, this is bad, I want this, I don't want that.\nThese judgments keep us trapped in our illusions, our sleepiness, our\nold habits and patterns. Drop your opinionated mind, and move inside.\nThere, you can relax into your own deepest truth, where the difference\nbetween dreams and reality is already known."], ["21completion.jpeg", "21 - Completion\nHere the last piece of a jigsaw puzzle is being\nput into its place, the\nposition of the third eye, the place of inner perception. Even in the\never-changing flow of life there are moments in which we come to a\npoint of completion. In these moments we are able to perceive the whole\npicture, the composite of all the small pieces that have occupied our\nattention for so long. In the finishing, we can either be in despair\nbecause we don't want the situation to come to an end, or we can be\ngrateful and accepting of the fact that life is full of endings and new\nbeginnings.\n\nWhatever has been absorbing your time and energy is now coming to an\nend. In completing it, you will be clearing the space for something new\nto begin. Use this interval to celebrate both--the end of the old and\nthe coming of the new."], ["master.jpeg", "The Master\nThe Master in Zen is not a master over others,\nbut a master of himself.\nHis every gesture and his every word reflect his enlightened state. He\nhas no private goals, no desire that anything should be other than the\nway it is. His disciples gather around him not to follow him, but to\nsoak up his presence and be inspired by his example. In his eyes they\nfind their own truth reflected, and in his silence they fall more\neasily into the silence of their own beings.\n\nThe master welcomes the disciples not because he wants to lead them,\nbut because he has so much to share. Together, they create an energy\nfield that supports each unique individual in finding his or her own\nlight. If you can find such a master you are blessed. If you cannot,\nkeep on searching. Learn from the teachers, and the would-be masters,\nand move on. Charaiveti, charaiveti, said Gautam Buddha. Keep on moving."]]